//------------------------------------------------------------------------------
//                                           (c) корпорация ГАЛАКТИКА
// Версия        : 5.73
// Назначение    : Отчет о суммах,  фактически  оплаченных АО МГТС средств по
//          судебным решениям по искам юри-дических и физических лиц в период
//------------------------------------------------------------------------------
#doc
<p>Отчет о суммах, фактически оплаченных АО МГТС средств по судебным решениям по<br>
искам юридических и физических лиц в период
#end
.form Otchet15
.p 60
.DEFO LANDSCAPE
.hide
.fields
 Nam1
 period
 Nam
.endfields
^^^
.{ Otdelen15 CheckEnter
.[h

.]h
.fields
 f1:string
 f2:double
.endfields
^^
.}
.fields
 fS1:double
.endfields
^
.endform