// ------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.0 - Бухгалтерский контур
// Журнал регистрации приходных и расходных кассовых документов
// ------------------------------------------------------------------------------

#doc
Журнал регистрации приходных и расходных кассовых документов
#end
.set name = 'Kassa_KO3'
.nameinlist 'Базовая форма'
.hide
.fields
! Шапка
c0p1
c0p2
c0p2un
c0p2ok
c0valpriznak: word    // признак печати журнала в валюте: = 0 - в НДЕ,
                      // = 1 - валютный, > 1 - мультивалютный
c0rub
c0rubley
c0p3
c0p4
c0p5
! Цикл 1
c1p0  // заголовок цикла 1
vDol
vcent
vDol1
vcent1
! Приходный документ (форма 1а)
c1p1    // дата
c1p2    // номер
c1p3    // сумма+валюта
c1p4    // ФИО
c1p5    // примечание
! Расходный документ (форма 1а)
c1p6    // дата
c1p7    // номер
c1p8    // сумма+валюта
c1p9    // ФИО
c1p10   // примечание
! Цикл 2
c2p0
c2p01
c2p02
c2p03
c2p04
c2p05
namep1  // горизонтальный цикл: наименование целевого назначения
namep2
namep3
c2p06
nump    // горизонтальный цикл: номер колонки целевого назначения
numprp1
numprp2
numprp3
numprp4
c2p07
! Приходный документ (форма 1)
c2p1    // дата
c2p2    // номер
sump    // горизонтальный цикл: сумма целевого назначения
sumprp  // прочее целевое назначение
c2p3    // сумма
c2p4    // ФИО
c2p5    // примечание
! Итого (приход)
sumitogop     // горизонтальный цикл: итоговая сумма целевого назначения
sumitogoprp   // прочее целевое назначение (итого)
sumitogoallp  // сумма итого (приход)
! Цикл 3
c3p0    // год
c3p01
c3p02
c3p03
c3p04
c3p05
namer1  // горизонтальный цикл: наименование целевого назначения
namer2
namer3
c3p06
numr    // горизонтальный цикл: номер колонки целевого назначения
numprr1
numprr2
numprr3
numprr4
c3p07
! Расходный документ (форма 1)
c3p1    // дата
c3p2    // номер
sumr    // горизонтальный цикл: сумма целевого назначения
sumprr  // прочее целевое назначение
c3p3    // сумма
c3p4    // ФИО
c3p5    // примечание
! Итого (расход)
sumitogor     // горизонтальный цикл: итоговая сумма целевого назначения
sumitogoprr   // прочее целевое назначение (итого)
sumitogoallr  // сумма итого (расход)
.endfields

c0p1    структурное подразделение ^
c0p2    Наименование              ^
c0p2un  ИНН(УНН)                  ^
c0p2ok  ОКПО                      ^
c0valpriznak  признак печати журнала в валюте: true - в валюте ^
c0rub   валюта                    ^
c0rubley валюта                   ^
c0p3    год                       ^
c0p4    должность                 ^
c0p5    ФИО                       ^
.{FirstCycle checkenter
.[h
c1p0   год ^
vDol   вал ^
vCent  вал ^
vDol1  вал ^
vCent1 вал ^
.]h
c1p1    дата приходного документа     ^
c1p2    номер приходного документа    ^
c1p3    сумма по приходному документу ^
c1p4    ФИО                           ^
c1p5    примечание                    ^
c1p6    дата расходного документа     ^
c1p7    номер расходного документа    ^
c1p8    сумма по расходному документу ^
c1p9    ФИО                           ^
c1p10   примечание                    ^
.if LastPass
.else
.end
.}
.{SecondCycle checkenter
.[h
c2p0    ^
c2p01   ^
c2p02   ^
c2p03   ^
c2p04   ^
c2p05   ^
namep1  ^
namep2  ^
namep3  ^
c2p06   ^
nump    ^
numprp1 ^
numprp2 ^
numprp3 ^
numprp4 ^
c2p07   ^
.]h
c2p1    ^  // дата
c2p2    ^  // номер
sump       .{.?Kassa_KO3_p1; ^          │.}
sumprp  ^  // прочее целевое назначение
c2p3    ^  // сумма
c2p4    ^  // ФИО
c2p5    ^  // примечание
.if LastPrihod
          .{.?Kassa_KO3_p3;────────────┼.}
sumitogop .{.?Kassa_KO3_p4; ^          │.}
sumitogoprp  ^  // прочее целевое назначение (итого)
sumitogoallp ^  // сумма итого (приход)
          .{.?Kassa_KO3_p5;────────────┴.}
.else
           .{.?Kassa_KO3_p2;────────────┼.}
.end
.}
.if ToNextPage

.end
.{ThirdCycle checkenter
.[h
c3p0    ^
c3p01   ^
c3p02   ^
c3p03   ^
c3p04   ^
c3p05   ^
namer1  ^
namer2  ^
namer3  ^
c3p06   ^
numr    ^
numprr1 ^
numprr2 ^
numprr3 ^
numprr4 ^
c3p07   ^
.]h
c3p1    ^  // дата
c3p2    ^  // номер
sumr       .{.?Kassa_KO3_r1; ^          │.}
sumprr  ^  // прочее целевое назначение
c3p3    ^  // сумма
c3p4    ^  // ФИО
c3p5    ^  // примечание
.if LastRashod
          .{.?Kassa_KO3_r3;────────────┼.}
sumitogor .{.?Kassa_KO3_r4; ^          │.}
sumitogoprr  ^  // прочее целевое назначение (итого)
sumitogoallr ^  // сумма итого (приход)
          .{.?Kassa_KO3_r5;────────────┴.}
.else
           .{.?Kassa_KO3_r2;────────────┼.}
.end
.}
.endform

!==============================================================================

.linkform 'rus_ko3_01' prototype is 'Kassa_KO3'
.group 'Журнал регистрации кассовых документов - РФ'
.nameinlist 'Журнал для РФ'
.defo portrait
.p 80
.fields
c0p2 c0p2ok c0p1 c0p3 c0p4 c0p5
 'true' : 's'
.endfields
 И                                                   Унифицированная форма № КО-3
                                                   Утверждена постановлением Госкомстата
                                                   России от 18.08.98г. № 88

                                                                       ┌─────────────────┐
                                                                       │      Код        │
                                                                       ├─────────────────┤
                                                         Форма по ОКУД │     Б0310003 Б      │
                                                                       ├─────────────────┤
 Б@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б по ОКПО │ Б@~@@@@@@@@@@@@@@@ Б│
──────────────────────────────────────────────────────────────         ├─────────────────┤
                          организация                                  │                 │
 Б@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б         │                 │
───────────────────────────────────────────────────────────────────────┴─────────────────┘
                     структурное подразделение







                              Б             ЖУРНАЛ РЕГИСТРАЦИИ Б
                              БПРИХОДНЫХ И РАСХОДНЫХ КАССОВЫХ ДОКУМЕНТОВ Б

                                         Б@~@@@@@@@@@@@@@@@ Б г.
                                        ────────────────────

                      Б@~@@@@@@@@@@@@@@@@@@ Б   Б@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
                     ────────────────────  ────────────────────────────────────
                           должность             фамилия, имя, отчество


^ И
!-----------------------------------------------------------------------------------------
.fields
if(c0valpriznak > 1, '', ',') if(c0valpriznak > 1, '', ',')
VDol VCent VDol1 VCent1
c1p1 c1p2 c1p3 c1p5 c1p6 c1p7 c1p8 c1p10
.endfields
 Р.{FirstCycle checkenter
.[h
                                                                                                                       @np@
┌───────────────────┬────────────┬──────────────────────────────┬───────────────────┬────────────┬──────────────────────────────┐
│     Приходный     │   Сумма@   │         Примечание           │     Расходный     │   Сумма@   │          Примечание          │
│     документ      │&&&&&&& @@@@│                              │     документ      │&&&&&&& @@@@│                              │
├──────────┬────────┤            │                              ├──────────┬────────┤            │                              │
│   дата   │ номер  │            │                              │   дата   │ номер  │            │                              │
├──────────┼────────┼────────────┼──────────────────────────────┼──────────┼────────┼────────────┼──────────────────────────────┤
│    1     │   2    │     3      │             4                │    5     │   6    │     7      │              8               │
├──────────┼────────┼────────────┼──────────────────────────────┼──────────┼────────┼────────────┼──────────────────────────────┤
.]h
│@@@@@@@@@@│@@@@@@@@│&&&&&&&&&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@│&&&&&&&&&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
.if LastPass
└──────────┴────────┴────────────┴──────────────────────────────┴──────────┴────────┴────────────┴──────────────────────────────┘
.else
.end
.} Р
.{SecondCycle checkenter
 .{.?Kassa_KO3_p1; .}
.if LastPrihod
 .{.?Kassa_KO3_p3; .}
 .{.?Kassa_KO3_p4; .}
 .{.?Kassa_KO3_p5; .}
.else
 .{.?Kassa_KO3_p2; .}
.end
.}
.if ToNextPage
.end
.{ThirdCycle checkenter
 .{.?Kassa_KO3_r1; .}
.if LastRashod
 .{.?Kassa_KO3_r3; .}
 .{.?Kassa_KO3_r4; .}
 .{.?Kassa_KO3_r5; .}
.else
 .{.?Kassa_KO3_r2; .}
.end
.}
.endform  //'rus_ko3_01'

!==============================================================================

.linkform 'bel_ko3_1' prototype is 'Kassa_KO3'
.group 'Журнал регистрации кассовых документов - РБ: форма 1'
.nameinlist 'Журнал для РБ (форма 1)'
.defo landscape
.p 55
.fields
if(c0valpriznak > 0,' И к Постановлению Правления НБ РБ И от 28.06.2004 г.', ' Ик Постановлению Правления НБ РБ И')
if(c0valpriznak > 0,'(в ред. от 13.02.2008 г. № 24)', 'от 17.01.2008  № 4')
c0p2
if(c0valpriznak > 0,'(наименование юридического лица, подразделения, инициалы, фамилия индивидуального предпринимателя)','(наименование юридического лица, подразделения, инициалы, фамилия индивидуального предпринимателя,')
if(c0valpriznak > 0,'', 'инициалы, фамилия частного нотариуса)')
upCase(c0rub)
c0p3
 'true' : 's'
.endfields
 И
                                                                              Приложение 1
                                         &&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
                                                          &&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&& И
 И
                                                                                   Форма 1
 Б





 Б @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 ─────────────────────────────────────────────────────────────────────────────────────────
 Ш          @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш               @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш












 Б


                                           ЖУРНАЛ
           РЕГИСТРАЦИИ ПРИХОДНЫХ И РАСХОДНЫХ КАССОВЫХ ОРДЕРОВ В ^ Й
 И
                                    @~@@@@@@@@@@@@@@@ г.
                                    ─────────────────
 И^
 И!----------------------------------------------------------------------------------------- И
.fields
//c0rub
c2p0
c2p01
c0rubley c2p02 if(c0valpriznak > 0,'Инициалы,фамилия','Инициалы, фамилия')
c2p03 if(c0valpriznak > 0,'лица, указанного','лица, указанного')
C2p04 if(c0valpriznak > 0,'в приходном ордере','в приходном ордере')
c2p05
namep1
namep2
namep3
c2p06
nump numprp1  numprp2  numprp3  numprp4
c2p07
c2p1 c2p2 sump sumprp c2p3 c2p4 c2p5
sumitogop sumitogoprp sumitogoallp
 'true' : 's'
//c0rub
c3p0
c3p01
c0rubley c3p02 if(c0valpriznak > 0,'Инициалы, фамилия','Инициалы, фамилия')
c3p03 if(c0valpriznak > 0,'лица, указанного','лица, указанного')
c3p04 if(c0valpriznak > 0,'в расходном ордере','в расходном ордере')
c3p05
namer1
namer2
namer3
c3p06
numr numprr1  numprr2  numprr3  numprr4
c3p07
c3p1 c3p2 sumr sumprr c3p3 c3p4 c3p5
sumitogor sumitogoprr sumitogoallr
.endfields
 Р.{FirstCycle checkenter
.if LastPass
.else
.end
.}
.{SecondCycle checkenter
.[h
                                                                                                                                            @np@
  Д@~@@@@@@@@@@@@@@@ Д г.
┌───────────────────┬^─────────────────────────┬─────────────────────────┬──────────────────────────────┐
│     Приходный     │  Приход @@@@@@@@@@@@@@@@@@@@@@@@@@@  ^│   @~@@@@@@@@@@@@@@@@@@@ │          Примечание          │
│     кассовый      │^                         │   @~@@@@@@@@@@@@@@@@@@  │                              │
│      ордер        │^                         │    @@@@@@@@@@@@@@@@@@@@ │                              │
├──────────┬────────┼^────────────┬────────────┤                         │                              │
│  дата    │ номер  │^    ...     │   итого    │                         │                              │
│          │        │^            │            │                         │                              │
│          │        │^            │            │                         │                              │
├──────────┼────────┼^────────────┼────────────┼─────────────────────────┼──────────────────────────────┤
│    1     │   2    │^@~@@@@@@@@@@│@~@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
├──────────┼────────┼^────────────┼────────────┼─────────────────────────┼──────────────────────────────┤
.]h
│@@@@@@@@@@│@@@@@@@@│.{.?Kassa_KO3_p1;&&&&&&&&&&&&│.}&&&&&&&&&&&&│&&&&&&&&&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
.if LastPrihod
├──────────┴────────┼.{.?Kassa_KO3_p3;────────────┼.}────────────┼────────────┼─────────────────────────┼──────────────────────────────┤
│            Итого: │.{.?Kassa_KO3_p4;&&&&&&&&&&&&│.}&&&&&&&&&&&&│&&&&&&&&&&&&│            X            │               X              │
└───────────────────┴.{.?Kassa_KO3_p5;────────────┴.}────────────┴────────────┴─────────────────────────┴──────────────────────────────┘
.else
├──────────┼────────┼.{.?Kassa_KO3_p2;────────────┼.}────────────┼────────────┼─────────────────────────┼──────────────────────────────┤
.end
.}
.if ToNextPage
^
.end
.{ThirdCycle checkenter
.[h
                                                                                                                                            @np@
  Д@~@@@@@@@@@@@@@@@ Д г.
┌───────────────────┬^─────────────────────────┬─────────────────────────┬──────────────────────────────┐
│     Расходный     │  Расход @@@@@@@@@@@@@@@@@@@@@@@@@@@  ^│   @~@@@@@@@@@@@@@@@@@@@ │          Примечание          │
│     кассовый      │^                         │   @~@@@@@@@@@@@@@@@@@@  │                              │
│      ордер        │^                         │    @@@@@@@@@@@@@@@@@@@@ │                              │
├──────────┬────────┼^────────────┬────────────┤                         │                              │
│  дата    │ номер  │^    ...     │   итого    │                         │                              │
│          │        │^            │            │                         │                              │
│          │        │^            │            │                         │                              │
├──────────┼────────┼^────────────┼────────────┼─────────────────────────┼──────────────────────────────┤
│    1     │   2    │^@~@@@@@@@@@@│@~@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
├──────────┼────────┼^────────────┼────────────┼─────────────────────────┼──────────────────────────────┤
.]h
│@@@@@@@@@@│@@@@@@@@│.{.?Kassa_KO3_r1;&&&&&&&&&&&&│.}&&&&&&&&&&&&│&&&&&&&&&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
.if LastRashod
├──────────┴────────┼.{.?Kassa_KO3_r3;────────────┼.}────────────┼────────────┼─────────────────────────┼──────────────────────────────┤
│            Итого: │.{.?Kassa_KO3_r4;&&&&&&&&&&&&│.}&&&&&&&&&&&&│&&&&&&&&&&&&│            X            │               X              │
└───────────────────┴.{.?Kassa_KO3_r5;────────────┴.}────────────┴────────────┴─────────────────────────┴──────────────────────────────┘
.else
├──────────┼────────┼.{.?Kassa_KO3_r2;────────────┼.}────────────┼────────────┼─────────────────────────┼──────────────────────────────┤
.end
.}
 Р.endform  //'bel_ko3_1'

!==============================================================================

.linkform 'bel_ko3_1a' prototype is 'Kassa_KO3'
.group 'Журнал регистрации кассовых документов - РБ: форма 1-а'
.nameinlist 'Журнал для РБ (форма 1-а)'
.defo landscape
.p 80
.fields
if(c0valpriznak > 0,'к Постановлению Правления НБ РБ от 28.06.2004 г.', 'Постановление Правления НБ РБ')
if(c0valpriznak > 0,'(в ред. от 13.02.2008 г. № 24)', 'от 17.01.2008  № 4')
c0p2
if(c0valpriznak > 0,'(наименование юридического лица, подразделения, инициалы, фамилия индивидуального предпринимателя)'
              , '(наименование юридического лица, подразделения, инициалы, фамилия индивидуального предпринимателя,')

If(c0valpriznak > 0, '', 'инициалы, фамилия частного нотариуса)')
If(c0valpriznak > 0, 'иностранной валюте', c0rub)
c0p3
 'true' : 's'
.endfields
 И
                                                                                                                         Приложение 1
                                                                                    &&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
                                                                                    &&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&

                                                                                                                            Форма 1-а






 @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
 @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И










 Б




                                                       ЖУРНАЛ
                             Ирегистрации приходных и расходных кассовых ордеров в И  И@@@@@@@@@@@@@@@@@@ И

 И
                                                           @~@@@@@@@@@@@@@@@ г.
                                                            ─────────────────
 И^
 И!----------------------------------------------------------------------------------------- И
.fields
//c0rub
c1p0
c1p1 c1p2 c1p3 c1p4 c1p5 c1p6 c1p7 c1p8 c1p9 c1p10
.endfields
 Р.{FirstCycle checkenter
.[h
 Б                                                                                                                                                                                     @np@

                                                                                                                                                                       @~@@@@@@@@@@@@@@@ г.
                                                                                                                                                                     ─────────────────
  ┌───────────────────┬───────────────────────┬──────────────────────────┬────────────────────┬───────────────────┬───────────────────────┬──────────────────────────┬────────────────────┐
  │     Приходный     │                       │         Инициалы,        │                    │     Расходный     │                       │         Инициалы,        │                    │
  │      кассовый     │                       │       фамилия лица       │                    │      кассовый     │                       │       фамилия лица       │                    │
  │       ордер       │         Сумма         │       указанного в       │     Примечание     │       ордер       │         Сумма         │       указанного в       │     Примечание     │
  ├──────────┬────────┤                       │         приходном        │                    ├──────────┬────────┤                       │         расходном        │                    │
  │   дата   │  номер │                       │           ордере         │                    │   дата   │  номер │                       │           ордере         │                    │
  ├──────────┼────────┼───────────────────────┼──────────────────────────┼────────────────────┼──────────┼────────┼───────────────────────┼──────────────────────────┼────────────────────┤
  │    1     │    2   │           3           │            4             │          5         │    6     │    7   │           8           │            9             │         10         │
  ├──────────┼────────┼───────────────────────┼──────────────────────────┼────────────────────┼──────────┼────────┼───────────────────────┼──────────────────────────┼────────────────────┤
.]h                                                                                                                                                                                      
  │@@@@@@@@@@│@~@@@@@@│&&&&&&&&&&&&&&&&&&&&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@│@~@@@@@@│&&&&&&&&&&&&&&&&&&&&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@│
.if LastPass                                                                                                                                                                             
  └──────────┴────────┴───────────────────────┴──────────────────────────┴────────────────────┴──────────┴────────┴───────────────────────┴──────────────────────────┴────────────────────┘
.else                                                                                                                                                                                    
  ├──────────┼────────┼───────────────────────┼──────────────────────────┼────────────────────┼──────────┼────────┼───────────────────────┼──────────────────────────┼────────────────────┤ Б
.end                                                                                       
.}
 Р.{SecondCycle checkenter
 .{.?Kassa_KO3_p1; .}
.if LastPrihod
 .{.?Kassa_KO3_p3; .}
 .{.?Kassa_KO3_p4; .}
 .{.?Kassa_KO3_p5; .}
.else
 .{.?Kassa_KO3_p2; .}
.end
.}
.if ToNextPage
.end
.{ThirdCycle checkenter
 .{.?Kassa_KO3_r1; .}
.if LastRashod
 .{.?Kassa_KO3_r3; .}
 .{.?Kassa_KO3_r4; .}
 .{.?Kassa_KO3_r5; .}
.else
 .{.?Kassa_KO3_r2; .}
.end
.}
.endform  //'bel_ko3_1a'

!==============================================================================