//-----------------------------------------------------------------------------------
//                                                           (c) корпорация ГАЛАКТИКА
// Галактика 7.11 - Касса
// Приказ на командировку (общая форма)
//-----------------------------------------------------------------------------------

#doc
Приказ на командировку (общая форма).
#end
.set name='KomPrikAll'
.nameinlist 'Базовая форма'
.hide

.fields
! заголовок
NameOrgPrik
OKPOOrgPrik
dPrik
NoPrik

! цикл внешний
NextNoPrik
NextdPrik
! цикл (спецификация приказа)
OurOrgName
OurOrgOKPO
dDoc
NoDoc
FIO
FIO_VP
Chin
TabNmb
Podr
State         // страна командировки
City          // город командировки
PrikOrg       // организация командировки
MestoDest     // место командировки (город + организация)
KolDay
DStart
DEnd
PrikazName    // цель командировки
Tema          // командировка за счет средств
Osnov         // основание
MestoNaznEx   // место назначения - страна, город, организация  
PersChief     // ФИО приказодателя
aBoss         // должность руководителя
nBoss         // ФИО руководителя

.endfields
.{
 ^ ^ ^ ^
.{ CheckEnter  PrikazCicle
 ^ ^
.{ CheckEnter  SpPrikazCicle
OurOrgName       ^
OurOrgOKPO       ^
dDoc             ^
NoDoc            ^
FIO              ^
FIO_VP           ^
Chin             ^
TabNmb           ^
Podr             ^
State            ^
City             ^
PrikOrg          ^
MestoDest        ^
KolDay           ^
DStart           ^
DEnd             ^
PrikazName       ^
Tema             ^
Osnov            ^
MestoNaznEx      ^// место назначения - страна, город, организация  
PersChief        ^
.}
.}
aBoss            ^
nBoss            ^
.}
.endform

//------------------------------------------------------------------------------

.Linkform 'KomPrikAll01' prototype is 'KomPrikAll'
.nameinlist 'Приказ на командировку (Общая форма)'
.p 60
.defo landscape
.fields
CommonFormHeader
! .{
NameOrgPrik    // наименование орг-ии
NoPrik   dPrik     // номер и дата
! .{ CheckEnter  PrikazCicle
!NextNoPrik
!NextdPrik
! .{ CheckEnter  SpPrikazCicle
TabNmb    // таб номер
FIO
Chin      // должность
MestoDest   // место командировки (город + организация)
DStart    // дата начала ком.
DEnd      // дата оконч. ком.
KolDay
PrikazName          // цель командировки
PersChief           // кто посылает
! .}
! .}
aBoss               // ддолжность начальника
nBoss               // Фио начальника
! .}
.endfields

.{
 Ш^
    @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                                                              ПРИКАЗ НА КОМАНДИРОВКУ  @~@@@@@@@@@@@@@

                                                                        от @@@@@@@@@@
                                                                        Командируется:
.{ CheckEnter  PrikazCicle
.[h
───────────┬──────────────────────────────────┬──────────────────────┬─────────────────────────────┬──────────┬─────────┬─────┬───────────────────────────┬─────────────────────────────
Табельный  │     Фамилия, имя ,отчество       │      Должность       │         Куда                │   С      │  По     │ Дни │      Цель командировки    │        Кто посылает
  номер    │                                  │                      │   Город  и  Организация     │          │         │     │                           │
───────────┴──────────────────────────────────┴──────────────────────┴─────────────────────────────┴──────────┴─────────┴─────┴───────────────────────────┴─────────────────────────────
.]h

.{ CheckEnter  SpPrikazCicle
@@@@@@@@@@  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  @@@@@@@@@@@@@@@@@@@@@  @@@@@@@@@@@@@@@@@@@@@@@@@@@@  @@@@@@@@@@ @@@@@@@@@@ &&&  @@@@@@@@@@@@@@@@@@@@@@@@@@  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.}
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

                                       &&&&&&&&&&&&&&&&&&&&&&&&&&&  ____________________________  @@@@@@@@@@@@@@@@@@@@@@@@@
.} Ш
 И.endform И