! здддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
! Ё █═╖╜═Г╔╜╗╔    : ░╔╔АБЮ ═╙Б╝╒ ╗╖╛╔╜╔╜╗О Ф╔╚╔╒╝ё╝ ╜═╖╜═Г╔╜╗О                 Ё
! юдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
#ifdef __MTR_TO_SPEC__
#doc
░╔╔АБЮ ═╙Б╝╒ ╗╖╛╔╜╔╜╗О Ф╔╚╔╒╝ё╝ ╜═╖╜═Г╔╜╗О
#end
.Set name='MtrActList'
.Hide
.Fields
  sFilter
.EndFields
.Fields
  sNde sVal
.EndFields
^
^^
.{
.Fields
  nRec
  sSrc sDst
  sDescr sDesGr sNum dSopr dOpr sNote sName sLPR fSumma fSumVal sTXO
.EndFields
  ^
  ^^
  ^^^^^^^^^^^
.{
.Fields
  sRole1    sSrc1      sRole1D   sDst1
.EndFields
  ^^^^
.}
.}
.EndForm

#doc
░╔╔АБЮ ═╙Б╝╒ ╗╖╛╔╜╔╜╗О Ф╔╚╔╒╝ё╝ ╜═╖╜═Г╔╜╗О ╖═╞═А╝╒ ▄▓░ ╒ █└┘
#end
.LinkForm 'MtrActList_NDE' Prototype is 'MtrActList'
.NameInList '░╔╔АБЮ ═╙Б╝╒ ╗╖╛╔╜╔╜╗О Ф╔╚╔╒╝ё╝ ╜═╖╜═Г╔╜╗О ╖═╞═А╝╒ ▄▓░ ╒ █└┘'

  Ъ│░╔╔АБЮ ═╙Б╝╒ ╗╖╛╔╜╔╜╗О Ф╔╚╔╒╝ё╝ ╜═╖╜═Г╔╜╗О ╖═╞═А╝╒ ▄▓░Ъ│

.{?Internal; (sFilter<>'')
.Fields
  sFilter
.EndFields

Ъ┌■╗╚ЛБЮ: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Ъ┌
.}// Internal
.Fields
 sNDE
.EndFields
Ъ┬дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддбдддддддддддддддддддддбддддддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙Ё▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙Ё ▒Ц╛╛═ ╒ @@@@@@@@
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    Ё                     Ё                     Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддддддддадддддддддддддддддддддадддддддддддддддддЪ┬
.{
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc sDst fSumma
.EndFields
Ъ┴@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&Ъ│
ддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддддбддддддддддддддддддддддддддддддддддддддд
░╝╚Л ═╜═╚╗Б╗╙╗ ╗АБ╝Г╜╗╙═Ё           ─╜═╚╗Б╗╙╗ ╗АБ╝Г╜╗╙═         Ё░╝╚Л ═╜═╚╗Б╗╙╗ ╞Ю╗╔╛╜╗╙═Ё          ─╜═╚╗Б╗╙╗ ╞Ю╗╔╛╜╗╙═
ддддддддддддддддддддддддедддддддддддддддддддддддддддддддддддддддеддддддддддддддддддддддддедддддддддддддддддддддддддддддддддддддддЪ┬
.{
.Fields
  sRole1    sSrc1      sRole1D   sDst1
.EndFields
Ъ┬@@@@@@@@@@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Ъ┬
.}
Ъ┬ддддддддддддддддддддддддадддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддддадддддддддддддддддддддддддддддддддддддддЪ┬

.}
.EndForm

#doc
░╔╔АБЮ ═╙Б╝╒ ╗╖╛╔╜╔╜╗О Ф╔╚╔╒╝ё╝ ╜═╖╜═Г╔╜╗О ╖═╞═А╝╒ ▄▓░ ╒ ╒═╚НБ╔
#end
.LinkForm 'MtrActList_Val' Prototype is 'MtrActList'
.NameInList '░╔╔АБЮ ═╙Б╝╒ ╗╖╛╔╜╔╜╗О Ф╔╚╔╒╝ё╝ ╜═╖╜═Г╔╜╗О ╖═╞═А╝╒ ▄▓░ ╒ ╒═╚НБ╔'

  Ъ│░╔╔АБЮ ═╙Б╝╒ ╗╖╛╔╜╔╜╗О Ф╔╚╔╒╝ё╝ ╜═╖╜═Г╔╜╗О ╖═╞═А╝╒ ▄▓░Ъ│

.{?Internal; (sFilter<>'')
.Fields
  sFilter
.EndFields

Ъ┌■╗╚ЛБЮ: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Ъ┌
.}// Internal
.Fields
 sVal
.EndFields
Ъ┬дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддбдддддддддддддддддддддбддддддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙Ё▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙Ё ▒Ц╛╛═ ╒ @@@@@@@@
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    Ё                     Ё                     Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддддддддадддддддддддддддддддддадддддддддддддддддЪ┬
.{
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc sDst fSumma
.EndFields
Ъ┴@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&Ъ│
ддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддддбддддддддддддддддддддддддддддддддддддддд
░╝╚Л ═╜═╚╗Б╗╙╗ ╗АБ╝Г╜╗╙═Ё           ─╜═╚╗Б╗╙╗ ╗АБ╝Г╜╗╙═         Ё░╝╚Л ═╜═╚╗Б╗╙╗ ╞Ю╗╔╛╜╗╙═Ё          ─╜═╚╗Б╗╙╗ ╞Ю╗╔╛╜╗╙═
ддддддддддддддддддддддддедддддддддддддддддддддддддддддддддддддддеддддддддддддддддддддддддедддддддддддддддддддддддддддддддддддддддЪ┬
.{
.Fields
  sRole1    sSrc1      sRole1D   sDst1
.EndFields
Ъ┬@@@@@@@@@@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
ддддддддддддддддддддддддадддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддддадддддддддддддддддддддддддддддддддддддддЪ┬

.}
.EndForm
#else
.Set name='MtrActList'
.Hide
.Fields
  sFilter
.EndFields
^
.{
.Fields
  sGr
  sNde sVal
  sRole1 sRole2 sRole3 sRole4
  sRole1D sRole2D sRole3D sRole4D
.EndFields
  ^
  ^^
  ^^^^
  ^^^^
.{
.Fields
  nRec sDescr sDesGr sNum dSopr dOpr sNote sName sLPR fSumma fSumVal sTXO
  sSrc1 sSrc2 sSrc3 sSrc4
  sDst1 sDst2 sDst3 sDst4
.EndFields
  ^^^^^^^^^^^^
  ^^^^
  ^^^^
.}
.}
.EndForm
!
!==============================================================================
!
#doc
░╔╔АБЮ ═╙Б╝╒ ╗╖╛╔╜╔╜╗О Ф╔╚╔╒╝ё╝ ╜═╖╜═Г╔╜╗О ╖═╞═А╝╒ ▄▓░ ╒ █└┘
#end
.LinkForm 'MtrActList_NDE' Prototype is 'MtrActList'
.NameInList '░╔╔АБЮ ═╙Б╝╒ ╗╖╛╔╜╔╜╗О Ф╔╚╔╒╝ё╝ ╜═╖╜═Г╔╜╗О ╖═╞═А╝╒ ▄▓░ ╒ █└┘'

  Ъ│░╔╔АБЮ ═╙Б╝╒ ╗╖╛╔╜╔╜╗О Ф╔╚╔╒╝ё╝ ╜═╖╜═Г╔╜╗О ╖═╞═А╝╒ ▄▓░Ъ│

.{?Internal; (sFilter<>'')
.Fields
  sFilter
.EndFields

Ъ┌■╗╚ЛБЮ: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Ъ┌
.}// Internal
.{
.{?Internal; (sGr='11')
.Fields
  sNde : 'P:C' sRole1 : 'P:C' sRole1D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддбдддддддддддддддддддддбддддддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙Ё▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙Ё     ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддддддддеддддддддддддддддддддд╢@@@@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддддддддадддддддддддддддддддддадддддддддддддддддЪ≤
.}// Internal
.{?Internal; (sGr='12')
.Fields
  sNde : 'P:C' sRole1 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддбдддддддддддддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙Ё      ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙    Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддддддддедддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддддддддадддддддддддддддадддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='13')
.Fields
  sNde : 'P:C' sRole1 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C' sRole3D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙Ё             ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙             Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддддддддедддддддддддддддбдддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='14')
.Fields
  sNde : 'P:C' sRole1 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C' sRole3D : 'P:C' sRole4D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙Ё                     ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙                     Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддддддддедддддддддддддддбдддддддддддддддбдддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='21')
.Fields
  sNde : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C'
               sRole1D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддбдддддддддддддддддддддбддддддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё     ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙     Ё▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙Ё     ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддеддддддддддддддддддддд╢@@@@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддддддддадддддддддддддддддЪ≤
.}
.{?Internal; (sGr='22')
.Fields
  sNde : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддбддддддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё     ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙     Ё     ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙     Ё     ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддедддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддддЪ≤
.}
.{?Internal; (sGr='23')
.Fields
  sNde : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C' sRole3D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё     ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙     Ё             ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙             Ё     ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддедддддддддддддддбдддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддддЪ≤
.}
.{?Internal; (sGr='24')
.Fields
  sNde : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C' sRole3D : 'P:C' sRole4D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё     ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙     Ё                      ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙                    Ё     ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддедддддддддддддддбдддддддддддддддбдддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддддЪ≤
.}
.{?Internal; (sGr='31')
.Fields
  sNde : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C' sRole3 : 'P:C'
               sRole1D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё             ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙             Ё▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддбдддддддддддддддеддддддддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='32')
.Fields
  sNde : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C' sRole3 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё             ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙             Ё     ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙     Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддбдддддддддддддддедддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='33')
.Fields
  sNde : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C' sRole3 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C' sRole3D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё             ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙             Ё             ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙             Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддбдддддддддддддддедддддддддддддддбдддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='34')
.Fields
  sNde : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C' sRole3 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C' sRole3D : 'P:C' sRole4D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё             ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙             Ё                     ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙                     Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддбдддддддддддддддедддддддддддддддбдддддддддддддддбдддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='41')
.Fields
  sNde : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C' sRole3 : 'P:C' sRole4 : 'P:C'
               sRole1D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё                      ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙                    Ё▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддбдддддддддддддддбдддддддддддддддеддддддддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='42')
.Fields
  sNde : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C' sRole3 : 'P:C' sRole4 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё                      ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙                    Ё     ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙     Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддбдддддддддддддддбдддддддддддддддедддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='43')
.Fields
  sNde : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C' sRole3 : 'P:C' sRole4 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C' sRole3D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё                      ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙                    Ё              ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙            Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддбдддддддддддддддбдддддддддддддддедддддддддддддддбдддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='44')
.Fields
  sNde : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C' sRole3 : 'P:C' sRole4 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C' sRole3D : 'P:C' sRole4D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё                      ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙                    Ё                     ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙                     Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддбдддддддддддддддбдддддддддддддддедддддддддддддддбдддддддддддддддбдддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддаддддддддддддддЪ≤
.}
.{
.{?Internal; (sGr='11')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sDst1 fSumma
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='12')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sDst1 sDst2 fSumma
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='13')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sDst1 sDst2 sDst3 fSumma
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='14')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sDst1 sDst2 sDst3 sDst4 fSumma
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='21')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sDst1 fSumma
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='22')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sDst1 sDst2 fSumma
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='23')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sDst1 sDst2 sDst3 fSumma
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='24')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sDst1 sDst2 sDst3 sDst4 fSumma
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='31')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sSrc3 sDst1 fSumma
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='32')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sSrc3 sDst1 sDst2 fSumma
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='33')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sSrc3 sDst1 sDst2 sDst3 fSumma
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='34')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sSrc3 sDst1 sDst2 sDst3 sDst4 fSumma
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='41')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sSrc3 sSrc4 sDst1 fSumma
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='42')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sSrc3 sSrc4 sDst1 sDst2 fSumma
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='43')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sSrc3 sSrc4 sDst1 sDst2 sDst3 fSumma
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='44')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sSrc3 sSrc4 sDst1 sDst2 sDst3 sDst4 fSumma
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.}
.{?Internal; (sGr='11')
Ъ≤дддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}// Internal
.{?Internal; (sGr='12')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='13')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='14')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='21')
Ъ≤дддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='22')
Ъ≤дддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='23')
Ъ≤дддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='24')
Ъ≤дддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='31')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='32')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='33')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='34')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='41')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='42')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='43')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='44')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.}
.EndForm
!
!==============================================================================
!
#doc
░╔╔АБЮ ═╙Б╝╒ ╗╖╛╔╜╔╜╗О Ф╔╚╔╒╝ё╝ ╜═╖╜═Г╔╜╗О ╖═╞═А╝╒ ▄▓░ ╒ ╒═╚НБ╔
#end
.LinkForm 'MtrActList_Val' Prototype is 'MtrActList'
.NameInList '░╔╔АБЮ ═╙Б╝╒ ╗╖╛╔╜╔╜╗О Ф╔╚╔╒╝ё╝ ╜═╖╜═Г╔╜╗О ╖═╞═А╝╒ ▄▓░ ╒ ╒═╚НБ╔'

  Ъ│░╔╔АБЮ ═╙Б╝╒ ╗╖╛╔╜╔╜╗О Ф╔╚╔╒╝ё╝ ╜═╖╜═Г╔╜╗О ╖═╞═А╝╒ ▄▓░Ъ│

.{?Internal; (sFilter<>'')
.Fields
  sFilter
.EndFields

Ъ┌■╗╚ЛБЮ: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Ъ┌
.}// Internal
.{
.{?Internal; (sGr='11')
.Fields
  sVal : 'P:C' sRole1 : 'P:C' sRole1D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддбдддддддддддддддддддддбддддддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙Ё▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙Ё     ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддддддддеддддддддддддддддддддд╢@@@@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддддддддадддддддддддддддддддддадддддддддддддддддЪ≤
.}// Internal
.{?Internal; (sGr='12')
.Fields
  sVal : 'P:C' sRole1 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддбдддддддддддддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙Ё      ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙    Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддддддддедддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддддддддадддддддддддддддадддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='13')
.Fields
  sVal : 'P:C' sRole1 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C' sRole3D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙Ё             ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙             Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддддддддедддддддддддддддбдддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='14')
.Fields
  sVal : 'P:C' sRole1 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C' sRole3D : 'P:C' sRole4D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙Ё                     ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙                     Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддддддддедддддддддддддддбдддддддддддддддбдддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='21')
.Fields
  sVal : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C'
               sRole1D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддбдддддддддддддддддддддбддддддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё     ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙     Ё▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙Ё     ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддеддддддддддддддддддддд╢@@@@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддддддддадддддддддддддддддЪ≤
.}
.{?Internal; (sGr='22')
.Fields
  sVal : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддбддддддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё     ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙     Ё     ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙     Ё     ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддедддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддддЪ≤
.}
.{?Internal; (sGr='23')
.Fields
  sVal : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C' sRole3D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё     ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙     Ё             ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙             Ё     ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддедддддддддддддддбдддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддддЪ≤
.}
.{?Internal; (sGr='24')
.Fields
  sVal : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C' sRole3D : 'P:C' sRole4D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё     ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙     Ё                      ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙                    Ё     ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддедддддддддддддддбдддддддддддддддбдддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддддЪ≤
.}
.{?Internal; (sGr='31')
.Fields
  sVal : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C' sRole3 : 'P:C'
               sRole1D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё             ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙             Ё▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддбдддддддддддддддеддддддддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='32')
.Fields
  sVal : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C' sRole3 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё             ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙             Ё     ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙     Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддбдддддддддддддддедддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='33')
.Fields
  sVal : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C' sRole3 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C' sRole3D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё             ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙             Ё             ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙             Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддбдддддддддддддддедддддддддддддддбдддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='34')
.Fields
  sVal : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C' sRole3 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C' sRole3D : 'P:C' sRole4D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё             ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙             Ё                     ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙                     Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддбдддддддддддддддедддддддддддддддбдддддддддддддддбдддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='41')
.Fields
  sVal : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C' sRole3 : 'P:C' sRole4 : 'P:C'
               sRole1D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё                      ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙                    Ё▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддбдддддддддддддддбдддддддддддддддеддддддддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='42')
.Fields
  sVal : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C' sRole3 : 'P:C' sRole4 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё                      ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙                    Ё     ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙     Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддбдддддддддддддддбдддддддддддддддедддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='43')
.Fields
  sVal : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C' sRole3 : 'P:C' sRole4 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C' sRole3D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё                      ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙                    Ё              ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙            Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддбдддддддддддддддбдддддддддддддддедддддддддддддддбдддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддаддддддддддддддЪ≤
.}
.{?Internal; (sGr='44')
.Fields
  sVal : 'P:C' sRole1 : 'P:C' sRole2 : 'P:C' sRole3 : 'P:C' sRole4 : 'P:C'
               sRole1D : 'P:C' sRole2D : 'P:C' sRole3D : 'P:C' sRole4D : 'P:C'
.EndFields
Ъ≤дддддбддддддддддбддддддддддбддддддддддбдддддддддддбддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддд
└╔А╙ЮЁ   └═Б═   Ё┌К╞╝╚╜╔╜╝ Ё  █╝╛╔Ю   Ё  ▒Б═БЦА   Ё    ▌╞╔Ю═Ф╗Н    Ё                      ▌║Й╔╙Б ЦГ╔Б═-╗АБ╝Г╜╗╙                    Ё                     ▌║Й╔╙Б ЦГ╔Б═-╞Ю╗╔╛╜╗╙                     Ё   ▒Ц╛╛═ ╒
     Ё╝Д╝Ю╛╚╔╜╗ОЁ          Ё  ═╙Б═    Ё           Ё    Ю═╖Ю╔Х╗╚    цдддддддддддддддбдддддддддддддддбдддддддддддддддбдддддддддддддддедддддддддддддддбдддддддддддддддбдддддддддддддддбддддддддддддддд╢@@@@@@@@@@@@@@
     Ё          Ё          Ё          Ё           Ё                Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@Ё
дддддаддддддддддаддддддддддаддддддддддадддддддддддаддддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддадддддддддддддддаддддддддддддддЪ≤
.}
.{
.{?Internal; (sGr='11')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sDst1 fSumVal
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='12')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sDst1 sDst2 fSumVal
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='13')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sDst1 sDst2 sDst3 fSumVal
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='14')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sDst1 sDst2 sDst3 sDst4 fSumVal
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='21')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sDst1 fSumVal
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='22')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sDst1 sDst2 fSumVal
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='23')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sDst1 sDst2 sDst3 fSumVal
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='24')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sDst1 sDst2 sDst3 sDst4 fSumVal
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='31')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sSrc3 sDst1 fSumVal
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='32')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sSrc3 sDst1 sDst2 fSumVal
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='33')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sSrc3 sDst1 sDst2 sDst3 fSumVal
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='34')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sSrc3 sDst1 sDst2 sDst3 sDst4 fSumVal
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='41')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sSrc3 sSrc4 sDst1 fSumVal
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='42')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sSrc3 sSrc4 sDst1 sDst2 fSumVal
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='43')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sSrc3 sSrc4 sDst1 sDst2 sDst3 fSumVal
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.{?Internal; (sGr='44')
.Fields
  sDescr dSopr dOpr sNum sNote sLPR sSrc1 sSrc2 sSrc3 sSrc4 sDst1 sDst2 sDst3 sDst4 fSumVal
.EndFields
Ъ≤@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&.&&Ъ≤
.}
.}
.{?Internal; (sGr='11')
Ъ≤дддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}// Internal
.{?Internal; (sGr='12')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='13')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='14')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='21')
Ъ≤дддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='22')
Ъ≤дддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='23')
Ъ≤дддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='24')
Ъ≤дддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='31')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='32')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='33')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='34')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='41')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='42')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='43')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.{?Internal; (sGr='44')
Ъ≤ддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддЪ≤

.}
.}
.EndForm
#end