/*
 ╔══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) Корпорация ГАЛАКТИКА, 2000                       ║
 ║ Проект        : ГАЛАКТИКА                                                ║
 ║ Система       : Контроллинг                                              ║
 ║ Версия        : 5.7                                                      ║
 ║ Назначение    : Печать набора статей калькуляций                         ║
 ║ Ответственный : Медведь Наталья Леонидовна (Medved)                      ║
 ╚══════════════════════════════════════════════════════════════════════════╝
*/
.set name = 'KatSK'
.hide
.fields
NbName
SkNum
SkName
SkLinkName
Aktiv
VarRash
ZtName
ZtKod
DShet
DSubShet
DKau
KShet
KSubShet
KKau
Znak
.endfields
^
.{
^ ^ ^ ^ ^
.{CheckEnter nSK_Loop1
^^^^^^^^^
.}
.}
.endform

.linkform 'KatSK_01' prototype is 'KatSK'
.Group 'На основе статей затрат'
.NameInList 'Набор статей калькуляций - на основе статей затрат'
.fields
NbName
SkNum
SkName
SkLinkName
Aktiv
ZtName
ZtKod
.endfields

 Б       Набор статей калькуляций @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
           (на основе статей затрат)
┌─────┬────────────────────────────────────┬───────────────────────┬───────────────────────────────┬─────────────┐
│Номер│ Наименование статьи калькуляции    │                       │ Вышестоящий уровень           │ Активность  │
│     │   Наименование статьи затрат       │   Код статьи затрат   │                               │             │
├─────┼────────────────────────────────────┼───────────────────────┼───────────────────────────────┼─────────────┤
.{
│ @@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│                       │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@│
.{CheckEnter nSK_Loop1
│     │  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@│                               │             │
.}
.}
└─────┴────────────────────────────────────┴───────────────────────┴───────────────────────────────┴─────────────┘
.endform

.linkform 'KatSK_02' prototype is 'KatSK'
.Group 'Для оценки себестоимости объекта'
.NameInList 'Набор статей калькуляций - для оценки себестоимости объекта'
.fields
NbName
SkNum
SkName
SkLinkName
Aktiv
VarRash
ZtName
ZtKod
.endfields

 Б       Набор статей калькуляций @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
           (для оценки себестоимости объекта)
┌─────┬────────────────────────────────────┬───────────────────────┬───────────────────────────────┬─────────────┬────────────────────┐
│Номер│ Наименование статьи калькуляции    │                       │ Вышестоящий уровень           │ Активность  │Вариант расчета     │
│     │   Статья затрат/                   │   Код статьи затрат   │                               │             │                    │
│     │   Включ. статья калькуляции/       │                       │                               │             │                    │
│     │   База начисления                  │                       │                               │             │                    │
├─────┼────────────────────────────────────┼───────────────────────┼───────────────────────────────┼─────────────┼────────────────────┤
.{
│ @@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│                       │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@│
.{CheckEnter nSK_Loop1
│     │  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@│                               │             │                    │
.}
.}
└─────┴────────────────────────────────────┴───────────────────────┴───────────────────────────────┴─────────────┴────────────────────┘
.endform

.linkform 'KatSK_03' prototype is 'KatSK'
.Group 'Настройка на корреспонденцию счетов'
.NameInList 'Настройка статей калькуляций на корреспонденцию счетов'
.fields
NbName
SkNum
SkName
SkLinkName
Aktiv
DShet
DSubShet
DKau
KShet
KSubShet
KKau
Znak
.endfields

 Б       Набор статей калькуляций @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б

┌─────┬─────────────────────────────────┬─────────────────────────┬──────────┬────────┬────────┬───────────────────────┬────────┬────────┬───────────────────────┬────┐
│Номер│ Наименование статьи калькуляции │ Вышестоящий уровень     │Активность│Дебет   │Субсчет │ Значение аналитики    │Кредит  │Субсчет │  Значение аналитики   │Знак│
│     │                                 │                         │          │счет    │        │                       │счет    │        │                       │    │
├─────┼─────────────────────────────────┼─────────────────────────┼──────────┼────────┼────────┼───────────────────────┼────────┼────────┼───────────────────────┤────┤
.{
│ @@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@│        │        │                       │        │        │                       │    │
.{CheckEnter nSK_Loop1
│     │                                 │                         │          │@@@@@@@@│@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@│@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@│ @@ │
.}
.}
└─────┴─────────────────────────────────┴─────────────────────────┴──────────┴────────┴────────┴───────────────────────┴────────┴────────┴───────────────────────┴────┘
.endform