/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,99 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Заработная плата                                          ║
 ║ Версия        : 5.70                                                      ║
 ║ Назначение    : Приложение    № 4                                         ║
 ║                                                                           ║
 ║ Ответственный : Мелех Василий Евгеньевич                                  ║
 ║                                                                           ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
#doc
Приложение    № 4
#end
.set name 'vedpr4'
.hide
.DEFP PA4
.SET FILLER ='_'
.fields
МесяцЗа  ГодЗа
Цех
.endfields
.{ AllVedC CheckEnter
^^
^
.fields
ФИО_гр1 ТабНом_гр2 СумЗПТекМес_гр3:double СумЗПНачГод_гр4:double
СумМатПомНачГод_гр5:double СумМатПом30_гр6:double СумУдерПНалога_гр7:double СумЛьготДети_гр8:double
СумЛьготСебя_гр9:double СумРАсчПНалог_гр10:double Льгота:double СуммаПодНалога_ЗаМЕс: double
СумПодНалог_гр11:double
.endfields
.{ PersCir CheckEnter
^^^^^^^^^^^^^
.}
.}
.endform
!
!
.linkform 'vedpr4_lnk' prototype is 'vedpr4'
.nameinlist'Ведомость исчислений подоходного налога с заработной платы'
.group 'LIST'
.DEFO LANDSCAPE
.DEFP PA4
.p 50
.SET FILLER ='_'
.fields
МесяцЗа  ГодЗа
Цех
.endfields
.{ AllVedC CheckEnter

 Р                                                  БВЕДОМОСТЬ Б
      БИСЧИСЛЕНИЙ ПОДОXОДНОГО НАЛОГА С ЗАРАБОТНОЙ ПЛАТЫ ЗА Б  Е^ Е  БМЕСЯЦ Б  Е@@@@ Е  БГОДА Б    (Ср. мин. = Д Д __________________)
                                                   БЦЕX Б  Е@~@@@@@@@@@@@@@@@@@@@@@@ Х
.{ PersCir CheckEnter
.[H
 Ш┌─────────────────────┬────────┬─────────────────────────────┬────────────┬────────────┬──────────────┬────────────────────────────────────┬──────────────┬──────────────┬──────────────┐ Лист @NP@
│                     │ БТаб. Б    │      БСумма з/платы Б           │   БСумма Б     │  БОблагаемая Б │   БСумма Б        Б Б│             БСумма  льгот Б  Б      Б      │   Б Сумма Б      │  Б Сумма Б       │   Б Сумма Б      │
│ БФамилия  И.О. Б        │ Бномер Б   ├──────────────┬──────────────┤ Бмат. Б  Бпомощи Б │ Б   часть    Б │ Буже удерж Б.     Б Б Б Б│──────────┬────────── Б Б┬───────────── Б Б─ Б┤для расчета Б   │ Бп/налога Б      │ Б п/налога Б      Б │
│                     │        │ БТек.месяц Б     │ Бс нач. года Б   │ Бс нач. года Б │  Бмат.помощи Б │ Бп/налога Б       Б Б Б│на детей Б   Б│на себя Б    Б│   Скидки Б     │ Бп/налога Б       Б│ Б               Б│за тек.месяц Б  │
├─────────────────────┼────────┼──────────────┼──────────────┼────────────┼────────────┼──────────────┼──────────┼──────────┼──────────────┼──────────────┼──────────────┼──────────────┤
│      Б1 Б               │   Б2 Б     │     Б3 Б         │      Б4 Б        │      Б5 Б      │     Б6 Б       │      Б7 Б         Б Б│     Б8 Б     │      Б9 Б    │     Б10 Б        │     Б11 Б        │      Б 12 Б      │     Б 1 Б3       │
├─────────────────────┼────────┼──────────────┼──────────────┼────────────┼────────────┼──────────────┼──────────┼──────────┼──────────────┼──────────────┼──────────────┼──────────────┤ Ш
.]H
.fields
ФИО_гр1 ТабНом_гр2 СумЗПТекМес_гр3 СумЗПНачГод_гр4
СумМатПомНачГод_гр5 СумМатПом30_гр6 СумУдерПНалога_гр7  СумЛьготДети_гр8
СумЛьготСебя_гр9 Льгота СумРАсчПНалог_гр10  СумПодНалог_гр11 СуммаПодНалога_ЗаМЕс
.endfields
 Ш│@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&.&&│&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&.&&│&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│ Ш
.} И
 Р└─────────────────────┴────────┴──────────────┴──────────────┴────────────┴────────────┴──────────────┴──────────┴──────────┴──────────────┴──────────────┴──────────────┴──────────────┘ Ш
.}
.endform
!
!
.linkform 'vedpr4_lnk2' prototype is 'vedpr4'
.nameinlist'Ведомость исчислений подоходного налога (С итоговыми суммами)'
.group 'LIST'
.DEFO LANDSCAPE
.DEFP PA4
.p 50
.SET FILLER ='_'
.var
 ИтогоКолонка3 : double
 ИтогоКолонка4 : double
 ИтогоКолонка5 : double
 ИтогоКолонка6 : double
 ИтогоКолонка7 : double
 ИтогоКолонка8 : double
 ИтогоКолонка9 : double
 ИтогоКолонка10 : double
 ИтогоКолонка11 : double
 ИтогоКолонка12 : double
 ИтогоКолонка13 : double
.endvar
.fields
МесяцЗа  ГодЗа
Цех
.endfields
.{ AllVedC CheckEnter
.begin
 ИтогоКолонка3 := 0;
 ИтогоКолонка4 := 0;
 ИтогоКолонка5 := 0;
 ИтогоКолонка6 := 0;
 ИтогоКолонка7 := 0;
 ИтогоКолонка8 := 0;
 ИтогоКолонка9 := 0;
 ИтогоКолонка10 := 0;
 ИтогоКолонка11 := 0;
 ИтогоКолонка12 := 0;
 ИтогоКолонка13 := 0;
end.

 Р                                                  БВЕДОМОСТЬ Б
      БИСЧИСЛЕНИЙ ПОДОXОДНОГО НАЛОГА С ЗАРАБОТНОЙ ПЛАТЫ ЗА Б  Е^ Е  БМЕСЯЦ Б  Е@@@@ Е  БГОДА Б    (Ср. мин. = Д Д __________________)
                                                   БЦЕX Б  Е@~@@@@@@@@@@@@@@@@@@@@@@ Х
.{ PersCir CheckEnter
.[H
 Ш┌─────────────────────┬────────┬─────────────────────────────┬────────────┬────────────┬──────────────┬────────────────────────────────────┬──────────────┬──────────────┬──────────────┐ Лист @NP@
│                     │ БТаб. Б    │      БСумма з/платы Б           │   БСумма Б     │  БОблагаемая Б │   БСумма Б       │    Б         Сумма  льгот Б    Б    Б      │   Б Сумма Б      │  Б Сумма Б       │   Б Сумма Б      │
│ БФамилия  И.О. Б        │ Бномер Б   ├──────────────┬──────────────┤ Бмат. Б  Бпомощи Б │ Б   часть    Б │ Буже удерж Б.    │──────────┬──────────┬───────────── Б Б─ Б Б┤ Бдля расчета Б    Б Б Б│п/налога Б      │ Б п/налога Б      Б │
│                     │        │ БТек.месяц Б     │ Бс нач. года Б   │ Бс нач. года Б │  Бмат.помощи Б │ Бп/налога Б       Б│на детей Б   Б│на себя Б    Б│   Скидки  Б     Б│         Б      │               Б│за тек.месяц Б  │
├─────────────────────┼────────┼──────────────┼──────────────┼────────────┼────────────┼──────────────┼──────────┼──────────┼──────────────┼──────────────┼──────────────┼──────────────┤
│      Б1 Б               │   Б2 Б     │     Б3 Б         │      Б4 Б        │      Б5 Б      │     Б6 Б       │      Б7 Б        │     Б8 Б     │      Б9 Б    │     Б10 Б        │     Б11 Б        │      Б 12 Б      │     Б 1 Б3       │
├─────────────────────┼────────┼──────────────┼──────────────┼────────────┼────────────┼──────────────┼──────────┼──────────┼──────────────┼──────────────┼──────────────┼──────────────┤ Ш
.]H
.fields
ФИО_гр1 ТабНом_гр2 СумЗПТекМес_гр3 СумЗПНачГод_гр4
СумМатПомНачГод_гр5 СумМатПом30_гр6 СумУдерПНалога_гр7 СумЛьготДети_гр8
СумЛьготСебя_гр9 Льгота СумРАсчПНалог_гр10  СумПодНалог_гр11 СуммаПодНалога_ЗаМЕс
.endfields
 Ш│@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&.&&│&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&.&&│&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│ Ш
.begin
  ИтогоКолонка3 := ИтогоКолонка3 + СумЗПТекМес_гр3;
  ИтогоКолонка4 := ИтогоКолонка4 + СумЗПНачГод_гр4;
  ИтогоКолонка5 := ИтогоКолонка5 + СумМатПомНачГод_гр5;
  ИтогоКолонка6 := ИтогоКолонка6 + СумМатПом30_гр6;
  ИтогоКолонка7 := ИтогоКолонка7 + СумУдерПНалога_гр7;
  ИтогоКолонка8 := ИтогоКолонка8 + СумЛьготДети_гр8;
  ИтогоКолонка9 := ИтогоКолонка9 + СумЛьготСебя_гр9;
  ИтогоКолонка10:= ИтогоКолонка10 + Льгота;
  ИтогоКолонка11:= ИтогоКолонка11 + СумРАсчПНалог_гр10;
  ИтогоКолонка12:= ИтогоКолонка12 + СумПодНалог_гр11;
  ИтогоКолонка13:= ИтогоКолонка13 + СуммаПодНалога_ЗаМЕс;
end.
.} И
.fields
 ИтогоКолонка3
 ИтогоКолонка4
 ИтогоКолонка5
 ИтогоКолонка6
 ИтогоКолонка7
 ИтогоКолонка8
 ИтогоКолонка9
 ИтогоКолонка10
 ИтогоКолонка11
 ИтогоКолонка12
 ИтогоКолонка13
.endfields
 Р├─────────────────────┴────────┼──────────────┼──────────────┼────────────┼────────────┼──────────────┼──────────┼──────────┼──────────────┤──────────────┼──────────────┼──────────────┤ Р
 Р│  БИТОГОВЫЕ СУММЫ  Б:             │ Б&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&.&&│&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&.&&│&&&&&&&.&&│&&&&&&&&&&&.&& Б│ Б&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&& │ И
 И└──────────────────────────────┴──────────────┴──────────────┴────────────┴────────────┴──────────────┴──────────┴──────────┴──────────────┴──────────────┴──────────────┴──────────────┘
 Ш.}
.endform Ш
!
!
.linkform 'vedpr4_lnk3' prototype is 'vedpr4'
.nameinlist'Ведомость исчислений подоходного налога с заработной платы'
.group 'RULON'
.DEFO LANDSCAPE
.DEFP PA4
.SET FILLER ='_'
.fields
МесяцЗа  ГодЗа
Цех
.endfields
.{ AllVedC CheckEnter
 Р                                                  БВЕДОМОСТЬ Б
      БИСЧИСЛЕНИЙ ПОДОXОДНОГО НАЛОГА С ЗАРАБОТНОЙ ПЛАТЫ ЗА Б  Е^ Е  БМЕСЯЦ Б  Е@@@@ Е  БГОДА Б    (Ср. мин. = Д Д __________________)
                                                   БЦЕX Б  Е@~@@@@@@@@@@@@@@@@@@@@@@ Х
.{ PersCir CheckEnter
.[H
 Ш┌─────────────────────┬────────┬─────────────────────────────┬────────────┬────────────┬──────────────┬────────────────────────────────────┬──────────────┬──────────────┬──────────────┐ Лист @NP@
│                     │ БТаб. Б    │      БСумма з/платы Б           │   БСумма Б     │  БОблагаемая Б │   БСумма Б        Б Б│             БСумма  льгот Б  Б      Б      │   Б Сумма Б      │  Б Сумма Б       │   Б Сумма Б      │
│ БФамилия  И.О. Б        │ Бномер Б   ├──────────────┬──────────────┤ Бмат. Б  Бпомощи Б │ Б   часть    Б │ Буже удерж Б.     Б Б Б Б│──────────┬────────── Б Б┬───────────── Б Б─ Б┤для расчета Б   │ Бп/налога Б      │ Б п/налога Б      Б │
│                     │        │ БТек.месяц Б     │ Бс нач. года Б   │ Бс нач. года Б │  Бмат.помощи Б │ Бп/налога Б       Б Б Б│на детей Б   Б│на себя Б    Б│   Скидки Б     │ Бп/налога Б       Б│ Б               Б│за тек.месяц Б  │
├─────────────────────┼────────┼──────────────┼──────────────┼────────────┼────────────┼──────────────┼──────────┼──────────┼──────────────┼──────────────┼──────────────┼──────────────┤
│      Б1 Б               │   Б2 Б     │     Б3 Б         │      Б4 Б        │      Б5 Б      │     Б6 Б       │      Б7 Б         Б Б│     Б8 Б     │      Б9 Б    │     Б10 Б        │     Б11 Б        │      Б 12 Б      │     Б 1 Б3       │
├─────────────────────┼────────┼──────────────┼──────────────┼────────────┼────────────┼──────────────┼──────────┼──────────┼──────────────┼──────────────┼──────────────┼──────────────┤ Ш
.]H
.fields
ФИО_гр1 ТабНом_гр2 СумЗПТекМес_гр3 СумЗПНачГод_гр4
СумМатПомНачГод_гр5 СумМатПом30_гр6 СумУдерПНалога_гр7  СумЛьготДети_гр8
СумЛьготСебя_гр9 Льгота СумРАсчПНалог_гр10  СумПодНалог_гр11 СуммаПодНалога_ЗаМЕс
.endfields
 Ш│@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&.&&│&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&.&&│&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│ Ш
.} И
 Р└─────────────────────┴────────┴──────────────┴──────────────┴────────────┴────────────┴──────────────┴──────────┴──────────┴──────────────┴──────────────┴──────────────┴──────────────┘ Ш
.}
.endform
!
!
.linkform 'vedpr4_lnk4' prototype is 'vedpr4'
.nameinlist'Ведомость исчислений подоходного налога (С итоговыми суммами)'
.group 'RULON'
.DEFO LANDSCAPE
.DEFP PA4
.SET FILLER ='_'
.var
 ИтогоКолонка3 : double
 ИтогоКолонка4 : double
 ИтогоКолонка5 : double
 ИтогоКолонка6 : double
 ИтогоКолонка7 : double
 ИтогоКолонка8 : double
 ИтогоКолонка9 : double
 ИтогоКолонка10 : double
 ИтогоКолонка11 : double
 ИтогоКолонка12 : double
 ИтогоКолонка13 : double
.endvar
.fields
МесяцЗа  ГодЗа
Цех
.endfields
.{ AllVedC CheckEnter
.begin
 ИтогоКолонка3 := 0;
 ИтогоКолонка4 := 0;
 ИтогоКолонка5 := 0;
 ИтогоКолонка6 := 0;
 ИтогоКолонка7 := 0;
 ИтогоКолонка8 := 0;
 ИтогоКолонка9 := 0;
 ИтогоКолонка10 := 0;
 ИтогоКолонка11 := 0;
 ИтогоКолонка12 := 0;
 ИтогоКолонка13 := 0;
end.

 Р                                                  БВЕДОМОСТЬ Б
      БИСЧИСЛЕНИЙ ПОДОXОДНОГО НАЛОГА С ЗАРАБОТНОЙ ПЛАТЫ ЗА Б  Е^ Е  БМЕСЯЦ Б  Е@@@@ Е  БГОДА Б    (Ср. мин. = Д Д __________________)
                                                   БЦЕX Б  Е@~@@@@@@@@@@@@@@@@@@@@@@ Х
.{ PersCir CheckEnter
.[H
 Ш┌─────────────────────┬────────┬─────────────────────────────┬────────────┬────────────┬──────────────┬────────────────────────────────────┬──────────────┬──────────────┬──────────────┐ Лист @NP@
│                     │ БТаб. Б    │      БСумма з/платы Б           │   БСумма Б     │  БОблагаемая Б │   БСумма Б       │    Б         Сумма  льгот Б    Б    Б      │   Б Сумма Б      │  Б Сумма Б       │   Б Сумма Б      │
│ БФамилия  И.О. Б        │ Бномер Б   ├──────────────┬──────────────┤ Бмат. Б  Бпомощи Б │ Б   часть    Б │ Буже удерж Б.    │──────────┬──────────┬───────────── Б Б─ Б Б┤ Бдля расчета Б    Б Б Б│п/налога Б      │ Б п/налога Б      Б │
│                     │        │ БТек.месяц Б     │ Бс нач. года Б   │ Бс нач. года Б │  Бмат.помощи Б │ Бп/налога Б       Б│на детей Б   Б│на себя Б    Б│   Скидки  Б     Б│         Б      │               Б│за тек.месяц Б  │
├─────────────────────┼────────┼──────────────┼──────────────┼────────────┼────────────┼──────────────┼──────────┼──────────┼──────────────┼──────────────┼──────────────┼──────────────┤
│      Б1 Б               │   Б2 Б     │     Б3 Б         │      Б4 Б        │      Б5 Б      │     Б6 Б       │      Б7 Б        │     Б8 Б     │      Б9 Б    │     Б10 Б        │     Б11 Б        │      Б 12 Б      │     Б 1 Б3       │
├─────────────────────┼────────┼──────────────┼──────────────┼────────────┼────────────┼──────────────┼──────────┼──────────┼──────────────┼──────────────┼──────────────┼──────────────┤ Ш
.]H
.fields
ФИО_гр1 ТабНом_гр2 СумЗПТекМес_гр3 СумЗПНачГод_гр4
СумМатПомНачГод_гр5 СумМатПом30_гр6 СумУдерПНалога_гр7 СумЛьготДети_гр8
СумЛьготСебя_гр9 Льгота СумРАсчПНалог_гр10  СумПодНалог_гр11 СуммаПодНалога_ЗаМЕс
.endfields
 Ш│@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&.&&│&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&.&&│&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│ Ш
.begin
  ИтогоКолонка3 := ИтогоКолонка3 + СумЗПТекМес_гр3;
  ИтогоКолонка4 := ИтогоКолонка4 + СумЗПНачГод_гр4;
  ИтогоКолонка5 := ИтогоКолонка5 + СумМатПомНачГод_гр5;
  ИтогоКолонка6 := ИтогоКолонка6 + СумМатПом30_гр6;
  ИтогоКолонка7 := ИтогоКолонка7 + СумУдерПНалога_гр7;
  ИтогоКолонка8 := ИтогоКолонка8 + СумЛьготДети_гр8;
  ИтогоКолонка9 := ИтогоКолонка9 + СумЛьготСебя_гр9;
  ИтогоКолонка10:= ИтогоКолонка10 + Льгота;
  ИтогоКолонка11:= ИтогоКолонка11 + СумРАсчПНалог_гр10;
  ИтогоКолонка12:= ИтогоКолонка12 + СумПодНалог_гр11;
  ИтогоКолонка13:= ИтогоКолонка13 + СуммаПодНалога_ЗаМЕс;
end.
.} И
.fields
 ИтогоКолонка3
 ИтогоКолонка4
 ИтогоКолонка5
 ИтогоКолонка6
 ИтогоКолонка7
 ИтогоКолонка8
 ИтогоКолонка9
 ИтогоКолонка10
 ИтогоКолонка11
 ИтогоКолонка12
 ИтогоКолонка13
.endfields
 Р├─────────────────────┴────────┼──────────────┼──────────────┼────────────┼────────────┼──────────────┼──────────┼──────────┼──────────────┤──────────────┼──────────────┼──────────────┤ Р
 Р│  БИТОГОВЫЕ СУММЫ  Б:             │ Б&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&.&&│&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&.&&│&&&&&&&.&&│&&&&&&&&&&&.&& Б│ Б&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&& │ И
 И└──────────────────────────────┴──────────────┴──────────────┴────────────┴────────────┴──────────────┴──────────┴──────────┴──────────────┴──────────────┴──────────────┴──────────────┘
 Ш.}
.endform Ш
