#doc
Базовая форма для формирования списка некорректных операций прихода по
перемещению, не имеющих соответствующей операции расхода.<br>
#end
.Set Name = 'MBPInFr'
.Hide
.Fields
   InType : String  InDate : Date  MBPName : String  DocNum : String
.endFields
.{
   ^ ^ ^ ^
.}
.endForm

!------------------------------------------------------------

.LinkFORM MBPInFrom Prototype Is MBPInFr
.Fields
   CommonFormHeader
   InType  InDate  MBPName  DocNum
.endFields
  ^
                 Некорректные приходы по перемещению
┌─────────────────────────────┬──────────┬────────────────────┬─────────────┐
│   Тип операции (NRec)       │Дата опер.│  Наименование МБП  │  Документ N │
└─────────────────────────────┴──────────┴────────────────────┴─────────────┘
.{
 &&&&&&&&&&&&&&&&&&&&&&&&&&&&& &&&&&&&&&& &&&&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&
.}
 ───────────────────────────────────────────────────────────────────────────
.endForm

//-----------------------------------------------------------------------------
