/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,97 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Автотранспорт                                             ║
 ║ Версия        : 5.7                                                       ║
 ║ Назначение    : Автотранспорт                                             ║
 ║ Ответственный : Медведь Наталья Леонидовна                                ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
.set name='Ost_Topl'
.hide
.fields
 Predpr
 NumAkt
 DatAkt
 Npp MarkaAvt GosNmbr GarNmbr FIO VolInBak: double CountInBak: double
 Prim Npl CountInBakPl: double
 ItgNameTopl ItgKolTopl ItgKolToplPl
.endfields
.{
^
^
^
.{

^ ^ ^ ^ ^ ^ ^ ^ ^ ^

.}
.{
^ ^ ^
.}
.}
.endform

.linkform 'Ost_Topl01' prototype is 'Ost_Topl'
.NameInList 'Акт(ы) в формате ТЕКСТ'
.Group 'Avto'
.fields
 Predpr
 NumAkt
 DatAkt
 Npp MarkaAvt GosNmbr GarNmbr FIO VolInBak CountInBak NPl CountInBakPl Prim
 ItgNameTopl ItgKolTopl ItgKolToplPl
.endfields
.{
^

                                Акт № ^
                снятия остатков топлива в баках автомобилей
                               на ^


───┬────────────┬───────────┬─────────┬────────────────┬────────┬────────┬─────────┬────────┬─────────┬───────
 № │  Марка     │   Гос.    │Гаражный │    ФИО         │Емкость │Факт.   │  Номер  │Факт.   │Роспись  │Прим.
   │автомобиля  │  номер    │ номер   │  водителя      │ баков  │кол-во  │   ПЛ    │кол-во  │водителя │
   │            │           │         │                │        │в баках │         │по ПЛ   │         │
───┴────────────┴───────────┴─────────┴────────────────┴────────┴────────┴─────────┴────────┴─────────┴───────
.{
@@@ @@@@@@@@@@@  @@@@@@@@@@@ @@@@@@@@@ @@@@@@@@@@@@@@@@ &#&&&&.&& &#&&&.&& @@@@@@@@ &#&&&.&&           ^
.}
Итого по видам топлива:
.{
                             @@@@@@@@@@@@@@@@@@@@@@@@@@        &&#&&&&&.&&         &#&&&&&.&
.}
.}
.endform

.linkform 'Ost_Topl03' prototype is 'Ost_Topl'
.NameInList 'Акт(ы) в формате ТЕКСТ'
.Group 'Rail'
.fields
 Predpr
 NumAkt
 DatAkt
 Npp MarkaAvt GosNmbr GarNmbr FIO VolInBak CountInBak Prim
 ItgNameTopl ItgKolTopl
.endfields
.{
^

                                Акт № ^
                снятия остатков топлива в баках ТС
                               на ^


───┬────────────┬───────────┬─────────┬────────────────┬────────┬────────┬─────────┬───────
 № │  Марка     │ Бортовой  │Заводской│    ФИО         │Емкость │Факт.   │Роспись  │Прим.
   │    ТС      │  номер    │  номер  │  водителя      │ баков  │кол-во  │водителя │
   │            │           │         │                │        │в баках │         │
───┴────────────┴───────────┴─────────┴────────────────┴────────┴────────┴─────────┴───────
.{
@@@ @@@@@@@@@@@  @@@@@@@@@@@ @@@@@@@@@ @@@@@@@@@@@@@@@@ &#&&&&.&& &#&&&.&&          ^
.}
Итого по видам топлива:
.{
                             @@@@@@@@@@@@@@@@@@@@@@@@@@        &&#&&&&&.&&
.}
.}
.endform