/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1999 корпорация ГАЛАКТИКА                         ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Автотранспорт                                             ║
 ║ Версия        : 6.0                                                       ║
 ║ Назначение    : Сличительная ведомость                                    ║
 ║ Ответственный : Медведь Наталья Леонидовна                                ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
.set name='SlVed'
.hide
.fields
 BegDate
 EndDate
 OrgName
 Nomp
 GarNom Nomer
 FIO
 TabN
 BegOst
 SklZapr
 StZapr
 Summa
 PLZapr
 PLNorma
 PLFact
 EndOst
 PLEndOst
 Ekonom
 Pererashod
.endfields
^ ^ ^
.{
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.endform

.linkform 'SlVed01' prototype is 'SlVed'
.NameInList  'Отчет в формате ТЕКСТ'
.fields
 BegDate
 EndDate
 OrgName
 Nomp
 GarNom  Nomer
 FIO
 TabN
 BegOst
 SklZapr
 StZapr
 Summa
 PLZapr
 PLNorma
 PLFact
 EndOst
 PLEndOst
 Ekonom
 Pererashod
.endfields



                            СЛИЧИТЕЛЬНАЯ ВЕДОМОСТЬ
          результатов расхода горючего в разрезе автомобилей и водителей

                    за период с @@@@@@@@@@ по @@@@@@@@@@  @@@@@@@@@@@@@@@@@@@@@@@@@@
                                                          (наименование организации)

────┬───────┬───────────┬──────────────────┬─────────┬────────┬────────────────────────────────┬─────────────────────────────┬─────────────────────┬──────────────────────┬─────────────
 N  │ Гараж.│   Гос.    │      Ф.И.О.      │Табельный│Остаток │        Получено                │          По путевому        │       Остаток       │       Результат      │     Прим.
п.п.│ номер │   номер   │    водителя      │  номер  │в баке  ├──────────┬───────────┬─────────┼──────────┬──────────────────┼──────────┬──────────┼───────────┬──────────┼─────────────
    │       │           │                  │         │        │ со склада│ на стороне│ всего   │ Заправка │      Расход      │ В баках  │В путевых │ Экономия  │  Пережег │
    │       │           │                  │         │        │          │           │         │          ├─────────┬────────┤          │          │           │          │
    │       │           │                  │         │        │          │           │         │          │ По норме│ Фактич.│          │ листах   │           │          │
────┼───────┼───────────┼──────────────────┼─────────┼────────┼──────────┼───────────┼─────────┼──────────┼─────────┼────────┼──────────┼──────────┼───────────┼──────────┼─────────────
.{
@@@@│@@@@@@@│@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│@@@@@@@@@│&&&&&.&&│ &&&&&.&& │  &&&&&.&& │ &&&&&.&&│ &&&&&.&& │ &&&&&.&&│&&&&&.&&│ &&&&&.&& │ &&&&&.&& │  &&&&&.&& │ &&&&&.&& │
.}
────┴───────┴───────────┴──────────────────┴─────────┴────────┴──────────┴───────────┴─────────┴──────────┴─────────┴────────┴──────────┴──────────┴───────────┴──────────┴─────────────

.endform