//------------------------------------------------------------------------------
//                                           (c) корпорация ГАЛАКТИКА
// Версия        : 5.73
// Назначение    : Отчет о принятых мерах по розыску должников  в связи с
//                 предъявленными требованиями по взысканию убытков  за период
//------------------------------------------------------------------------------
#doc
<p>Отчет о принятых мерах по розыску должников  в связи с предъявленными требованиями <br>
по взысканию убытков  за период
#end
.form Otchet12
.p 60
.DEFO LANDSCAPE
.hide
.fields
 Otch1
 period
 Nam
.endfields
^^^
.{ Otdelen12 CheckEnter
.[h

.]h
.fields
 f1:string
 f2:double
 f3:double
 f4:double
.endfields
^^^^
.}
.fields
 fS1:double
 fS2:double
 fS3:double
.endfields
^^^
.endform