//******************************************************************************
//                                                      (c) корпорация Галактика
// Галактика 8.1 - Логистика
// Отчет о наличии МЦ с целевым учетом старым и базовая форма с новым
//******************************************************************************

#doc
Остатки матценностей по складским разрезам
и в разрезе объектов строительства (целевого назначения)
#end

#ifndef __MTR_TO_SPEC__

.set name = 'SeeSalMcObj'
.hide
#include format.frn
.fields
 fDate:date
 fType MCnrec fMC fEd fObj fPodr fMOL fParty
 fKol:Double EdIzm  fPrice:Double sumMC:Double   fPriceV:Double vSumMC:Double fVal

 sum:double  vSum:double sVal

.endfields
^
.{
^  ^^^^^^^  ^^ ^^ ^^ ^
.}
^ ^ ^
.endform

//-----------------------------------------------------------------------
#doc
Остатки матценностей по складским разрезам и в разрезе объектов строительства
#end
.linkform 'SeeSalMcObj_01' prototype is 'SeeSalMcObj'
.NameInList 'Остатки матценностей по складским разрезам и в разрезе объектов строительства'
.fields
  CommonFormHeader
  fDate: 'm:DD/MM/YYYY г.'

  fType fMC fPodr fMOL fParty fObj
  DoubleToStr(fKol, Kol_Pr) fEd fPrice sumMC fPriceV vSumMC fVal

  fType fMC fPodr fMOL fParty fObj
  DoubleToStr(fKol, Kol_Pr) fEd fPrice sumMC fPriceV vSumMC fVal

  sum vSum sVal
.endfields
^
                         БОСТАТКИ МАТЦЕННОСТЕЙ НА ^ Б
 Р──┬────────────────────────┬────────────────────┬────────────────┬────────────────┬────────────────────┬─────────────┬───────┬─────────────┬────────────────┬─────────────┬─────────────┬────
 =│Наименование матценности│        Склад       │       МОЛ      │     Партия     │Объект строительства│  Количество │Ед.изм.│ Средняя цена│    Стоимость   │средн. в вал.│стоим. в вал.│вал.
──┴────────────────────────┴────────────────────┴────────────────┴────────────────┴────────────────────┴─────────────┴───────┴─────────────┴────────────────┴─────────────┴─────────────┴──── Р
.{
.{?INTERNAL;fType<>'=';
 Р @ @@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&& @@@@@@@ &'&&&&&&&&.&& &'&&&&&&&&&&&.&& &'&&&&&&&&.&& &'&&&&&&&&.&& @@@@ Р
.}
.{?INTERNAL;fType='=';
 С @ @@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&& @@@@@@@ &'&&&&&&&&.&& &'&&&&&&&&&&&.&& &'&&&&&&&&.&& &'&&&&&&&&.&& @@@@ С
.}
.}

 Й Итого  &'&&&&&&&&&&&&&&&&.&&  в валюте &'&&&&&&&&&&&&&&&.&& @@@@@@@ Й

 ИВ первой колонке символ '=' означает, что это итоговая запись по предприятию
В первой колонке символ '*' означает, что это значения в разрезе объектов строительства И
.endform

#else

.set name = 'SeeSalMcObj'
.hide
#include format.frn
.fields
 fDate
 fType MCnrec fMC fEd fObj fkau1 fkau2 fkau3 fkau4 fkau5 fkau6 fkau7 fkau8 fkau9
 fPodr fMOL fParty
 fKol:Double EdIzm  fPrice:Double sumMC:Double   fPriceV:Double vSumMC:Double fVal

 sum:double  vSum:double sVal

.endfields
^
.{
^  ^^^^^^^^^^^^^^^^  ^^ ^^ ^^ ^
.}
^ ^ ^
.endform
#end
