/*
  Проект      : ГАЛАКТИКА
  Назначение  : Просмотр наличия матценностей на складах(текущее состояние)
*/

#doc
Просмотр наличия матценностей на складах(текущее состояние)
#end
.set name = 'SeeTekOst'
.hide
.Group 'Подробный отчет'

.fields

justsklad
header
nrec_mc
name0
name1  sklad   ost : double   res : double   svob : double

       t_ost : double t_res : double t_svob : double
       m_ost : double m_res : double m_svob : double
p_nam  p_ost : double p_res : double p_svob : double

.endfields

^
^
.{
^ ^
.{
^ ^ ^ ^ ^
.}
  ^ ^ ^
  ^ ^ ^
^ ^ ^ ^
.}
.endform
//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
#doc
Итоговая ведомость текущих остатков ТМЦ на предприятии
#end
.linkform 'SeeTekOst_1' prototype is 'SeeTekOst'
.NameInList 'Итоговая ведомость текущих остатков ТМЦ на предприятии'
.Group 'Итоговый отчет по предприятию'
.fields
  CommonFormHeader
 name0 m_ost m_res m_svob
.endfields
^
          Ведомость наличия текущих остатков ТМЦ на предприятии
───────────────────────────────────────┬─────────────┬──────────┬─────────────
       Наименование матценности        │   Остаток   │  Резерв  │  Свободно
───────────────────────────────────────┴─────────────┴──────────┴─────────────
.{
.{
.}
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&.&&& &'&&&&.&&& &'&&&&&&&.&&&
.}
.endform
!
!
!
#doc
Итоговая ведомость текущих остатков ТМЦ в сумме по всем складам
#end
.linkform 'SeeTekOst_2' prototype is 'SeeTekOst'
.NameInList 'Итоговая ведомость текущих остатков ТМЦ в сумме по всем складам'
.Group 'Итоговый отчет по складам'
.fields
  CommonFormHeader
 justsklad
 name0 t_ost t_res t_svob
.endfields
^
            Ведомость текущих остатков ТМЦ в сумме по складам
@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
───────────────────────────────────────┬─────────────┬──────────┬─────────────
       Наименование матценности        │   Остаток   │  Резерв  │  Свободно
───────────────────────────────────────┴─────────────┴──────────┴─────────────
.{
.{
.}
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&.&&& &'&&&&.&&& &'&&&&&&&.&&&
.}
.endform
!
!
!
#doc
Ведомость текущих остатков ТМЦ на складах
#end
.linkform 'SeeTekOst_0' prototype is 'SeeTekOst'
.NameInList 'Ведомость текущих остатков ТМЦ на складах'
.Group 'Подробный отчет'
.fields
  CommonFormHeader
  justsklad
  name1   sklad   ost   res   svob
          t_ost t_res t_svob
.endfields
^
                 БВедомость текущих остатков ТМЦ на складах Б
 Б@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
────────────────────────┬──────────────────────┬──────────┬────────┬──────────
Наименование матценности│  Наименование склада │  Остаток │ Резерв │ Свободно
────────────────────────┴──────────────────────┴──────────┴────────┴──────────
.{
.{
@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@ &&&&&&&&.& &&&&&&.& &&&&&&&&.&
.}
           БВСЕГО на складах:                     &&&&&&&&.& &&&&&&.& &&&&&&&&.& Б
.{?INTERNAL;p_nam<>'';
.fields
        p_nam  p_ost p_res p_svob
.endfields
           Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@       &&&&&&&&.& &&&&&&.& &&&&&&&&.& Б
.}
  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -
.}
.endform
!
!
!
#doc
Подробная ведомость текущих остатков ТМЦ на складах (без резервов)
#end
.linkform 'SeeTekOst_4' prototype is 'SeeTekOst'
.NameInList 'Подробная ведомость текущих остатков ТМЦ на складах (без резервов)'
.Group 'Подробный отчет'
.fields
  CommonFormHeader
justsklad
name1   sklad   ost
               t_ost
.endfields
^
      Ведомость текущих остатков ТМЦ на складах (без учета резерва)
@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
────────────────────────────────────────┬─────────────────────┬───────────────
        Наименование матценности        │ Наименование склада │    Остаток
────────────────────────────────────────┴─────────────────────┴───────────────
.{
.{
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&.&&&
.}
              ВСЕГО на складах:                                &'&&&&&&&&&.&&&
  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -
.}
.endform
!
!
!
