//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.70 - Основные средства
// Наличие, движение и состав ОС (НМА). Форма № 11
//------------------------------------------------------------------------------

#doc
Наличие, движение и состав основных средств (нематериальных активов). Форма № 11
#end

.Set Name='Form11'
.Hide
.Fields
CurrFormat : string
CurrFormatUkr : string
SumFormat  : string

dFormStDate : date // начальная дата формы
dFormEndDate: date // конечная дата формы

NRec_Org    // ссылка на организацию
OrgName     //Наименование организации
IndexK       //Индекс организации
State       //Государство
City        //Город
OrgAddr     //адрес организации
OrgOKPO     //Код ОКПО/ОКЮЛП организации
OrgOKONH    //Код ОКОНХ/ОКВЭД организации
OrgUNN      //код УНП/УНН 

wPodrazdel_1 : word // номер подраздела
DopParamNum
s1 : string  //наименование
s2 : string  //код
s3  s4  s5  s6  s7  s8  s9  s10 s11 s12 s13 s14 s15 s16 s17 s18 s19 s20 s21 s22 s23 s24 s25

wPodrazdel_2 : word // номер подраздела
DopParamNuma
sa : string
sb : string
sc  sd  se  sf  sg  sh  si  sj  sk  sl  sm  sn  so  sp  sr  ss  st  su  sv  sw  sx  sy  sz

wPodrazdel_3 : word // номер подраздела
DopParamNuma2
sa2: string
sb2: string
sc2 sd2 se2 sf2 sg2 sh2 si2 sj2 sk2 sl2 sm2 sn2 so2 sp2 sr2 ss2 st2 su2 sv2 sw2 sx2 sy2 sz2

.EndFields
.{
^^^^^
^^^^^^^^^
.{
^
^
^^^^^^^^^^^^^^^^^^^^^^^^^
.}
.{
^
^
^^^^^^^^^^^^^^^^^^^^^^^^^
.}
.{
^
^
^^^^^^^^^^^^^^^^^^^^^^^^^
.}
.}
.endForm

#ifdef __Form11RU_do_20080814_N189__
//
//**************************************************************************
.linkform 'Form11_1' prototype is 'Form11'
.nameInList 'Наличие, движение и состав основных фондов'
.group '1'
.DEFO LANDSCAPE
.P 60
#include Form11fn.frn
end. // Вынес из Form11fn.frn, для того чтобы не появлялась лишняя строка
.Fields
CommonFormHeader

OrgName     // Наименование организации
if(IndexK<>'',IndexK+', ','') + if(State <> '',State+', ','') + if(City <> '',City+', ','') + OrgAddr  // Почтовый адрес организации
OrgOKPO     //Код ОКПО/ОКЮЛП организации
OrgOKONH    //Код ОКОНХ/ОКВЭД организации

CurrFormat
.EndFields
^


 Б                      ФЕДЕРАЛЬНОЕ ГОСУДАРСТВЕННОЕ СТАТИСТИЧЕСКОЕ НАБЛЮДЕНИЕ Б
                     КОНФИДЕНЦИАЛЬНОСТЬ ГАРАНТИРУЕТСЯ ПОЛУЧАТЕЛЕМ ИНФОРМАЦИИ

 И Нарушение порядка представления статистической информации, а равно представление недостоверной статистической информации
 влечет ответственность, установленную статьей 13.19 Кодекса Российской Федерации об административных правонарушениях от
 30.12.2001 N 195-ФЗ, а также статьей 3 Закона Российской Федерации от 13.05.92 N 2761-1 "Об ответственности за нарушение
 порядка представления государственной статистической отчетности" И

 Б                     СВЕДЕНИЯ О НАЛИЧИИ И ДВИЖЕНИИ ОСНОВНЫХ ФОНДОВ (СРЕДСТВ)
                                 И ДРУГИХ НЕФИНАНСОВЫХ АКТИВОВ
                                          за 20__ год. Б
 И
┌────────────────────────────────────────────────────────────────────────────────────────────────┬─────────────┐  ┌────────────────┐
│                                    Представляют:                                               │    Сроки    │  │   Форма N 11   │
│                                                                                                │представления│  └────────────────┘
├────────────────────────────────────────────────────────────────────────────────────────────────┼─────────────┤      Утверждена
│юридические лица, их обособленные подразделения (кроме субъектов малого предпринимательства и   │  1 апреля   │    постановлением
│некоммерческих организаций):                                                                    │             │       Росстата
│- территориальному органу Росстата в субъекте Российской Федерации по установленному им адресу; │             │   от 01.08.05 N 51
│- органу, осуществляющему государственное регулирование в соответствующей сфере деятельности;   │             │  ┌────────────────┐
│- органу регулирования естественных монополий в соответствующей сфере деятельности;             │             │  │     Годовая    │
└────────────────────────────────────────────────────────────────────────────────────────────────┴─────────────┘  └────────────────┘

┌──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
│Наименование отчитывающейся организации  Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б │
├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
│Почтовый адрес   Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  Б│
├───────┬──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
│ Код   │                                                            Код                                                           │
│формы  ├────────────────┬────────────────┬───────────────┬──────────────────────┬────────────────┬───────────────┬────────────────┤
│по ОКУД│ отчитывающейся │      вида      │ территории по │ министерства (ведом- │организационно- │    формы      │                │
│       │  организации   │  деятельности  │    ОКАТО      │ ства), органа управ- │    правовой    │ собственности │                │
│       │    по ОКПО     │    по ОКВЭД    │               │ ления по ОКОГУ       │ формы по ОКОПФ │   по ОКФС     │                │
├───────┼────────────────┼────────────────┼───────────────┼──────────────────────┼────────────────┼───────────────┼────────────────┤
│   1   │       2        │        3       │       4       │           5          │       6        │       7       │       8        │
├───────┼────────────────┼────────────────┼───────────────┼──────────────────────┼────────────────┼───────────────┼────────────────┤
│       │                │                │               │                      │                │               │                │
│0602001│@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@│               │                      │                │               │                │
└───────┴────────────────┴────────────────┴───────────────┴──────────────────────┴────────────────┴───────────────┴────────────────┘ И


















 Й                                                  I. Наличие, движение и состав основных фондов   Й
.{
 Ш
 Ш.{
.[H OverWrite
 Щ                                                                                                                                                                           Коды по ОКЕИ: ^ - 384; год - 366; месяц - 362
 ────────────────────────────────────────────────────┬──────┬─────────────┬───────────────────────────┬───────────────────────────────────────┬─────────────┬─────────────┬────────────┬────────────┬─────────────┬─────────────
                                                     │      │             │ Увеличение полной учетной │Уменьшение полной учетной стоимости за │             │             │            │            │             │
                                                     │      │  Изменение  │ стоимости за отчетный год │    отчетный год (выбытие) за счет:    │             │             │            │            │             │
                                                     │      │   полной    │  (поступление) за счет:   │                                       │   Наличие   │   Наличие   │Амортизация │в том числе-│Учетный износ│   Полная
                                                     │   N  │   учетной   ├─────────────┬─────────────┼─────────────┬─────────────┬───────────┤на конец года│  на конец   │  и износ   │амортизация │ по ликвиди- │   учетная
               Наименование показателей              │строки│  стоимости  │  создания   │приобретения │ ликвидации  │ из них -    │  выбытия  │  по полной  │    года     │  основных  │            │  рованным   │  стоимость
                                                     │      │   за счет   │    новой    │  бывших в   │  основных   │ вследствие  │ по прочим │   учетной   │по остаточной│   фондов,  │            │  основным   │  основных
                                                     │      │ переоценки, │  стоимости  │употреблении │   фондов    │ потерь от   │ причинам  │  стоимости  │  балансовой │отражаемые в│            │   фондам    │   фондов
                                                     │      │осуществлен- │  (ввода в   │  основных   │             │ стихийных   │           │             │  стоимости  │бухгалтерс- │            │             │  на начало
                                                     │      │ной на начало│  действие   │   фондов    │             │ бедствий,   │           │             │             │ком учете и │            │             │    года,
                                                     │      │  отчетного  │    новых    │             │             │ техногенных │           │             │             │отчетности  │            │             │ следующего
                                                     │      │    года     │  основных   │             │             │ катастроф,  │           │             │             │(учетный из-│            │             │     за
                                                     │      │             │   фондов,   │             │             │ автоката-   │           │             │             │нос), за год│            │             │ отчетным*(1)
                                                     │      │             │модернизации,│             │             │ строф, по-  │           │             │             │            │            │             │
                                                     │      │             │ реконструк- │             │             │ жаров,воен- │           │             │             │            │            │             │
                                                     │      │             │    ции)     │             │             │ ных дейст-  │           │             │             │            │            │             │
                                                     │      │             │             │             │             │ вий и т.д.  │           │             │             │            │            │             │
 ────────────────────────────────────────────────────┼──────┼─────────────┼─────────────┼─────────────┼─────────────┼─────────────┼───────────┼─────────────┼─────────────┼────────────┼────────────┼─────────────┼─────────────
                           1                         │  2   │      3      │      4      │      5      │      6      │      7      │     8     │      9      │     10      │     11     │     12     │     13      │     14
 ────────────────────────────────────────────────────┴──────┴─────────────┴─────────────┴─────────────┴─────────────┴─────────────┴───────────┴─────────────┴─────────────┴────────────┴────────────┴─────────────┴───────────── Щ
.]H
.begin
  ParseParamName(s1);
  N1 := 1;
end.
! Вывод предварительных подстрок
.{WHILE N1 < RowCnt
.{?INTERNAL;(ClmnCnt[N1]=1)
.Fields
  #NAIM_POK(N1,1)
.EndFields
 Ш @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
.}
.{?INTERNAL;(ClmnCnt[N1]=2)
.Fields
  #NAIM_POK(N1,1)
  #NAIM_POK(N1,2)
.EndFields
 Ш @@@@@@@@@@@@@@@@@@@@@@@@@  @@@@@@@@@@@@@@@@@@@@@@@@@ Ш
.}
.begin
  N1 := N1 + 1;
end.
.}
! Вывод основной подстроки
.{?INTERNAL;(ClmnCnt[RowCnt]=1)
.Fields
!.{
 #NAIM_POK(RowCnt,1)
 s2
 if (double(s20) - double(s3) <> 0,
   DoubleToStr(double(s20) - double(s3),SumFormat),
   '')
 if (double(s5) + double(s17) <> 0,
   DoubleToStr(double(s5) + double(s17),SumFormat),
   '')
 if (double(s4) - double(s17) - double(s5) <> 0,
   DoubleToStr(double(s4) - double(s17) - double(s5),SumFormat),
   '')
 s7
 if (double(s24) - double(s7) <> 0,
   DoubleToStr(double(s24) - double(s7),SumFormat),
   '')
 s8
 s9
 s10
 s10
 s11
 s12
!.}
.EndFields
 Ш @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@ &#'&&&&&&&&&& &#'&&&&&&&&&& &#'&&&&&&&&&& &#'&&&&&&&&&&               &#'&&&&&&&& &#'&&&&&&&&&& &#'&&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&&& &#'&&&&&&&&&& Ш
.}
.{?INTERNAL;(ClmnCnt[RowCnt]>1)
.Fields
!.{
 #NAIM_POK(RowCnt,1)
 #NAIM_POK(RowCnt,2)
 #NAIM_POK(RowCnt,3)
 s2
 if (double(s20) - double(s3) <> 0,
   DoubleToStr(double(s20) - double(s3),SumFormat),
   '')
 if (double(s5) + double(s17) <> 0,
   DoubleToStr(double(s5) + double(s17),SumFormat),
   '')
 if (double(s4) - double(s17) - double(s5) <> 0,
   DoubleToStr(double(s4) - double(s17) - double(s5),SumFormat),
   '')
 s7
 if (double(s24) - double(s7) <> 0,
   DoubleToStr(double(s24) - double(s7),SumFormat),
   '')
 s8
 s9
 s10
 s10
 s11
 s12
!.}
.EndFields
 Ш                                 ┌──────────────────┐ Ш
 Ш @@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@ │@@@@@@@@@@@@@@@@@@│ @~@@@@ &#'&&&&&&&&&& &#'&&&&&&&&&& &#'&&&&&&&&&& &#'&&&&&&&&&&               &#'&&&&&&&& &#'&&&&&&&&&& &#'&&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&&& &#'&&&&&&&&&& Ш
 Ш ─────────────────               └──────────────────┘ Ш
.}
.} Ш
 ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

.{
.begin
  ParseParamName(sa);
  N1 := 1;
end.
! Вывод предварительных подстрок
.{WHILE N1 < RowCnt
.Fields
  #NAIM_POK(N1,1)
.EndFields
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.begin
  N1 := N1 + 1;
end.
.}
! Вывод основной подстроки
.Fields
 if (word(Trim(sb)) = 28,
   if (double(ss) <> 0,
     DoubleToStr(double(ss),SumFormat),
     ''),
   if (double(sc) <> 0,
     DoubleToStr(double(sc),SumFormat),
     ''))
 #NAIM_POK(RowCnt,1)
 sb
 if ((word(Trim(sb)) >= 29) and (word(Trim(sb)) <= 31),
   'год',
   if ((word(Trim(sb)) >= 32) and (word(Trim(sb)) <= 35),
     'лет',
     if (word(Trim(sb)) = 36,
       'месяцев',
       CurrFormat)))
.EndFields
                                                                                         &#'&&&&&&&&&&&&
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (@@@) ─────────────── ^
.}
.{
.}
.}
 Ш
.EndForm


//
//**************************************************************************
.linkform 'Form11_2' prototype is 'Form11'
.nameInList 'Наличие основных фондов'
.group '2'
.DEFO portrait
#include Form11fn.frn
end. // Вынес из Form11fn.frn, для того чтобы не появлялась лишняя строка
.Fields
CommonFormHeader

CurrFormat
.EndFields
^
 Й                         II. Наличие основных фондов   Й
.{
.[H OverWrite
 Щ                                                                                            Код по ОКЕИ: ^ - 384
 ─────────────────────────────────────────────────────────────────────────────────────────┬──────┬──────────────────────────────
                                                                                          │  N   │      Наличие по полной
                           Наименование показателей                                       │строки│      учетной стоимости
                                                                                          │      │   на конец отчетного года
 ─────────────────────────────────────────────────────────────────────────────────────────┼──────┼──────────────────────────────
                                       1                                                  │  2   │              3
 ─────────────────────────────────────────────────────────────────────────────────────────┴──────┴────────────────────────────── Щ
.]H
 Ш
.{
.begin
  ParseParamName(s1);
  N1 := 1;
end.
! Вывод предварительных подстрок
.{WHILE N1 < RowCnt
.Fields
  #NAIM_POK(N1,1)
.EndFields
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.begin
  N1 := N1 + 1;
end.
.}
! Вывод основной подстроки
.Fields
!.{
 #NAIM_POK(RowCnt,1)
 s2 s3
!.}
.EndFields
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@ &#'&&&&&&&&&&&&&&&&&&&&&&&&&&&
.}
 ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.{
.}
.{
.}
.}
 Ш
.EndForm

//
//**************************************************************************
.linkform 'Form11_3' prototype is 'Form11'
.nameInList 'Основные фонды, на которые не начисляется амортизация'
.group '3'
.defo portrait
.P 60
#include Form11fn.frn
end. // Вынес из Form11fn.frn, для того чтобы не появлялась лишняя строка
.Fields
CommonFormHeader
CurrFormat
.EndFields
^
 Й                III.Основные фонды, на которые не начисляется амортизация Й
.{
.[H OverWrite
                                         Код по ОКЕИ: ^ - 384
 ─────────────────────────────────┬──────┬─────────────────────────────────
                                  │      │ Из гр. 9 раздела I - стоимость
                                  │      │  основных фондов, по которым
                                  │  N   │  амортизация в бухгалтерском
     Наименование показателей     │строки│      учете на начисляется
                                  │      ├────────────────┬────────────────
                                  │      │     Всего      │из них полностью
                                  │      │                │амортизированные
                                  │      │                │  (изношенные)
 ─────────────────────────────────┼──────┼────────────────┼────────────────
                      1           │  2   │       3        │       4
 ─────────────────────────────────┴──────┴────────────────┴────────────────
.]H

.{
.begin
  ParseParamName(s1);
  N1 := 1;
end.
! Вывод предварительных подстрок
.{WHILE N1 < RowCnt
.Fields
  #NAIM_POK(N1,1)
.EndFields
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.begin
  N1 := N1 + 1;
end.
.}
! Вывод основной подстроки
.Fields
!.{
 #NAIM_POK(RowCnt,1)
 s2
 s3
 s4
!.}
.EndFields
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@ &#'&&&&&&&&&&&&& &#'&&&&&&&&&&&&&
.}
 ──────────────────────────────────────────────────────────────────────────
.{
.}
.{
.}
.}

.EndForm

//
//**************************************************************************
.linkform 'Form11_5' prototype is 'Form11'
.nameInList 'Другие нефинансовые активы'
.group '4'
#include Form11fn.frn
end. // Вынес из Form11fn.frn, для того чтобы не появлялась лишняя строка
.Fields
CommonFormHeader
CurrFormat
.EndFields
^
 Й                 IV.Другие нефинансовые активы Й
.{
.[H OverWrite
 Р                                                                                               Код по ОКЕИ: ^ - 384
 ─────────────────────────────────────────────────────────────────────────────────────────────┬──────┬─────────────────────────────
                                   Наименование показателей                                   │  N   │    По учетной стоимости
                                                                                              │строки│        на конец года
 ─────────────────────────────────────────────────────────────────────────────────────────────┼──────┼─────────────────────────────
                                              1                                               │  2   │              3
 ─────────────────────────────────────────────────────────────────────────────────────────────┴──────┴───────────────────────────── Р
.]H

.{
.begin
  ParseParamName(s1);
  N1 := 1;
end.
! Вывод предварительных подстрок
.{WHILE N1 < RowCnt
.Fields
  #NAIM_POK(N1,1)
.EndFields
 Р @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Р
.begin
  N1 := N1 + 1;
end.
.}
! Вывод основной подстроки
.Fields
 #NAIM_POK(RowCnt,1)
 s2
 if (word(Trim(s2)) = 65,
   if ((double(s10)<>0), DoubleToStr(double(s10),SumFormat), ''),
   if ((double(s4)<>0), DoubleToStr(double(s4),SumFormat), ''))
.EndFields
 Р @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@ &#'&&&&&&&&&&&&&&&&&&&&&&&&&& Р
.}
 Р ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Р

.{
.begin
  ParseParamName(sa);
  N1 := 1;
end.
! Вывод предварительных подстрок
.{WHILE N1 < RowCnt
.Fields
  #NAIM_POK(N1,1)
.EndFields
 Р@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Р
.begin
  N1 := N1 + 1;
end.
.}
! Вывод основной подстроки
.Fields
 sc
 #NAIM_POK(RowCnt,1)
 sb CurrFormat
.EndFields
 Р                                                                                                           &#'&&&&&&&&&&&&
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (@@@) ─────────────── ^ Р
.}
.{
.}
.}

.EndForm
#else
#include form11os_ru.frn
#end

!#ifdef __form11_Belarus__
#ifdef __Form11Bel_do_20080829_N144__
// формы до постановления №144 от 29.08.2008
! ------------------------------------------------------------
! Линк-формы ведомости для Беларуси
! ------------------------------------------------------------
.linkform 'Form11_1Bel_Old' prototype is 'Form11'
.nameInList 'Наличие, движение и состав основных фондов (средств)'
.group '1Bel'
.Hide
.DEFO LANDSCAPE
.P 60
.var
OrgName1 : string
.endvar
.begin
OrgName1 :=GroupWrap(OrgName,1,36);
end.
.Fields
  CommonFormHeader
  GroupWrap(OrgName,1,39)     // Наименование организации
  Trim(SubStr(OrgName,length(OrgName1)+1,length(OrgName)-length(OrgName1)))
  if(IndexK<>'',IndexK+', ','') + if(State <> '',State+', ','') + if(City <> '',City+', ','') + OrgAddr   // Почтовый адрес организации
#ifdef GAL5_85
  sGetTune('KatOrg.FldView.OKONH')
#endif
  OrgOKPO     //Код ОКПО/ОКЮЛП организации
  OrgOKONH    //Код ОКОНХ/ОКВЭД организации
  CurrFormat
  s1 s2
  s20 s25
! если "всего" выводим без переоценки на начало периода формы,
! то и дооценку/уценку уменьшаем на эту сумму
  s23 s5 if((double(s14)+double(s23)-double(s4)<>0), DoubleToStr(double(s14)+double(s23)-double(s4),SumFormat), '')
  s24 s7 if((double(s15)+double(s24)-double(s6)<>0), DoubleToStr(double(s15)+double(s24)-double(s6),SumFormat), '')
  s8 s9
  s10
  s18 s19
  CurrFormat
  sa sb ss sh
  CurrFormat
  sa2 sb2
.EndFields
^



                             ┌───────────────────────────────────────────────────────────┐
                             │        ГОСУДАРСТВЕННАЯ СТАТИСТИЧЕСКАЯ ОТЧЕТНОСТЬ          │
                             │  Конфиденциальность гарантируется получателем информации  │
                             └───────────────────────────────────────────────────────────┘

                              Б ┌─────────────────────────────────────────────────────────┐
                              │                          ОТЧЕТ                          │
                              │      О НАЛИЧИИ И ДВИЖЕНИИ ОСНОВНЫХ ФОНДОВ (СРЕДСТВ)     │
                              │              И ДРУГИХ НЕФИНАНСОВЫХ АКТИВОВ              │
                              │                       за 200__ год                      │
                              └─────────────────────────────────────────────────────────┘ Б
 И
┌─────────────────────────────────────────────────────────────────────────────────┐
│                                         @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │                                        ДФорма N 11 Д
│ Наименование отчитывающейся организации _______________________________________ │
│ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │
│ _______________________________________________________________________________ │              УТВЕРЖДЕНО
│                 (полное наименование в соответствии с уставом)                  │
│                                                                                 │
│ _______________________________________________________________________________ │              Постановление Министерства статистики
│                                                                                 │              и анализа Республики Беларусь
│ Наименование вышестоящей организации __________________________________________ │              15 июля 2002  N 69
│                                                                                 │
│                                                                                 │
│ _______________________________________________________________________________ │
│                                                                                 │
│                                                                                 │                   БГодовая Б
│ Орган управления ______________________________________________________________ │
│                  (министерство, комитет, общественное объединение,              │  ┌───────────────────────────────────────────────┐
│                                                                                 │  │ Представляют юридические лица, их обособленные│
│ _______________________________________________________________________________ │  │ подразделения всех форм собственности, имеющие│
│                              другой орган управления)                           │  │ обособленный (отдельный) баланс, расчетный    │
│                                                                                 │  │ (текущий) или иной счет (кроме отчитывающихся │
│ Форма собственности ___________________________________________________________ │  │ по форме N 1-МП и бюджетных организаций) до   │
│                @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │  │ 25 марта:                                     │
│ Почтовый адрес ________________________________________________________________ │  │ 1) районному (городскому) отделу статистики;  │
│                                                                                 │  │ 2) своей вышестоящей организации.             │
└─────────────────────────────────────────────────────────────────────────────────┘  └───────────────────────────────────────────────┘

┌─────────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
│     Код     │                                                         КОД                                                          │
│    формы    ├─────────────┬──────────────┬──────────────┬──────────────┬──────────────┬──────────────┬─────────────┬───────────────┤
│     по      │ организации-│ организации- │    органа    │   отрасли    │  основного   │  территории  │ формы (вида)│организационно-│
#ifdef GAL5_85
│    ОКУД     │ составителя │ составителя  │  управления  │   по @@@@@   │  вида эконо- │   по СОАТО   │собственности│   правовой    │
#else
│    ОКУД     │ составителя │ составителя  │  управления  │   по ОКОНХ   │  вида эконо- │   по СОАТО   │собственности│   правовой    │
#endif
│             │   отчета    │   отчета     │(общественного│              │   мической   │              │   по ОКФС   │     формы     │
│             │   по ОКПО   │   по ОКЮЛП   │ объединения) │              │ деятельности │              │             │   по ОКОПФ    │
│             │             │              │   по ОКОГУ   │              │   по ОКЭД    │              │             │               │
│             │             │              │              │              │              │              │             │               │
├─────────────┼─────────────┼──────────────┼──────────────┼──────────────┼──────────────┼──────────────┼─────────────┼───────────────┤
│      1      │      2      │      3       │      4       │      5       │      6       │      7       │      8      │       9       │
├─────────────┼─────────────┼──────────────┼──────────────┼──────────────┼──────────────┼──────────────┼─────────────┼───────────────┤
│   0602006   │             │@@@@@@@@@@@@@@│              │@@@@@@@@@@@@@@│              │              │             │               │
└─────────────┴─────────────┴──────────────┴──────────────┴──────────────┴──────────────┴──────────────┴─────────────┴───────────────┘ И

 Ш                                                          БРаздел I. Наличие, движение и состав основных фондов (средств) Б
.{
.{
.[H OverWrite
                                                                                                                                                                                                               (^)
  Б──────────────────────────────────────────┬──────┬─────────────────────────┬──────────────────────────────────────┬──────────────────────────────────────┬─────────────────────────┬────────────┬─────────────────────────
                                           │      │ Наличие на начало года  │      Поступило в отчетном году       │       Выбыло в отчетном году         │  Наличие на конец года  │            │Стоимость на конец года
                                           │      ├────────────┬────────────┼────────────┬─────────────────────────┼────────────┬─────────────────────────┼────────────┬────────────┤   Износ    │без последней переоценки
                                           │      │            │            │            │         из них:         │            │         из них:         │            │            │ основных   ├────────────┬────────────
           Наименование показателя         │   N  │   перво-   │ остаточная │   всего    ├─────────────┬───────────┤    всего   ├────────────┬────────────┤ восстанови-│ остаточная │  фондов,   │            │
                                           │строки│ начальная  │ стоимость  │            │введено новых│ дооценка  │            │   ликви-   │   уценка   │  тельная   │ стоимость  │начисленный │   перво-   │ остаточная
                                           │      │(балансовая)│            │            │  основных   │ основных  │            │  дировано, │  основных  │ стоимость  │            │  за год    │ начальная  │
                                           │      │ стоимость  │            │            │   фондов    │  фондов   │            │   списано  │   фондов   │            │            │            │            │
 ──────────────────────────────────────────┼──────┼────────────┼────────────┼────────────┼─────────────┼───────────┼────────────┼────────────┼────────────┼────────────┼────────────┼────────────┼────────────┼────────────
                    А                      │  Б   │     1      │      2     │     3      │      4      │     5     │     6      │     7      │      8     │     9      │     10     │     11     │     12     │     13
 ──────────────────────────────────────────┴──────┴────────────┴────────────┴────────────┴─────────────┴───────────┴────────────┴────────────┴────────────┴────────────┴────────────┴────────────┴────────────┴──────────── Б
.]H
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@ &#'&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&&& &#'&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&&
.}

                                              БСПРАВОЧНО Б
.{
.[H OverWrite
                                                                                  (^)
  Б────────────────────────────────────────────┬──────┬─────────────────────────────────────────
                                             │      │     Наличие на конец отчетного года
                                             │      ├──────────────┬──────────────────────────
             Наименование показателя         │   N  │по балансовой │стоимость с учетом резуль-
                                             │строки│  стоимости   │татов последней переоценки
 ────────────────────────────────────────────┼──────┼──────────────┼──────────────────────────
                      А                      │  Б   │       1      │            2
 ────────────────────────────────────────────┴──────┴──────────────┴────────────────────────── Б
.]H
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@ &#'&&&&&&&&&&& &#'&&&&&&&&&&&&&&&&&&&&&&&
.}

.{
.[H OverWrite
                                                                       (^)
  Б────────────────────────────────────────────┬──────┬──────────────┬───────────────
                                             │      │      За      │  За отчетный
             Наименование показателя         │  N   │  предыдущий  │      год
                                             │строки│     год      │
 ────────────────────────────────────────────┼──────┼──────────────┼───────────────
                      А                      │  Б   │       1      │       2
 ────────────────────────────────────────────┴──────┴──────────────┴─────────────── Б
.]H
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@
.}
 ─────────────
* Строки: 406, 407, 408, 409 заполняют только организации, относящиеся к отрасли
  "сельское хозяйство".
.}
 Ш
.EndForm

.linkform 'Form11_1Bel' prototype is 'Form11'
.nameInList 'Наличие, движение и состав основных средств'
.group '1Bel'
.DEFO LANDSCAPE
.P 60
#include Form11fn.frn
end. // Вынес из Form11fn.frn, для того чтобы не появлялась лишняя строка
.var
  OrgName1 : string
  wTitleRazdel : word
  sYearOtch : string
  strNoneInfo : string
.endvar
.begin
  OrgName1 :=GroupWrap(OrgName,1,36);
  wTitleRazdel := 0;
  sYearOtch    := DateToStr(if(Longint(dFormEndDate) > 0, dFormEndDate, Cur_Date ), 'YYYY');
end.
.Fields
  CommonFormHeader
  sYearOtch
  GroupWrap(OrgName,1,39)     // Наименование организации
  Trim(SubStr(OrgName,length(OrgName1)+1,length(OrgName)-length(OrgName1)))
  ' '
  if(IndexK<>'',IndexK+', ','') + if(State <> '',State+', ','') + if(City <> '',City+', ','') + OrgAddr   // Почтовый адрес организации
  OrgOKPO     //Код ОКПО/ОКЮЛП организации
  OrgOKONH    //Код ОКОНХ/ОКВЭД организации
  OrgUNN
  CurrFormat
.EndFields
^                                                                                                                                    
 И                                                                                               УТВЕРЖДЕНО 
                                                                                               Постановление
                                                                                               Министерства статистики и анализа
                                                                                               Республики Беларусь 14.11.2006 № 177
                                                                                               (в редакции Постановления 
                                                                                               Министерства статистики и анализа
                                                                                               Республики Беларусь 11.10.2007 № 278)

                             ┌───────────────────────────────────────────────────────────┐
                             │         ГОСУДАРСТВЕННАЯ СТАТИСТИЧЕСКАЯ ОТЧЕТНОСТЬ         │
                             └───────────────────────────────────────────────────────────┘
                             ┌───────────────────────────────────────────────────────────┐
                             │  КОНФИДЕНЦИАЛЬНОСТЬ ГАРАНТИРУЕТСЯ ПОЛУЧАТЕЛЕМ ИНФОРМАЦИИ  │
                             └───────────────────────────────────────────────────────────┘
┌─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
│Представление искаженных данных государственной статистической отчетности, несвоевременное представление или непредставление     │
│такой отчетности влекут применение мер административной или уголовной ответственности в порядке, установленном законодательством │
│                                                     Республики Беларусь                                                         │
└─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
 Б                             ┌───────────────────────────────────────────────────────────┐
                             │                           ОТЧЕТ                           │
                             │           О НАЛИЧИИ И ДВИЖЕНИИ ОСНОВНЫХ СРЕДСТВ           │
                             │               И ДРУГИХ ВНЕОБОРОТНЫХ АКТИВОВ               │
                             │                        за @@@@ год                        │
                             └───────────────────────────────────────────────────────────┘ Б
┌─────────────────────────────────────────────────────────────────────────────┬──────────────────┐    ┌───────────────────────────┐
│                          Представляют респонденты:                          │Срок представления│    │ Форма 11                  │
├─────────────────────────────────────────────────────────────────────────────┼──────────────────┤    ├──────────────┬────────────┤
│юридические лица: коммерческие организации (кроме организаций, представляющих│ 25 марта         │    │ Код формы по │            │
│государственную статистическую отчетность по форме 1-МП) и некоммерческие    │                  │    │ ОКУД         │  0602006   │
│организации (кроме бюджетных организаций), осуществляющие производство       │                  │    └──────────────┴────────────┘
│продукции, работ, услуг для реализации, со среднесписочной численностью      │                  │       
│работников за год 16 человек и более;  обособленные подразделения указанных  │                  │    ┌───────────────────────────┐
│юридических лиц, имеющие отдельный баланс:                                   │                  │    │ Годовая                   │
│   органу государственной статистики (по указанию областного, Минского       │                  │    │                           │
│   городского управления статистики);                                        │                  │    └───────────────────────────┘
│   своей вышестоящей организации.                                            │                  │
└─────────────────────────────────────────────────────────────────────────────┴──────────────────┘ И
 И
┌────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
│ Наименование юридического лица в соответствии с уставом (положением) @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │
│                                                                                                                                    │
│ Наименование обособленного подразделения @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │  
│                                                                                                                                    │
│ Орган государственного управления (вышестоящая организация) @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │  
│                                                                                                                                    │
│ Основной вид деятельности ________________________________________________________________________________________________________ │
│                                                                                                                                    │
│ Почтовый адрес (фактический) @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │  
├───────────────────────────────────┬─────────────────┬──────────────────────────────────────────────────────────────────────────────┘  
│ Регистрационный номер респондента │  Учетный номер  │
├──────────────────┬────────────────┤  плательщика    │
│ в статистическом │     в ЕГР      │      (УНП)      │
│ регистре (ОКПО)  │    (ОКЮЛП)     │                 │
├──────────────────┼────────────────┼─────────────────┤
│        1         │       2        │        3        │
├──────────────────┼────────────────┼─────────────────┤
│@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@│
└──────────────────┴────────────────┴─────────────────┘ И






 И                                                            РАЗДЕЛ I
                                              НАЛИЧИЕ, ДВИЖЕНИЕ И СОСТАВ ОСНОВНЫХ СРЕДСТВ И
.{
.{
.[H OverWrite
.{?Internal; (wPodrazdel_1 < 2);
 Ш                                                                                                                                                                                                               (^)
  Б──────────────────────────────────────────┬──────┬─────────────────────────┬──────────────────────────────────────┬──────────────────────────────────────┬─────────────────────────┬────────────┬─────────────────────────
                                           │      │ Наличие на начало года  │      Поступило в отчетном году       │       Выбыло в отчетном году         │  Наличие на конец года  │            │Стоимость на конец года без
                                           │      ├────────────┬────────────┼────────────┬─────────────────────────┼────────────┬─────────────────────────┼────────────┬────────────┤   Сумма    │переоценки на конец года
                                           │      │            │            │            │         из них          │            │         из них          │            │            │амортизации,├────────────┬────────────
           Наименование показателя         │Номер │   перво-   │ остаточная │   всего    ├─────────────┬───────────┤    всего   ├────────────┬────────────┤ восстанови-│ остаточная │начисленная │            │
                                           │строки│ начальная  │ стоимость  │            │введено новых│ дооценка  │            │   ликви-   │   уценка   │  тельная   │ стоимость  │   за год   │   перво-   │ остаточная
                                           │      │ стоимость  │            │            │  основных   │ основных  │            │  дировано, │  основных  │ стоимость  │            │            │ начальная  │
                                           │      │            │            │            │   средств   │  средств  │            │   списано  │   средств  │            │            │            │            │
 ──────────────────────────────────────────┼──────┼────────────┼────────────┼────────────┼─────────────┼───────────┼────────────┼────────────┼────────────┼────────────┼────────────┼────────────┼────────────┼────────────
                    А                      │  Б   │     1      │      2     │     3      │      4      │     5     │     6      │     7      │      8     │     9      │     10     │     11     │     12     │     13
 ──────────────────────────────────────────┴──────┴────────────┴────────────┴────────────┴─────────────┴───────────┴────────────┴────────────┴────────────┴────────────┴────────────┴────────────┴────────────┴──────────── Б Ш
.}
.{?Internal; (wPodrazdel_1=4);
.{?Internal; (wTitleRazdel and 8) <> 8);
 И                                             СПРАВОЧНО 2 Р Ш
.}
.Fields
  CurrFormat
.EndFields
 И                                                                                                               (^)
 ───────────────────────────────────────────────┬────────────┬────────────────────────┬───────────────────────────────────
                                                │            │ Из графы 12 раздела I  │Из графы 3 раздела I сумма
              Наименование показателя           │Номер строки│первоначальная стоимость│капитальных вложений на обновление
                                                │            │                        │основных средств
 ───────────────────────────────────────────────┼────────────┼────────────────────────┼───────────────────────────────────
                       А                        │     Б      │            1           │                  2
 ───────────────────────────────────────────────┴────────────┴────────────────────────┴─────────────────────────────────── И
.}
.]H
.{?Internal; (wPodrazdel_1 < 2);
.begin
  ParseParamName(s1);
  N1 := 1;
end.
! Вывод предварительных подстрок
.{WHILE N1 < RowCnt
.Fields
  #NAIM_POK(N1,1)
.EndFields
 Ш @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
.begin
  N1 := N1 + 1;
end.
.}
! Вывод основной подстроки
.Fields
  #NAIM_POK(RowCnt,1)
  s2
  s20
  s25
! если "всего" выводим без переоценки на начало периода формы,
! то и дооценку/уценку уменьшаем на эту сумму
  s23
  s5
  if((double(s14)+double(s23)-double(s4)<>0), DoubleToStr(double(s14)+double(s23)-double(s4),SumFormat), '')
  s24
  s7
  if((double(s15)+double(s24)-double(s6)<>0), DoubleToStr(double(s15)+double(s24)-double(s6),SumFormat), '')
  s8
  s9
  s10
  s18
  s19
.EndFields
 Ш @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@ &#'&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&&& &#'&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&& Ш
.}
.{?Internal; (wPodrazdel_1 = 4);
.begin
  wTitleRazdel := wTitleRazdel OR 8;
  ParseParamName(s1);
  N1 := 1;
end.
! Вывод предварительных подстрок
.{WHILE N1 < RowCnt
.Fields
  #NAIM_POK(N1,1)
.EndFields
 И @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И
.begin
  N1 := N1 + 1;
end.
.}
! Вывод основной подстроки
.Fields
  #NAIM_POK(RowCnt,1)
  s2
.EndFields
 И @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@@@@@@@ И
.}
.}
.{?Internal; (wPodrazdel_1 < 2);
 Ш * Строка 100 заполняется только по указанию органов государственной статистики. Ш

.}
.{?Internal; (wPodrazdel_2 = 2);
 И                                             СПРАВОЧНО 1 И
.}
.Fields
  CurrFormat
.EndFields
.{
.[H OverWrite
.{?Internal; (wPodrazdel_2 = 2);
 И                                                                                  (^)
 ────────────────────────────────────────────┬────────────┬─────────────────┬─────────────────
             Наименование показателя         │Номер строки│За предыдущий год│За отчетный год
 ────────────────────────────────────────────┼────────────┼─────────────────┼─────────────────
                      А                      │     Б      │        1        │        2
 ────────────────────────────────────────────┴────────────┴─────────────────┴───────────────── И
.}
.]H
.{?Internal; (wPodrazdel_2 = 2);
.begin
  ParseParamName(sa);
  N1 := 1;
end.
! Вывод предварительных подстрок
.{WHILE N1 < RowCnt
.Fields
  #NAIM_POK(N1,1)
.EndFields
 И @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И
.begin
  N1 := N1 + 1;
end.
.}
! Вывод основной подстроки
.begin
  strNoneInfo := ''
  if (Trim(sb) = '410') OR (Trim(sb) = '420') OR (Trim(sb) = '421')
    strNoneInfo := 'X'
end.
.Fields
  #NAIM_POK(RowCnt,1)
  sb
  strNoneInfo
.EndFields
 И @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@@@@@@@ @~@@@@@@@@@@@@@@@ И
.}
.}

.Fields
  sa2
  sb2
  CurrFormat
.EndFields
.{
.{?Internal; (wPodrazdel_3 = 3);
 Ш @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (строка @@@) _______________ ^ Ш
.}
.}
.{?Internal; (wPodrazdel_3 = 3);

 И ─────────────
  * Строка 430 заполняется только по указанию органов государственной статистики. И

.}
.begin
  wTitleRazdel := wTitleRazdel and (not 8);
end.
.}

.EndForm

//
//**************************************************************************
.linkform 'Form11_2Bel' prototype is 'Form11'
.nameInList 'Наличие основных средств'
.group '2Bel'
.DEFO portrait
#include Form11fn.frn
end. // Вынес из Form11fn.frn, для того чтобы не появлялась лишняя строка
.Fields
CommonFormHeader

CurrFormat
.EndFields
^
 Ш                                              БРАЗДЕЛ II
                                        НАЛИЧИЕ ОСНОВНЫХ СРЕДСТВ Б
.{
.[H OverWrite
                                                                                                               (^)
  Б─────────────────────────────────────────────────────────────────────────────────────────┬──────┬───────────────────────────────────
                                                                                          │Номер │           На конец года
                           Наименование показателя                                        │строки├─────────────────┬─────────────────
                                                                                          │      │восстановительная│   остаточная
                                                                                          │      │    стоимость    │    стоимость
 ─────────────────────────────────────────────────────────────────────────────────────────┼──────┼─────────────────┼─────────────────
                                       А                                                  │  Б   │        1        │        2
 ─────────────────────────────────────────────────────────────────────────────────────────┴──────┴─────────────────┴───────────────── Б
.]H
.{
.begin
  ParseParamName(s1);
  N1 := 1;
end.
! Вывод предварительных подстрок
.{WHILE N1 < RowCnt
.Fields
  #NAIM_POK(N1,1)
.EndFields
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.begin
  N1 := N1 + 1;
end.
.}
! Вывод основной подстроки
.Fields
  #NAIM_POK(RowCnt,1)
  s2
  s3
  s6
.EndFields
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@ &#'&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&
.}
 ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

                                              БСПРАВОЧНО 3 Б
.Fields
  CurrFormat
.EndFields
.{
.[H OverWrite
                                                                                                               (^)
  Б───────────────────────────────────────────────────────────────────────────┬─────────────┬────────────────────┬─────────────────────
                            Наименование показателя                         │Номер строки │ За предыдущий год  │   За отчетный год
 ───────────────────────────────────────────────────────────────────────────┼─────────────┼────────────────────┼─────────────────────
                                     А                                      │      Б      │         1          │          2
 ───────────────────────────────────────────────────────────────────────────┴─────────────┴────────────────────┴───────────────────── Б
.]H
.begin
  ParseParamName(sa);
  N1 := 1;
end.
! Вывод предварительных подстрок
.{WHILE N1 < RowCnt
.Fields
  #NAIM_POK(N1,1)
.EndFields
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.begin
  N1 := N1 + 1;
end.
.}
! Вывод основной подстроки
.Fields
  #NAIM_POK(RowCnt,1)
  sb
.EndFields
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@@@@@@@
.}

  * Строка 510 заполняется только по указанию органов государственной статистики.
.{
.}
.}
 Ш
.EndForm

//**************************************************************************
.linkform 'Form11_5Bel_Old' prototype is 'Form11'
.nameInList 'Другие нефинансовые активы'
.group '5Bel'
.Hide
.Fields
  CommonFormHeader
  CurrFormat
  s1 s2 s3 s4
#ifdef GAL5_85
sGetTune('KatOrg.FldView.OKONH')
#endif
  CurrFormat
//  sa sb sc
.EndFields
^
 Ш                                              БРаздел II. Другие нефинансовые активы Б
 Ш.{
.{
.[H OverWrite
 Ш                                                                                                                               (^)
 ────────────────────────────────────────────┬──────┬────────────────────────────┬─────────────────────────────────────────────────────────
                                             │      │                            │                 На конец отчетного года
             Наименование показателя         │   N  │  На начало отчетного года  ├────────────────────────────┬────────────────────────────
                                             │строки│                            │       до переоценки        │       после переоценки
 ────────────────────────────────────────────┼──────┼────────────────────────────┼────────────────────────────┼────────────────────────────
                      А                      │  Б   │              1             │             2              │              3
 ────────────────────────────────────────────┴──────┴────────────────────────────┴────────────────────────────┴────────────────────────────
 Ш.]H
 Ш @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@     &#'&&&&&&&&&&&&&&&&&&        &#'&&&&&&&&&&&&&&&&&& Ш
.}

.{
.}
 Ш ──────────────────────────────────────────────────────────┬───────┬────────────────────────────────┬──────────────────────────────────────
#ifdef GAL5_85
                         Справочно                         │   N   │         Код по @@@@@           │           Выручка, ^
#else
                         Справочно                         │   N   │         Код по ОКОНХ           │           Выручка, ^
#endif
                                                           │строки │                                │
 ──────────────────────────────────────────────────────────┴───────┴────────────────────────────────┴──────────────────────────────────────
 Выручка за отчетный год от реализации продукции, товаров,   507
 работ, услуг - всего по организации
                       в том числе:
 по основному виду деятельности                              508
 по другим видам деятельности (неосновным), занимающим наи-
 большие доли в общем объеме выручки:
 1._________________________________________________________ 509
 2._________________________________________________________ 510
 3._________________________________________________________ 511
              (название вида деятельности)
 Списочная численность работников организации на конец года  512   ______________ человек Ш
.{
.} Ш

 Р   Руководитель  организации                        __________________ _____________
                                                         (Ф.И.О.)        (подпись)

   Должностное лицо, ответственное
   за составление отчета            _______________ __________________ _____________
                                      (должность)        (Ф.И.О.)        (подпись)


    __________________________              "____" ____________________ 20__ год
   (номер контактного телефона)             (дата составления документа) И

.}
.EndForm

.linkform 'Form11_5Bel' prototype is 'Form11'
.nameInList 'Другие внеоборотные активы'
.group '5Bel'
.Fields
  CommonFormHeader
  CurrFormat
  s1 s2 s3 s18 s4
  // стоимость на конец года с учетом всех дооценок/уценок за период
  //if ( (Double(s4) - Double(s14) + Double(s15) <> 0)
  //   , DoubleToStr(Double(s4) - Double(s14) + Double(s15),SumFormat)
  //   , '')
.EndFields
^
 Ш                                              БРаздел III.
                                        Другие внеоборотные активы Б Ш
.{
.{
.[H OverWrite
 Ш                                                                                                                               (^)
 ────────────────────────────────────────────┬──────┬────────────────────────────┬─────────────────────────────────────────────────────────
                                             │      │                            │                 На конец отчетного года
             Наименование показателя         │Номер │  На начало отчетного года  ├────────────────────────────┬────────────────────────────
                                             │строки│                            │       до переоценки        │       после переоценки
 ────────────────────────────────────────────┼──────┼────────────────────────────┼────────────────────────────┼────────────────────────────
                      А                      │  Б   │              1             │             2              │              3
 ────────────────────────────────────────────┴──────┴────────────────────────────┴────────────────────────────┴────────────────────────────
 Ш.]H
 Ш @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@     &#'&&&&&&&&&&&&&&&&&&&&      &#'&&&&&&&&&&&&&&&&&&&&   &#'&&&&&&&&&&&&&&&&&&&&& Ш
.}

.{
.}
.{
.}

 Р   Руководитель юридического лица,
   обособленного подразделения                        __________________                       ___________________
   (нужное подчеркнуть)                                    (подпись)                           (инициалы, фамилия)

   Главный бухгалтер                                  __________________                       ___________________
                                                           (подпись)                           (инициалы, фамилия)
   Лицо, ответственное
   за составление государственной
   статистической отчетности         _______________  __________________                       ___________________
                                       (должность)         (подпись)                           (инициалы, фамилия)


    __________________________                       "____" ____________________ 200_ г.
   (номер контактного телефона)                      (дата составления государственной
                                                      статистической отчетности) И

.}
.EndForm
#else
#include Form11Os_Bel.frn
#end // __form11_Belarus__

//#include form11osk.frn
//
#ifdef __Form11_do_02092006_N32_g__
! ------------------------------------------------------------
! Линк-формы ведомости для Казахстана
! ------------------------------------------------------------
//**************************************************************************
.linkform 'Form11_1K' prototype is 'Form11'
.nameInList 'Наличие, движение и состав основных средств'
.group '1K'
.DEFO LANDSCAPE
.P 60
.var
NameAddr : string
NameAddr1 : string
.endvar
.begin
NameAddr := OrgName+', '+  // Наименование организации
            if(IndexK<>'',IndexK+', ','')+if(State <> '',State+', ','')+if(City <> '',City+', ','')+OrgAddr;
NameAddr1 :=GroupWrap(NameAddr,1,36);
end.
.Fields
CommonFormHeader
  NameAddr1
  Trim(SubStr(NameAddr,length(NameAddr1)+1,length(NameAddr)-length(NameAddr1)))
  OrgOKPO     //Код ОКПО/ОКЮЛП организации

!.{
 CurrFormat
 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10 s11
!.}
 if(sb = '070',if( double(sv) <> 0 , DoubleToStr(double(sv),SumFormat),'') ,//для 70 строки считается 21 сумма
    if( sb = '071', if( double(sw) <> 0, DoubleToStr(double(sw),SumFormat),''),//для 71 строки считается 22 сумма
      if ( double(sc) <> 0 , DoubleToStr(double(sc),SumFormat),'')))
 sa sb CurrFormat

.EndFields
 И^
                                                                                  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Конфиденциальность гарантируется получателем информации       Кем представляется_____________________________________
                                                                                        наименование, адрес
                                                               @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                                                               _______________________________________________________


 - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
                                         линия отрыва адресной части



  ЙГОСУДАРСТВЕННАЯ СТАТИСТИЧЕСКАЯ ОТЧЕТНОСТЬ Й                                                             ЙФОРМА № 11 (ГОДОВАЯ) Й
 Представляется в соответствии с Законом Республики Казахстан "О государственной статистике" -
 областному, городскому, районному (нужное подчеркнуть) статистическому органу по месту нахождения респондента
 Утверждена приказом Агенства Республики Казахстан по статистике от 2 июля 2001 № 28-С
 Представляют юридические лица, их филиалы и представительства со списочной численностью работников свыше 50 человек;
 государственные учреждения, организации здравоохранения и образования, банки, страховые и общественные организации независимо от
 численности работников 5 апреля после отчетного года.

  ЙОТЧЕТ О НАЛИЧИИ И ДВИЖЕНИИ ОСНОВНЫХ СРЕДСТВ НЕМАТЕРИАЛЬНЫХ АКТИВОВ ЗА _____ ГОД Й
                                                                                                    ┌───────────┐  ┌──────────┐
                                                                                                    │  0606504  │  │ @@@@@@@@ │
                                                                                                    │           │  │          │
                                                                                                    │   ОКУД    │  │   ОКПО   │
                                                                                                    └───────────┘  └──────────┘
                                                  I. Наличие, движение и состав основных средств И
.{


.{
.[H OverWrite И
 С                                                                                                                                                                                                                         ^ Щ
 Щ ───────────────────────────────────────────┬──────┬─────────────┬────────────────────────────────────────────────┬────────────────────────────────────────────────────────────┬────────────┬────────────┬───────────┬───────────
                                            │      │             │             Поступило в отчетном году          │                     Выбыло  в отчетном году                │            │            │           │
                                            │      │ Наличие на  ├────────────┬───────────────────────────────────┼────────────┬───────────────────────────────────────────────┤  Наличие   │            │  Износ    │ Износ по
                                            │      │ начало года │            │               из них:             │            │                     из них:                   │ на конец   │  Наличие   │ основных  │ списанным
                                            │ Код  │ по первона- │            ├───────────┬───────────┬───────────┤            ├───────────┬───────────┬───────────┬───────────┤ года по    │ на конец   │  средств  │ основным
             Наименование показателей       │строки│ чальной     │            │ введено в │           │  за счет  │            │  ликвиди- │           │           │  за счет  │ первона-   │ года по    │  за год   │ средствам
                                            │      │ (текущей)   │            │  действие │   за счет │стоимостных│            │  ровано   │  из них в │   за счет │стоимостных│ чальной    │балансовой  │ (включая  │
                                            │      │ стоимости   │   всего    │   новых   │ индексации│изменений, │   всего    │  (списано)│ результате│ индексации│изменений, │ (текущей   │(за вычетом │   жилые   │
                                            │      │             │            │ основных  │           │вызванных  │            │  основных │ чрезвычай-│           │вызванных  │ стоимости  │  износа)   │  здания)  │
                                            │      │             │            │  средств  │           │колебанием │            │   средств │ ных       │           │колебанием │ (гр.1+гр.2 │ стоимости  │           │
                                            │      │             │            │           │           │цен, курсов│            │           │ ситуаций  │           │цен, курсов│   -гр.6    │            │           │
                                            │      │             │            │           │           │  валюты   │            │           │           │           │  валюты   │            │            │           │
 ───────────────────────────────────────────┼──────┼─────────────┼────────────┼───────────┼───────────┼───────────┼────────────┼───────────┼───────────┼───────────┼───────────┼────────────┼────────────┼───────────┼───────────
                      А                     │  Б   │      1      │      2     │     3     │     4     │     5     │      6     │      7    │      8    │      9    │    10     │    11      │    12      │     13    │    14
 ───────────────────────────────────────────┴──────┴─────────────┴────────────┴───────────┴───────────┴───────────┴────────────┴───────────┴───────────┴───────────┴───────────┴────────────┴────────────┴───────────┴─────────── Щ
.]H
 Щ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@ &#'&&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&&                         &#'&&&&&&&&& &#'&&&&&&&&                                     &#'&&&&&&&&& &#'&&&&&&&&& &#'&&&&&&&& &#'&&&&&&&& Щ

.}
 ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────


.{
 Щ                                                                                               &#'&&&&&&&&&&&& Щ
 Щ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (@@@) ─────────────── ^ Щ
.}
.{
.}
.}
 Ш  ") - вписывается соответствующее наименование вида экономической деятельности и его код из "Перечня видов экономической деятельности", приведенного в конце формы. Ш
.EndForm Ц

 Ц

//
//**************************************************************************
.linkform 'Form11_2K' prototype is 'Form11'
.nameInList 'Дополнительные показатели по основным средствам'
.group '2K'
.defo portrait
.Fields
CommonFormHeader


!.{
 CurrFormat
 s1 s2 s3
!.}

.EndFields
^
 И            II.Дополнительные показатели по основным средствам И
.{
.[H OverWrite
 Щ                                                                                                                       ^ Щ
 Ш ─────────────────────────────────────────────────────────────────────────────────────────┬────────┬───────────────────────────
                                                                                          │        │    Наличие на конец
                           Наименование показателей                                       │  Код   │    отчетного года по
                                                                                          │ строки │ первоначальной(текущей)
                                                                                          │        │        стоимости
 ─────────────────────────────────────────────────────────────────────────────────────────┼────────┼───────────────────────────
                                       А                                                  │    Б   │             1
 ─────────────────────────────────────────────────────────────────────────────────────────┴────────┴─────────────────────────── Ш
.]H

.{
 Ш @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  @~@@@@@   &#'&&&&&&&&&&&&&&&&&&&&&& Ш
.}
 Щ ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Щ
.{
.}
.{
.}
.}

 Ш ")Строки 184, 185, 186, 191, 193 и 196 заполняют только субьекты, занимающиеся производством сельскохозяйственной продукции и
 обслуживанием сельского хозяйства
 1) включая бывшие в употребелнии Ш
.EndForm

//
//**************************************************************************
.linkform 'Form11_3K' prototype is 'Form11'
.nameInList 'Амортизация и затраты на ремонт основных средств'
.group '3K'
.defo portrait
.P 60
.Fields
CommonFormHeader


!.{
 CurrFormat
 s1 s2 s6 s3 s4  s9
!.}

.EndFields
^
                 ЙIII.Амортизация и затраты на ремонт основных средств Й
.{
.[H OverWrite
 Щ                                                                                                                                        ^        Щ
 Щ ────────────────────────────────────────────────────────┬──────┬───────────────┬────────────────────────────────┬──────────────────────────────
                                                         │      │               │ Основные средства (из гр.11,   │
                                                         │      │               │    раздела I), по которым      │      Затраты на ремонт
                                                         │ Код  │    Сумма      │   амортизация не начисляется   │           за год:
                Наименование показателей                 │строки│  амортизации, │   по состоянию на конец года   │
                                                         │      │  начисленной  ├───────────────┬────────────────┼───────────────┬──────────────
                                                         │      │  за год       │               │из них полностью│               │   из них на
                                                         │      │               │     всего     │амортизированные│     всего     │  капитальный
                                                         │      │               │               │ (изношенные)   │               │    ремонт
 ────────────────────────────────────────────────────────┼──────┼───────────────┼───────────────┼────────────────┼───────────────┼──────────────
                            А                            │  Б   │       1       │        2      │       3        │        4      │       5
 ────────────────────────────────────────────────────────┴──────┴───────────────┴───────────────┴────────────────┴───────────────┴────────────── Щ
.]H

.{
 Щ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@ &#'&&&&&&&&&&&& &#'&&&&&&&&&&&& &#'&&&&&&&&&&&&& &#'&&&&&&&&&&&&                 Щ
.}
 Щ ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Щ
.{
.}
.{
.}
.}

.EndForm


//
//**************************************************************************
.linkform 'Form11_4K' prototype is 'Form11'
.nameInList 'Среднегодовая стоимость основных средств'
.group '4K'
.defo portrait
.Fields
CommonFormHeader


!.{
 CurrFormat
 s1 s2 s3
!.}
.EndFields
^
  Й  IV.Среднегодовая стоимость основных средств Й

.{
.[H OverWrite
  Щ                                                                       ^
 ───────────────────────────────────────────────────────┬──────┬──────────────────
                                                        │ Код  │        За
               Наименование показателей                 │строки│     отчетный
                                                        │      │        год
 ───────────────────────────────────────────────────────┼──────┼──────────────────
                          А                             │  Б   │         1
 ───────────────────────────────────────────────────────┴──────┴────────────────── Щ
.]H

.{
 Щ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@ &#'&&&&&&&&&&&&&& Щ
.}
 Щ ───────────────────────────────────────────────────────────────────────────────── Щ
.{
.}
.{
.}
.}

.EndForm


//
//**************************************************************************
.linkform 'Form11_5K' prototype is 'Form11'
.nameInList 'Нематериальные активы'
.group '5K'
.DEFO LANDSCAPE
.P 60
.Fields
CommonFormHeader


!.{
 CurrFormat
 s1
 s2
 s3 s4 s6 s8 s10
!.}
!.{
!.}
!.{
 sc sa sb  if( (sb = '414'), 'человек', CurrFormat)
!.}
.EndFields
^
                                      ЙV.Нематериальные активы Й
.{
.[H OverWrite
  Щ                                                                                                                                                                                  ^
 ───────────────────────────────────────────────────────────────────┬──────┬─────────────────────────────────────────────────────────────────────────────────────────────────┬───────────────
                                                                    │      │                                         Первоначальная стоимость                                │
                                                                    │ Код  ├─────────────┬─────────────┬─────────────┬─────────────┬───────────────────────────┬─────────────┤   Сумма
                       Наименование показателей                     │строки│   Начало    │  Поступило  │   из них    │   выбыло в  │          из них:          │  на конец   │ амортизации
                                                                    │      │  отчетного  │  в отчетном │   за счет   │   отчетном  ├─────────────┬─────────────┤    года     │ нематериаль-
                                                                    │      │    года     │    году     │    индек-   │     году    │в результате │   за счет   │  (гр.1+гр.2 │ ных активов
                                                                    │      │             │             │    сации    │             │чрезвычайных │  индексации │    -гр.4)   │    за год
                                                                    │      │             │             │             │             │обстоятельств│             │             │
                                                                    │      │             │             │             │             │             │             │             │
 ───────────────────────────────────────────────────────────────────┼──────┼─────────────┼─────────────┼─────────────┼─────────────┼─────────────┼─────────────┼─────────────┼───────────────
                                   А                                │  Б   │      1      │       2     │       3     │      4      │      5      │      6      │      7      │       8
 ───────────────────────────────────────────────────────────────────┴──────┴─────────────┴─────────────┴─────────────┴─────────────┴─────────────┴─────────────┴─────────────┴─────────────── Щ
.]H

.{
 Щ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@ &#'&&&&&&&&&& &#'&&&&&&&&&&               &#'&&&&&&&&&&                             &#'&&&&&&&&&& &#'&&&&&&&&&&&& Щ
.}
 Щ ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Щ

.{
 Щ                                                                                                                                                                   &#'&&&&&&&&&&&&
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (@@@) ─────────────── ^ Щ
.}
 Щ
 Руководитель _______________________________________


 Главный бухгалтер __________________________________

 "______" _________________________________ 200___ г.

 ____________________________________________________
           фамилия и N телефона исполнителя Щ
.{
.}
.}

.EndForm
#else
#include form11os_kz.frn
#end
