//-----------------------------------------------------------------------------------
//                                                           (c) корпорация ГАЛАКТИКА
// Галактика 5.85 - Касса
// Расшифровка авансовых документов
//-----------------------------------------------------------------------------------

#doc
Расшифровка авансовых документов.<br>
Внимание! Существует slk-отчет в формате Excel.<br>
#end
.set name='ReeAO'
.hide
.fields
  header                // название отчета
  dates //:date         // с ____ по _____

  LevelName:string:'t:r'// наименование группировки (период, подразделение, сотрудник, валюта, страна, город, норма расходов)
  LevelSum              // сумма на уровне узлов
  LevelVal              // символ валюты узла
  LevelSumPrev          // сумма превышения нормы расходов в нац. валюте на уровне узлов
  LevelSumUcht          // сумма превышения нормы расходов учтённая в зарплате в нац. валюте на уровне узлов

  //Perf_Number           // номер в отчете по порядку
  AvOt_nRec             // PlPor.nRec (AO)
  Norm_nRec             // RashDoc.nRec (Норма расходов)
  Norm_NoAO             // номер авансового отчёта
  Norm_Date :date       // дата обработки
  Norm_Name:string:'t:r'// наименование нормы расходов
  Norm_Sum              // сумма по норме расходов
  Norm_Val              // символ валюты нормы
  Norm_SumPrev          // сумма превышения нормы расходов в нац. валюте
  Norm_SumUcht          // сумма превышения нормы расходов учтённая в зарплате в нац. валюте

  //Norm_SumTotal         // всего сумма по спецификации


.endfields
! Подкачка Excel форматов
! Эта строчка нужна пока не будет решена 102.31867
//#include ExcelFormat.frn // Пока не нужен!!!!!!!!!!!!!!!!!!!!!!!
 ^
 ^
.{
.{ AOPlp_Header CheckEnter
 ^ ^ ^ ^ ^
.}
.{ AOPlp_Body CheckEnter
 ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.{ AOPlp_Footer CheckEnter
! //^
.}
.}

.endform

//*******************************************************************
.linkform 'ReeAO01' prototype is 'ReeAO'
.nameinlist 'Расшифровка авансовых документов'
.p 80
.defo portrait//landscape
.fields
CommonFormHeader
 header
 dates //if ( Longint(dates) = 0, '', DateToStr(dates, 'DD/MM/YYYY'))

 LevelName:'t:r'
 LevelSum
 LevelVal

 Norm_NoAO
 if ( Longint(Norm_Date) = 0, '', DateToStr(Norm_Date, 'DD/MM/YYYY'))
 Norm_Name:'t:r'
 Norm_Sum
 Norm_Val
 
! //Norm_SumTotal
.endfields
 Ш^ Ш
 С                                  @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                                              @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ С
.{
.[H
 Р                                                                                                                     лист @np@
─────────┬───────────┬───────────────────────────────────────────────────────────────────────────┬──────────────────────┬────────
  Номер  │   Дата    │                               Наименование                                │        Сумма         │ Валюта
  док-та │ обработки │                              нормы расходов                               │                      │
─────────┴───────────┴───────────────────────────────────────────────────────────────────────────┴──────────────────────┴────────
.]H                                                                           
.{ AOPlp_Header CheckEnter                                                    
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&&.&&  @@@@@@ Б
.}                                                                            
.{ AOPlp_Body CheckEnter                                                      
@@@@@@@@  @@@@@@@@@@  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&&.&&  @@@@@@
.}                                                                            
.{ AOPlp_Footer CheckEnter                                                    
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
!                                                                                                   &'&&&&&&&&&&&&&&&&.&&
.}
.} Р
.endform

//*******************************************************************
.linkform 'ReeAO02' prototype is 'ReeAO'
.nameinlist 'Расшифровка превышенных сумм норм расходов и учтённых в зарплате'
.p 80
.defo portrait//landscape
.fields
CommonFormHeader
 //header
 dates //if ( Longint(dates) = 0, '', DateToStr(dates, 'DD/MM/YYYY'))

 LevelName:'t:r'
 LevelSum
 LevelVal
 LevelSumPrev
 LevelSumUcht

 Norm_NoAO
 if ( Longint(Norm_Date) = 0, '', DateToStr(Norm_Date, 'DD/MM/YYYY'))
 Norm_Name:'t:r'
 Norm_Sum
 Norm_Val
 Norm_SumPrev
 Norm_SumUcht

! //Norm_SumTotal
.endfields
 Ш^ Ш
 С                                     Нормы расходов превышенные и учтённые в зарплате
                                              @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ С
.{
.[H
 Р                                                                                                                          лист @np@
─────────┬───────────┬────────────────────────────────────────────────────┬────────────────┬────────┬────────────────┬────────────────
  Номер  │   Дата    │                    Наименование                    │     Сумма      │ Валюта │    Превышено   │    Учтено
  док-та │ обработки │                   нормы расходов                   │                │        │                │
─────────┴───────────┴────────────────────────────────────────────────────┴────────────────┴────────┴────────────────┴────────────────
.]H                                                         
.{ AOPlp_Header CheckEnter                                  
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&.&&  @@@@@@  &'&&&&&&&&&&.&&  &'&&&&&&&&&&.&& Б
.}                                                          
.{ AOPlp_Body CheckEnter                                    
@@@@@@@@  @@@@@@@@@@  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&.&&  @@@@@@  &'&&&&&&&&&&.&&  &'&&&&&&&&&&.&&
.}                                                          
.{ AOPlp_Footer CheckEnter                                  
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
!                                                                            &'&&&&&&&&&&.&&
.}
.} Р
.endform
   
