/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 2000, 2001 корпорация ГАЛАКТИКА                   ║
 ║ Проект        : УКС - Управление капитальным строительством               ║
 ║ Версия        : 5.80                                                      ║
 ║ Назначение    : Каталог сметных разделов капитального строительства       ║
 ║ Ответственный : Окуневич Руслан Васильевич                                ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/

#doc
Каталог сметных разделов капитального строительства
#end
.Form 'KatSmet'
.NameInList 'Каталог сметных разделов'
.Fields
  код
  название
.Endfields
             Каталог сметных разделов
──────────────────────┬────────────────────────────────────────────────────────
 Код                  │ Название
──────────────────────┴────────────────────────────────────────────────────────
.{
 @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.endform
