//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 6.00 - Основные средства
// Печать ведомости движения драгметаллов по ОС (UIN 4716)
//------------------------------------------------------------------------------

#doc
Печать ведомости движения драгметаллов по основным средствам
#end

.Form 'MoveDrag'
.Hide
.Fields
Субъект_отчета_кратко
Субъект_отчета_имен
Субъект_отчета_родит
Субъект_отчета_дат
UserDeskRep_NRec : Comp
Организация_nRec : comp
Наименование_организации
ОКПО
Подразделение_nRec : comp
Подразделение
Метод_nRec : comp
Метод
Делитель : Double
Ф_делитель
Делитель_прописью
Формат
Валюта_метода_nRec : comp
Валюта_метода
Группировка
Сортировка
ДатаС  : Date
ДатаПо : Date
!---------------- FilterOS
Фильтр
!---------------- GruppaOS
Head_TempDescr_NRec : Comp
Head_TempDescr_TableCode : word // код таблицы по которой постоена данная группировка
Head_TempDescr_CRecKat   : comp // номер записи в таблице по которой построена группировка
Ветка
NeedSum1 : Boolean
Итого_верх_начало       : Double
Итого_верх_приход_внеш  : Double
Итого_верх_приход_внутр : Double
Итого_верх_расход_внутр : Double
Итого_верх_расход_внеш  : Double
Итого_верх_конец        : Double
!---------------- NameOS
Номер_по_порядку : LongInt
Body_TempDescr_NRec : Comp
Тело
Body_Tobot_NRec : Comp
Начало       : Double
Приход_внеш  : Double
Приход_внутр : Double
Расход_внутр : Double
Расход_внеш  : Double
Конец        : Double
!---------------- ItogOS
Tail_TempDescr_NRec : Comp
Tail_TempDescr_TableCode : word // код таблицы по которой постоена данная группировка
Tail_TempDescr_CRecKat   : comp // номер записи в таблице по которой построена группировка
Итого
Итого_начало       : Double
Итого_приход_внеш  : Double
Итого_приход_внутр : Double
Итого_расход_внутр : Double
Итого_расход_внеш  : Double
Итого_конец        : Double
.EndFields
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.{ CheckEnter FilterOS4
^
.}
.{
.{ CheckEnter GruppaOS4
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.{ CheckEnter NameOS4
^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.{ CheckEnter ItogOS4
^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.}
.EndForm

!=============================================================================
.LinkForm 'MoveDrag_01' Prototype is 'MoveDrag'
!=============================================================================
.NameInList 'Ведомость движения драгметаллов в ОС'
.p 60
.defo landscape
.Fields
CommonFormHeader
if (longint(ДатаС)<>0,DateToStr(ДатаС,  'DD/MM/YYYY'),'')
if (longint(ДатаПо)<>0,DateToStr(ДатаПо, 'DD/MM/YYYY'),'')
Метод
Ф_делитель
Делитель_прописью
Группировка
Сортировка
!---------------- FilterOS
Фильтр
!---------------- GruppaOS
Ветка
if ( NeedSum1, Trim(DoubleToStr(Итого_верх_начало,       Формат)), '')
if ( NeedSum1, Trim(DoubleToStr(Итого_верх_приход_внеш,  Формат)), '')
if ( NeedSum1, Trim(DoubleToStr(Итого_верх_приход_внутр, Формат)), '')
if ( NeedSum1, Trim(DoubleToStr(Итого_верх_расход_внутр, Формат)), '')
if ( NeedSum1, Trim(DoubleToStr(Итого_верх_расход_внеш,  Формат)), '')
if ( NeedSum1, Trim(DoubleToStr(Итого_верх_конец,        Формат)), '')
!---------------- NameOS
Тело
Trim(DoubleToStr(Начало,       Формат))
Trim(DoubleToStr(Приход_внеш,  Формат))
Trim(DoubleToStr(Приход_внутр, Формат))
Trim(DoubleToStr(Расход_внутр, Формат))
Trim(DoubleToStr(Расход_внеш,  Формат))
Trim(DoubleToStr(Конец,        Формат))
!---------------- ItogOS
Итого
Trim(DoubleToStr(Итого_начало,       Формат))
Trim(DoubleToStr(Итого_приход_внеш,  Формат))
Trim(DoubleToStr(Итого_приход_внутр, Формат))
Trim(DoubleToStr(Итого_расход_внутр, Формат))
Trim(DoubleToStr(Итого_расход_внеш,  Формат))
Trim(DoubleToStr(Итого_конец,        Формат))
.EndFields
 Р.[h
                                                              Лист @Np@
.]h
^

                                 ВЕДОМОСТЬ ДВИЖЕНИЯ ДРАГМЕТАЛЛОВ В ОСНОВНЫХ СРЕДСТВАХ
                                            c @@@@@@@@@@@ по @@@@@@@@@@@

Метод:                ^
Весовая единица:      ^ (^) грамм
Группировка:          ^
Сортировка:           ^
Фильтры:
.{ CheckEnter FilterOS4
 ^
.}
.{
.[h
──────────────────────────────────────────────────┬────────────────────┬────────────────────┬────────────────────┬────────────────────┬────────────────────┬────────────────────
                   Наименование                   │ Остаток на начало  │   Приход внешний   │ Приход внутренний  │ Расход внутренний  │   Расход внешний   │  Остаток на конец
──────────────────────────────────────────────────┴────────────────────┴────────────────────┴────────────────────┴────────────────────┴────────────────────┴────────────────────
.]h
.{ CheckEnter GruppaOS4
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б &&&&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&&&
.}
.{ CheckEnter NameOS4
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &&&&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&&&
.}
.{ CheckEnter ItogOS4
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б &&&&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&&&
.}
.}


Бухгалтер

Ответственный за выпуск Р
.EndForm
