//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 6.00 - Основные средства
// Печать ведомости наличия драгметаллов по ОС (UIN 4701)
//------------------------------------------------------------------------------

#include Commission.frn // комиссии

#doc
Печать ведомости наличия драгметаллов по основным средствам
#end

.Form 'NalDrag'
.Hide
!.Group '<<Общие>>'
!.Group '<<Россия>>'
!.Group '<<Беларусь>>'
.Fields
UserDeskRep_NRec : Comp
Организация_nRec : comp
Наименование_организации
ОКПО
Подразделение_nRec : comp
Подразделение
Метод_nRec : comp
Метод
Делитель : Double
Ф_делитель
Делитель_прописью
Формат
Валюта_метода_nRec : comp
Валюта_метода
Группировка
Сортировка
Дата : Date //сюда передается последний день месяца, отчет за который мы хотим получить

Наим_колонка_1
Наим_колонка_2
Наим_колонка_3
Наим_колонка_4

#CommissionFields

!---------------- FilterOS5
Фильтр
!---------------- HeadCreator
Наим_колонка
!---------------- GruppaOS5
Head_TempDescr_NRec : Comp
Head_TempDescr_TableCode : word // код таблицы по которой постоена данная группировка
Head_TempDescr_CRecKat   : comp // номер записи в таблице по которой построена группировка
Ветка
NeedSum1 : Boolean
Итого_верх_вес   : Double
//'------------- Доп.информация по карточке
NeedDopInf : Byte  //0-не выводится, 1-ОС, 2-МБП
NeedPrintAsLeaf : Boolean   //true - выводится как лист (строка), false - как ветвь (группировка)
Верх_Object_NRec : Comp
Верх_KatOS_cHigherOS : Comp
Верх_KatOS_IsLeaf : Word
Верх_ArcIznos_nRec : comp
Верх_SpKatOs_nRec : comp
Верх_ИнвНомер
Верх_Наименование
Верх_Количество : Double
Верх_Стоимость : Double
Верх_Износ_весь : Double
Верх_Износ_мес : Double
Верх_Остаточная : Double
Верх_Стоимость_поступления : Double
Верх_Износ_поступления : Double
Верх_Номер_паспорта
Верх_Регистрационный_номер
Верх_Заводской_номер
Верх_Изготовитель
Верх_Модель
Верх_Номенклатурный_номер
Верх_Код_партии
Верх_Дата_гарантии : Date
Верх_Дата_выпуска : Date
Верх_Дата_ввода : Date
Верх_Дата_поступления : Date
Верх_Дата_выбытия : Date
Верх_Срок_использования : Double
Верх_Код_нормы_nRec : comp
Верх_Код_нормы
Верх_Наименование_нормы
Верх_Норма : Double
Верх_Алгоритм_nRec : comp
Верх_Алгоритм
Верх_ОКОФ_nRec : comp
Верх_Код_ОКОФ
Верх_Наименование_ОКОФ
Верх_Группа_nRec : comp
Верх_Код_группы
Верх_Наименование_группы
Верх_Вид_nRec : comp
Верх_Код_вида
Верх_Наименование_вида
Верх_Поправочный_коеффициент : Double
Верх_Признак_исп_nRec : comp
Верх_Код_признака_исп
Верх_Наименование_признака_исп
Верх_Признак_исп : Word
Верх_Подразделение_nRec : comp
Верх_Код_подразделения
Верх_Наименование_подразделения
Верх_МОЛ_nRec : comp
Верх_Код_МОЛ
Верх_Наименование_МОЛ
Верх_ТХО_nRec : comp
Верх_ТХО
Верх_Тип_nRec : comp
Верх_Тип
Верх_предп_срок_списания : Date
Верх_KatMC_NRec : Comp
Верх_KatEd_NRec : Comp
Верх_ЕдИзм_Наим
Верх_ЕдИзм_Дискрет
Верх_ЕдИзм_Сокр_Наим
Верх_KatEdIk_NRec : comp
Верх_ЕдИзмИк_Наим
Верх_ЕдИзмИк_Код
//'---------------- Колонки для спец.ведомостей (ИНВ-8а)
NeedSum2 : Boolean
Итого_верх_вес_1 : Double
Итого_верх_вес_2 : Double
Итого_верх_вес_3 : Double
Итого_верх_вес_4 : Double
Итого_верх_вес_1_Комиссионно : Double
Итого_верх_вес_2_Комиссионно : Double
Итого_верх_вес_3_Комиссионно : Double
Итого_верх_вес_4_Комиссионно : Double
!---------------- DM_Data
Итого_верх_вес_i : Double
Итого_верх_вес_i_Комиссионно : Double
!---------------- NameOS5
Номер_по_порядку : LongInt
Body_TempDescr_NRec : Comp
Тело
nRec_Tobot : comp
Вес : Double
KatDrag_NRec : Comp
Драгмет_код
Драгмет_наим
СпособОпред : Word
KatDrag_cPodr : Comp
KatDrag_IsLeaf : Word
KarDrag_cKatEd : Comp
ЕдИзм_наим
ЕдИзм_дискр : Word
ЕдИзм_сокр_наим
!---------------- ItogOS
Tail_TempDescr_NRec : Comp
Tail_TempDescr_TableCode : word // код таблицы по которой постоена данная группировка
Tail_TempDescr_CRecKat   : comp // номер записи в таблице по которой построена группировка
Итого
Итого_вес   : Double
Итого_вес_1 : Double
Итого_вес_2 : Double
Итого_вес_3 : Double
Итого_вес_4 : Double
Итого_вес_1_Комиссионно : Double
Итого_вес_2_Комиссионно : Double
Итого_вес_3_Комиссионно : Double
Итого_вес_4_Комиссионно : Double
!---------------- DM_Itog
Итого_вес_i : Double
Итого_вес_i_Комиссионно : Double
.EndFields
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^

^ ^ ^ ^

#CommissionBody(NalDrag)

.{ CheckEnter FilterOS5
^
.}
.{ CheckEnter HeadCreator
^
.}
.{
.{ CheckEnter GruppaOS5
^ ^ ^ ^ ^ ^
! ----- Доп.информация по карточке 3x20 + 8
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^
! ----- Колонки для спец.ведомостей (ИНВ-8а)
^ ^ ^ ^ ^ ^ ^ ^ ^
.{ CheckEnter DM_Data
 ^ ^
.}
.}
.{ CheckEnter NameOS5
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.{ CheckEnter ItogOS5
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.{ CheckEnter DM_Itog
^ ^
.}
.}
.}
.EndForm

!=============================================================================
.LinkForm 'NalDrag_01' Prototype is 'NalDrag'
!=============================================================================
.NameInList 'Ведомость наличия драгметаллов'
.p 60
.Group '<<Общие>>'
.defo portrait
#CommissionLinkVar
 Р.[h
                                                              Лист @Np@
.]h
#CommissionLinkInit(NalDrag)
.Fields
CommonFormHeader
if (longint(Дата)<>0,DateToStr(Дата, 'DD/MM/YYYY'),'')
Метод
Ф_делитель
Делитель_прописью
Группировка
Сортировка
!---------------- FilterOS
Фильтр
!---------------- GruppaOS
Ветка
if ( NeedSum1, Trim(DoubleToStr(Итого_верх_вес, Формат)), '')
!---------------- NameOS5
ДрагМет_наим
ДрагМет_код
Trim(DoubleToStr(Вес, Формат))
Trim(SubStr( if ((СпособОпред AND 1) = 1, ', Паспорт', '')
           + if ((СпособОпред AND 2) = 2, ', Комиссионно','')
           + if ((СпособОпред AND 4) = 4, ', Справочник', ''), 3, 35))
!---------------- ItogOS
Итого
Trim(DoubleToStr(Итого_вес, Формат))
.EndFields
.Begin
 SaveMyDsk(True, 'StdForm');
End.
^

                                   ВЕДОМОСТЬ НАЛИЧИЯ ДРАГМЕТАЛЛОВ
                                           на @@@@@@@@@@@

Метод:                ^
Весовая единица:      ^ (^) грамм
Группировка:          ^
Сортировка:           ^
Фильтры:
.{ CheckEnter FilterOS5
 ^
.}
.{ CheckEnter HeadCreator
.}
.{
.[h
────────────────────────────────────────────────────────────────────────────────┬────────────────────────┬───────────────
                                  Наименование                                  │ Масса драгметалла      │  Способ
────────────────────────────────────────────────────────────────────────────────┴────────────────────────┴───────────────
.]h
.{ CheckEnter GruppaOS5
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б &&&&&&&&&&&&&&&&&&&&
.{ CheckEnter DM_Data
.}
.}
.{ CheckEnter NameOS5                                                                                        
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@                              &&&&&&&&&&&&&&&&&&&&       @@@@@@@@@@@@
.}
.{ CheckEnter ItogOS5
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б &&&&&&&&&&&&&&&&&&&&
.{ CheckEnter DM_Itog
.}
.}
.}


Бухгалтер

Ответственный за выпуск Р
.EndForm

!=============================================================================
.LinkForm 'NalDrag_02' Prototype is 'NalDrag'
!=============================================================================
.NameInList 'Инвентаризационная опись N ИНВ-8а'
.defo landscape
.p 60
.Group '<<Россия>>'
.Create View NalDrag_02_t1
 From
      TempDescr (ReadOnly)
;
.Var
  cRec : Comp
  TotNpp : LongInt
  PgNpp  : LongInt
  TotSum1 : Double
  TotSum2 : Double
  TotSum3 : Double
  TotSum4 : Double
  PgSum1  : Double
  PgSum2  : Double
  PgSum3  : Double
  PgSum4  : Double
  TotSum1_Komiss : Double
  TotSum2_Komiss : Double
  TotSum3_Komiss : Double
  TotSum4_Komiss : Double
  PgSum1_Komiss  : Double
  PgSum2_Komiss  : Double
  PgSum3_Komiss  : Double
  PgSum4_Komiss  : Double
  MainItogUp   : Boolean
  MainItogDown : Boolean
  cRec_MainItogUp : Comp
  PageNumber : Comp;
.EndVar
#CommissionLinkVar
#CommissionLinkInit(NalDrag)
.Fields
  CommonFormHeader
  Наименование_организации
  ОКПО
  Подразделение
  String(PageNumber)
  Наим_колонка_1
  Наим_колонка_2
  Наим_колонка_3
  Наим_колонка_4
.EndFields
.Begin
 Var ObjectIsLastLevel : Boolean;
 ObjectIsLastLevel := False;
 ReadMyDsk(ObjectIsLastLevel, 'ObjectIsLastLevel', False);
 if (Not ObjectIsLastLevel)
 {
  Message(''#3'Для получения выбранного отчета в настройке необходимо '#13#3+
          'задать последний уровень группировки данных "Карточки ОС"'#13#3+
          '                     или "Инвентарный объект"'
         );
  NalDrag_02.fBreak;
  Exit;
 }
 else
 {
  SaveMyDsk(True, 'Inv8aForm');
  cRec := Comp(0);
  TotNpp  := 0;
  TotSum1 := 0;
  TotSum2 := 0;
  TotSum3 := 0;
  TotSum4 := 0;
  TotSum1_Komiss := 0;
  TotSum2_Komiss := 0;
  TotSum3_Komiss := 0;
  TotSum4_Komiss := 0;
  MainItogUp   := False;
  MainItogDown := False;
  cRec_MainItogUp := Comp(0);
 }
 PageNumber := Comp(2);
End.
 Ш ^
                                                                                                                                                                                           Унифицированная форма N ИНВ-8а
                                                                                                                                                                                           Утверждена постановлением Госкомстата
                                                                                                                                                                                           России от 18.08.98  N 88
                                                                                                                                                                                                         ┌─────────────────────┐
                                                                                                                                                                                                         │         КОД         │
                                                                                                                                                                                                         ├─────────────────────┤
                                                                                                                                                                                           Форма по ОКУД │        0317009      │
                                                                                                                                                                                                         ├─────────────────────┤
     Е@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Е по ОКПО │@~@@@@@@@@@@@@@@@@@@@│
                                                                                                        oрганизация                                                                                      ├─────────────────────┤
     Е@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Е │                     │
                                                                                                 структурное подразделение                                                                               ├─────────────────────┤
                                                                                                                                                                                        Вид деятельности │                     │
                                                                                                                                                                                                 ┌───────┼─────────────────────┤
         Основание для проведения инвентаризации:                                             приказ,     постановление,     распоряжение                                                        │ Номер │                     │
                                                  ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼───────┼─────────────────────┤
                                                                                                       ненужное зачеркнуть                                                                       │ Дата  │                     │
                                                                                                                                                                                                 └───────┼─────────────────────┤
                                                                                                                                                                              Дата начала инвентаризации │                     │
                                                                                                                                                                                                         ├─────────────────────┤
                                                                                                                                                                           Дата окончания инвентаризации │                     │
                                                                                                                                                                                                         ├─────────────────────┤
                                                                                                                                                                                            Вид операции │                     │
                                                                                                                                                                                                         └─────────────────────┘
                                                                                                                                           ┌───────────────────────────┬────────────────────────────┐
                                                                                                                                           │      Номер документа      │      Дата составления      │
                                                                                                                                           ├───────────────────────────┼────────────────────────────┤
                                                                                        БИ Н В Е Н Т А Р И З А Ц И О Н Н А Я   О П И С Ь Б     │                           │                            │
                                                                                                                                           └───────────────────────────┴────────────────────────────┘
                                                                Бдрагоценных металлов, содержащихся в деталях, полуфабрикатах, сборочных единицах (узлах), Б
                                                                                               Боборудовании, приборах и других изделиях Б

                                                                                                     Б Р А С П И С К А Б

              К началу проведения инвентаризации все расходные и приходные документы на детали, полуфабрикаты, сборочные единицы (узлы), оборудование, приборы и другие изделия, в которых имеются драгоценные металлы, сданы в
    бухгалтерию и все материальные ценности, поступившие на мою (нашу) ответственность оприходованы, а выбывшие списаны в расход.

              Материально ответственное(ые) лицо(а)
                                                            ________________________       ________________________        _____________________________________________________________________________________________________
                                                                    должность                      подпись                                                     расшифровка подписи

                                                            ________________________       ________________________        _____________________________________________________________________________________________________
                                                                    должность                      подпись                                                     расшифровка подписи

                                                            ________________________       ________________________        _____________________________________________________________________________________________________
                                                                    должность                      подпись                                                     расшифровка подписи

              Комиссией проведена инвентаризация драгоценных металлов, содержащихся в деталях, полуфабрикатах, сборочных единицах (узлах), оборудовании, приборах и других изделиях,

    по состоянию на  "     " ______________________        г.

    При инвентаризации установлено следующее:






.{ CheckEnter FilterOS5
.}
.{ CheckEnter HeadCreator
.}
.{
.[h
                                                                                                                                                                                               ^-я страница формы № ИНВ-8а
┌──────┬────────────────────────────────────┬──────────┬───────┬───────────────────────────────────┬───────────────────────────────────────────────────────────────────────────────────────────────────────────────────┬────────┐
│Номер │              Объект                │ Единица  │  Год  │               Номер               │                                             Масса драгметаллов в объекте, грамм                                   │Предпо- │
│ по   │                                    │измерения │выпуска├───────────────┬────────┬──────────┼────────────────────────────┬────────────────────────────┬────────────────────────────┬────────────────────────────┤лагаемый│
│поряд-├─────────────────────────┬──────────┼────┬─────┤(изго- │  Инвентарный  │ Завод- │ Паспорта │@~@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@@@@│  срок  │
│ ку   │      Наименование       │Код(номен-│код │наи- │ товле-│               │  ской  │(докумен- ├────────────────┬───────────┼────────────────┬───────────┼────────────────┬───────────┼────────────────┬───────────┤списания│
│      │                         │клатурный │ по │мено-│ ния)  │               │        │ та о ре- │ по данным учета│установлено│ по данным учета│установлено│ по данным учета│установлено│ по данным учета│установлено│        │
│      │                         │  номер)  │ОКЕИ│вание│       │               │        │гистрации)│   (паспорта)   │ комиссией │   (паспорта)   │ комиссией │   (паспорта)   │ комиссией │   (паспорта)   │ комиссией │        │
├──────┼─────────────────────────┼──────────┼────┼─────┼───────┼───────────────┼────────┼──────────┼────────────────┼───────────┼────────────────┼───────────┼────────────────┼───────────┼────────────────┼───────────┼────────┤
│  1   │            2            │     3    │ 4  │  5  │   6   │       7       │    8   │     9    │        10      │     11    │        12      │     13    │        14      │     15    │        16      │     17    │   18   │
├──────┼─────────────────────────┼──────────┼────┼─────┼───────┼───────────────┼────────┼──────────┼────────────────┼───────────┼────────────────┼───────────┼────────────────┼───────────┼────────────────┼───────────┼────────┤
.Begin
  PgSum1 := 0;
  PgSum2 := 0;
  PgSum3 := 0;
  PgSum4 := 0;
  PgSum1_Komiss := 0;
  PgSum2_Komiss := 0;
  PgSum3_Komiss := 0;
  PgSum4_Komiss := 0;
  PgNpp  := 0;
  PageNumber := PageNumber+1;
End.
.]h
.{ CheckEnter GruppaOS5
.Begin
 if (cRec_MainItogUp = Comp(0))
 {
  if (NalDrag_02_t1.GetFirst TempDescr Where (( Head_TempDescr_NRec == TempDescr.NRec )) = 0)
   if (NalDrag_02_t1.TempDescr.Level = 0)
   {
    MainItogUp := True;
    cRec_MainItogUp := NalDrag_02_t1.TempDescr.NRec
   }
 }
 else
  MainItogUp := False;
End.
.{?INTERNAL;(Not NeedPrintAsLeaf) and (Not MainItogUp);
.Begin
 cRec := Comp(0);
End.
.Fields
  Ветка
  if ( NeedSum2,
    if ( Итого_верх_вес_1<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_1, 8), Формат)), ''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_1_Комиссионно<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_1_Комиссионно, 8), Формат)), ''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_2<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_2, 8), Формат)), ''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_2_Комиссионно<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_2_Комиссионно, 8), Формат)), ''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_3<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_3, 8), Формат)), ''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_3_Комиссионно<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_3_Комиссионно, 8), Формат)), ''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_4<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_4, 8), Формат)),''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_4_Комиссионно<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_4_Комиссионно, 8), Формат)),''),
         '')
.EndFields
│ Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│        │
.}
.{?INTERNAL;NeedPrintAsLeaf;
.Begin
 cRec := Head_TempDescr_NRec;
 PgSum1  := PgSum1 + Итого_верх_вес_1;
 PgSum2  := PgSum2 + Итого_верх_вес_2;
 PgSum3  := PgSum3 + Итого_верх_вес_3;
 PgSum4  := PgSum4 + Итого_верх_вес_4;
 TotSum1 := TotSum1 + Итого_верх_вес_1;
 TotSum2 := TotSum2 + Итого_верх_вес_2;
 TotSum3 := TotSum3 + Итого_верх_вес_3;
 TotSum4 := TotSum4 + Итого_верх_вес_4;

 PgSum1_Komiss  := PgSum1_Komiss + Итого_верх_вес_1_Комиссионно;
 PgSum2_Komiss  := PgSum2_Komiss + Итого_верх_вес_2_Комиссионно;
 PgSum3_Komiss  := PgSum3_Komiss + Итого_верх_вес_3_Комиссионно;
 PgSum4_Komiss  := PgSum4_Komiss + Итого_верх_вес_4_Комиссионно;
 TotSum1_Komiss := TotSum1_Komiss + Итого_верх_вес_1_Комиссионно;
 TotSum2_Komiss := TotSum2_Komiss + Итого_верх_вес_2_Комиссионно;
 TotSum3_Komiss := TotSum3_Komiss + Итого_верх_вес_3_Комиссионно;
 TotSum4_Komiss := TotSum4_Komiss + Итого_верх_вес_4_Комиссионно;

 PgNpp  := PgNpp  + 1;
 TotNpp := TotNpp + 1;
End.
.Fields
  TotNpp
  Верх_Наименование
  Верх_Номенклатурный_номер
  Верх_ЕдИзм_Сокр_Наим
  if (NeedDopInf=1, if (longint(Верх_дата_выпуска) > 0, String(Year(Верх_дата_выпуска), 4), ''), '')
  Верх_ИнвНомер
  Верх_заводской_номер
  Верх_Номер_паспорта
  if (Итого_верх_вес_1<>0,Trim(DoubleToStr(Round(Итого_верх_вес_1, 8), Формат)), '')
  if (Итого_верх_вес_1_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_верх_вес_1_Комиссионно, 8), Формат)), '')
  if (Итого_верх_вес_2<>0,Trim(DoubleToStr(Round(Итого_верх_вес_2, 8), Формат)), '')
  if (Итого_верх_вес_2_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_верх_вес_2_Комиссионно, 8), Формат)), '')
  if (Итого_верх_вес_3<>0,Trim(DoubleToStr(Round(Итого_верх_вес_3, 8), Формат)), '')
  if (Итого_верх_вес_3_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_верх_вес_3_Комиссионно, 8), Формат)), '')
  if (Итого_верх_вес_4<>0,Trim(DoubleToStr(Round(Итого_верх_вес_4, 8), Формат)), '')
  if (Итого_верх_вес_4_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_верх_вес_4_Комиссионно, 8), Формат)), '')
  if ( Верх_предп_срок_списания = Date(0,0,0), '',
   String(Month(Верх_предп_срок_списания),2) + '.' + String(Year(Верх_предп_срок_списания),4) )
.EndFields
│@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@│    │@~@@@│@~@@@@@│@~@@@@@@@@@@@@@│@~@@@@@@│@~@@@@@@@@│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│@~@@@@@@│
.}
.{ CheckEnter DM_Data
.}
.}
.{ CheckEnter NameOS5
.}
.{ CheckEnter ItogOS5
.Begin
 if (Tail_TempDescr_NRec = cRec_MainItogUp)
  MainItogDown := True;
 else
  MainItogDown := False;
End.
.{?INTERNAL;(Tail_TempDescr_NRec<>cRec)and(Not MainItogDown);
.Fields
  Итого
  if (Итого_вес_1<>0,Trim(DoubleToStr(Round(Итого_вес_1, 8), Формат)),'')
  if (Итого_вес_1_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_вес_1_Комиссионно, 8), Формат)),'')
  if (Итого_вес_2<>0,Trim(DoubleToStr(Round(Итого_вес_2, 8), Формат)),'')
  if (Итого_вес_2_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_вес_2_Комиссионно, 8), Формат)),'')
  if (Итого_вес_3<>0,Trim(DoubleToStr(Round(Итого_вес_3, 8), Формат)),'')
  if (Итого_вес_3_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_вес_3_Комиссионно, 8), Формат)),'')
  if (Итого_вес_4<>0,Trim(DoubleToStr(Round(Итого_вес_4, 8), Формат)),'')
  if (Итого_вес_4_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_вес_4_Комиссионно, 8), Формат)),'')
.EndFields
│ Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│        │
.}
.{ CheckEnter DM_Itog
.}
.}
.[f
.{?INTERNAL;(Not MainItogDown);
.Fields
  if (PgSum1<>0,Trim(DoubleToStr(Round(PgSum1, 8), Формат)),'')
  if (PgSum1_Komiss<>0,Trim(DoubleToStr(Round(PgSum1_Komiss, 8), Формат)),'')
  if (PgSum2<>0,Trim(DoubleToStr(Round(PgSum2, 8), Формат)),'')
  if (PgSum2_Komiss<>0,Trim(DoubleToStr(Round(PgSum2_Komiss, 8), Формат)),'')
  if (PgSum3<>0,Trim(DoubleToStr(Round(PgSum3, 8), Формат)),'')
  if (PgSum3_Komiss<>0,Trim(DoubleToStr(Round(PgSum3_Komiss, 8), Формат)),'')
  if (PgSum4<>0,Trim(DoubleToStr(Round(PgSum4, 8), Формат)),'')
  if (PgSum4_Komiss<>0,Trim(DoubleToStr(Round(PgSum4_Komiss, 8), Формат)),'')
.EndFields
└──────┴─────────────────────────┴──────────┴────┴─────┴───────┴───────────────┴────────┴──────────┼────────────────┼───────────┼────────────────┼───────────┼────────────────┼───────────┼────────────────┼───────────┼────────┤
                                                                                            Итого  │&&&&&&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│    X   │
                                                                                                   └────────────────┴───────────┴────────────────┴───────────┴────────────────┴───────────┴────────────────┴───────────┴────────┘
.}
.{?INTERNAL;MainItogDown;
.Fields
  if (PgSum1<>0,Trim(DoubleToStr(Round(PgSum1, 8), Формат)),'')
  if (PgSum1_Komiss<>0,Trim(DoubleToStr(Round(PgSum1_Komiss, 8), Формат)),'')
  if (PgSum2<>0,Trim(DoubleToStr(Round(PgSum2, 8), Формат)),'')
  if (PgSum2_Komiss<>0,Trim(DoubleToStr(Round(PgSum2_Komiss, 8), Формат)),'')
  if (PgSum3<>0,Trim(DoubleToStr(Round(PgSum3, 8), Формат)),'')
  if (PgSum3_Komiss<>0,Trim(DoubleToStr(Round(PgSum3_Komiss, 8), Формат)),'')
  if (PgSum4<>0,Trim(DoubleToStr(Round(PgSum4, 8), Формат)),'')
  if (PgSum4_Komiss<>0,Trim(DoubleToStr(Round(PgSum4_Komiss, 8), Формат)),'')
  if (TotSum1<>0,Trim(DoubleToStr(Round(TotSum1, 8), Формат)),'')
  if (TotSum1_Komiss<>0,Trim(DoubleToStr(Round(TotSum1_Komiss, 8), Формат)),'')
  if (TotSum2<>0,Trim(DoubleToStr(Round(TotSum2, 8), Формат)),'')
  if (TotSum2_Komiss<>0,Trim(DoubleToStr(Round(TotSum2_Komiss, 8), Формат)),'')
  if (TotSum3<>0,Trim(DoubleToStr(Round(TotSum3, 8), Формат)),'')
  if (TotSum3_Komiss<>0,Trim(DoubleToStr(Round(TotSum3_Komiss, 8), Формат)),'')
  if (TotSum4<>0,Trim(DoubleToStr(Round(TotSum4, 8), Формат)),'')
  if (TotSum4_Komiss<>0,Trim(DoubleToStr(Round(TotSum4_Komiss, 8), Формат)),'')
.EndFields
└──────┴─────────────────────────┴──────────┴────┴─────┴───────┴───────────────┴────────┴──────────┼────────────────┼───────────┼────────────────┼───────────┼────────────────┼───────────┼────────────────┼───────────┼────────┤
                                                                                            Итого  │&&&&&&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│    X   │
                                                                                                   ├────────────────┼───────────┼────────────────┼───────────┼────────────────┼───────────┼────────────────┼───────────┼────────┤
                                                                                    Всего по акту  │&&&&&&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&│    X   │
                                                                                                   └────────────────┴───────────┴────────────────┴───────────┴────────────────┴───────────┴────────────────┴───────────┴────────┘
.}
.Fields
  UpCase(Trim(DoubleToStr(Double(PgNpp), '4')))
  Наим_колонка_1
  Наим_колонка_2
  Наим_колонка_3
  Наим_колонка_4
.EndFields
    Итого по странице:
                       а) количество порядковых номеров   Е@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Е
                                                                                                                           прописью
                       б) общее количество единиц фактически  __________________________________________________________________________________________________________________________________________________________________
                                                                                                                              прописью
                       в) масса драгоценных металлов фактически:
                                                                 &&&&&&&&&&&&&&&&&&&&  __________________________________________________________________________________________________________________________  г
                                                                                                                                   прописью
                                                                 &&&&&&&&&&&&&&&&&&&&  __________________________________________________________________________________________________________________________  г
                                                                                                                                   прописью
                                                                 &&&&&&&&&&&&&&&&&&&&  __________________________________________________________________________________________________________________________  г
                                                                                                                                   прописью
                                                                 &&&&&&&&&&&&&&&&&&&&  __________________________________________________________________________________________________________________________  г
                                                                                                                                   прописью
.]f
.}

.Fields
  String(PageNumber)
  UpCase(Trim(DoubleToStr(Double(TotNpp), '4')))
  Наим_колонка_1
  Наим_колонка_2
  Наим_колонка_3
  Наим_колонка_4
.EndFields
                                                                                                                                                                                                  ^-я страница формы № ИНВ-8а
     Итого по описи:
                       а) количество порядковых номеров   Е@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Е
                                                                                                                           прописью
                       б) общее количество единиц фактически  __________________________________________________________________________________________________________________________________________________________________
                                                                                                                              прописью
                       в) масса драгоценных металлов фактически:
                                                                 &&&&&&&&&&&&&&&&&&&&  __________________________________________________________________________________________________________________________  г
                                                                                                                                   прописью
                                                                 &&&&&&&&&&&&&&&&&&&&  __________________________________________________________________________________________________________________________  г
                                                                                                                                   прописью
                                                                 &&&&&&&&&&&&&&&&&&&&  __________________________________________________________________________________________________________________________  г
                                                                                                                                   прописью
                                                                 &&&&&&&&&&&&&&&&&&&&  __________________________________________________________________________________________________________________________  г
                                                                                                                                   прописью
    Все подсчеты итогов по строкам, страницам и в целом по инвентаризационной описи проверены.


.Fields
  Председатель_комиссии_Должность
  Председатель_комиссии_ФИО
.EndFields
    Председатель комиссии   Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д        __________________________________         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                       должность                                   подпись                                                                  расшифровка подписи

.{While (Номер_члена_комиссии < Количество_членов_комиссии)
.begin
  Номер_члена_комиссии := Номер_члена_комиссии + 1;
end.
.fields
  if (Номер_члена_комиссии = word(1), 'Члены комиссии:', '')
  Массив_Член_комиссии_Должность [Номер_члена_комиссии]
  Массив_Член_комиссии_ФИО       [Номер_члена_комиссии]
.endfields
    @@@@@@@@@@@@@@@         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д        __________________________________         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                       должность                                   подпись                                                                  расшифровка подписи

.}
.{?INTERNAL;(Количество_членов_комиссии = 0)
    Члены комиссии         __________________________________        __________________________________        _________________________________________________________________________________________________________________
                                       должность                                   подпись                                                                  расшифровка подписи

                           __________________________________        __________________________________        _________________________________________________________________________________________________________________
                                       должность                                   подпись                                                                  расшифровка подписи

                           __________________________________        __________________________________        _________________________________________________________________________________________________________________
                                       должность                                   подпись                                                                  расшифровка подписи

.}
    Все ценности, поименованные в настоящей инвентаризационной описи с N                         по N                        , комиссией проверены в натуре по количеству, массе в моем (нашем) присутствии и внесены в
                                                                          ──────────────────────      ───────────────────────
    опись, в связи с чем претензий к инвентаризационной комиссии не имею(не имеем). Ценности, перечисленные в описи, находятся на моем(нашем) ответственном хранении.


    Материально ответственное(ые) лицо(а)
                                            ________________________        ________________________        _______________________________________________________________________________________
                                                   должность                         подпись                                                расшифровка подписи

                                            ________________________        ________________________        _______________________________________________________________________________________
                                                   должность                         подпись                                                расшифровка подписи

                                            ________________________        ________________________        _______________________________________________________________________________________
                                                   должность                         подпись                                                расшифровка подписи


                                                                                   "       "  _________________________            г.


    Указанные в настоящем акте данные и расчеты проверил     _________________________        ________________________        __________________________________________________________________________________________________
                                                                     должность                         подпись                                                расшифровка подписи


                                                                           "       "  _________________________            г. Ш
.EndForm

!=============================================================================
.LinkForm 'NalDrag_03' Prototype is 'NalDrag'
!=============================================================================
.NameInList 'Инвентаризационная опись N ИНВ-8а'
.defo landscape
.p 40
.Group '<<Беларусь>>'
.Var
  cRec : Comp
  TotNpp : LongInt
  PgNpp  : LongInt
  TotKol : Double
  PgKol  : Double
  TotSum1 : Double
  TotSum2 : Double
  TotSum3 : Double
  TotSum4 : Double
  PgSum1  : Double
  PgSum2  : Double
  PgSum3  : Double
  PgSum4  : Double
  TotSum1_Komiss : Double
  TotSum2_Komiss : Double
  TotSum3_Komiss : Double
  TotSum4_Komiss : Double
  PgSum1_Komiss  : Double
  PgSum2_Komiss  : Double
  PgSum3_Komiss  : Double
  PgSum4_Komiss  : Double
.EndVar
#CommissionLinkVar
#CommissionLinkInit(NalDrag)
.Fields
  CommonFormHeader
  Наименование_организации
  DateToStr(Дата,'DD Mon YYYY')
  Наим_колонка_1
  Наим_колонка_2
  Наим_колонка_3
  Наим_колонка_4
.EndFields
.Begin
 Var ObjectIsLastLevel : Boolean;
 ObjectIsLastLevel := False;
 ReadMyDsk(ObjectIsLastLevel, 'ObjectIsLastLevel', False);
 if (Not ObjectIsLastLevel)
 {
  Message(''#3'Для получения выбранного отчета в настройке необходимо '#13#3+
          'задать последний уровень группировки данных "Карточки ОС"'#13#3+
          '                     или "Инвентарный объект"'
         );
  NalDrag_03.fBreak;
  Exit;
 }
 else
 {
  SaveMyDsk(True, 'Inv8aForm');
  cRec := Comp(0);
  TotNpp  := 0;
  TotKol  := 0.0;
  TotSum1 := 0;
  TotSum2 := 0;
  TotSum3 := 0;
  TotSum4 := 0;
  TotSum1_Komiss := 0;
  TotSum2_Komiss := 0;
  TotSum3_Komiss := 0;
  TotSum4_Komiss := 0;
 }
End.
 Ш ^ Ш
 Р                                                                                                                                                 Приложение 1
                                                                                                                                       к Инструкции о порядке
                                                                                                                              использования, учета и хранения
                                                                                                                                       драгоценных металлов и
                                                                                                                                           драгоценных камней
                                                                                                                        Постановление МФ РБ от 15.03.2004 №34

                                                                                                                                                 Форма ИНВ-8а

 Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                  В(наименование организации) В                                                                                          ┌─────────────────────┐
                                                                                                                         Код по ОКУД │                     │
 Д_________________________________________________________________ Д                                                                    └─────────────────────┘
             В(наименование структурного подразделения) В


 Б                                  ИНВЕНТАРИЗАЦИОННАЯ ОПИСЬ                                                            ┌───────────────────┬────────────────────┐
                           драгоценных металлов и драгоценных камней,                                                 │  Номер документа  │  Дата составления  │
                         содержащихся в полуфабрикатах, узлах и деталях                                               ├───────────────────┼────────────────────┤
                         оборудования, приборах и иных изделиях, а также                                              │                   │@~@@@@@@@@@@@@@@@@@@│
                             находящихся в составе любых материальных                                                 └───────────────────┴────────────────────┘
                                ценностей, в ломе и отходах С
 Р


                                                                          Б Р А С П И С К А Б


К началу проведения инвентаризации все расходные и приходные документы на инвентаризируемые ценности сданы в бухгалтерию, ценности, поступившие под мою
ответственность, оприходованы, а выбывшие - списаны в расход.

Материально ответственное лицо:    _________________________________   _________________   ___________________________________________________________________
 В                                            (должность)                   (подпись)                                (инициалы, фамилия) В
На основании приказа (распоряжения) от  "____" ___________________ 20 ___ г.  № ____ проведена инвентаризация драгоценных металлов

и драгоценных камней, содержащихся в изделях по состоянию на  "____" ___________________ 20 ___ г.



При инвентаризации установлено следующее: Р
 Р                                                                                             Раздел 1 Р
.{ CheckEnter FilterOS5
.}
.{ CheckEnter HeadCreator
.}
.{
.[h
 Ш
┌──────┬──────────────────────────────┬─────────┬──────────┬──────┬─────────┬───────────┬───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┬────────┐
│Поряд-│Наименование объектов основных│Код мате-│ Единица  │ Год  │Заводской│Инвентарный│                                           Количество драгоценных металлов, г                                                  │Предпо- │
│ковый │средств,материалов,продукции и│риалов,  │измерения │ вы-  │  номер  │   номер   ├───────────────────────────────┬───────────────────────────────┬───────────────────────────────┬───────────────────────────────┤лагаемый│
│номер │изделий,лома и отходов        │продукции┼─────┬────┤пуска │         │           │@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│  срок  │
│записи│                              │и т.д.   │наи- │Код │(изго-│         │           ├────────────────┬──────────────┼────────────────┬──────────────┼────────────────┬──────────────┼────────────────┬──────────────┤списания│
│      │                              │         │мено-│    │товле-│         │           │    по учету    │  определено  │    по учету    │  определено  │    по учету    │  определено  │    по учету    │  определено  │        │
│      │                              │         │вание│    │ ния) │         │           │   (паспорту)   │"комиссионно" │   (паспорту)   │"комиссионно" │   (паспорту)   │"комиссионно" │   (паспорту)   │"комиссионно" │        │
├──────┼──────────────────────────────┼─────────┼─────┼────┼──────┼─────────┼───────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────┤
│  1   │            2                 │    3    │  4  │ 5  │   6  │    7    │     8     │        9       │     10       │        11      │     12       │        13      │     14       │        15      │     16       │   17   │
├──────┼──────────────────────────────┼─────────┼─────┼────┼──────┼─────────┼───────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────┤ Ш
.Begin
  PgKol  := 0.0;
  PgSum1 := 0;
  PgSum2 := 0;
  PgSum3 := 0;
  PgSum4 := 0;
  PgSum1_Komiss := 0;
  PgSum2_Komiss := 0;
  PgSum3_Komiss := 0;
  PgSum4_Komiss := 0;
  PgNpp  := 0;
End.
.]h
.{ CheckEnter GruppaOS5
.{?INTERNAL;(Not NeedPrintAsLeaf);
.Fields
  Ветка
  if ( NeedSum2,
    if ( Итого_верх_вес_1<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_1, 8), Формат)), ''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_1_Комиссионно<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_1_Комиссионно, 8), Формат)), ''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_2<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_2, 8), Формат)), ''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_2_Комиссионно<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_2_Комиссионно, 8), Формат)), ''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_3<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_3, 8), Формат)), ''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_3_Комиссионно<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_3_Комиссионно, 8), Формат)), ''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_4<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_4, 8), Формат)), ''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_4_Комиссионно<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_4_Комиссионно, 8), Формат)), ''),
         '')
.EndFields
 Ш│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│        │ Ш
.Begin
 cRec := Comp(0);
End.
.}
.{?INTERNAL;NeedPrintAsLeaf;
.Begin
 cRec := Head_TempDescr_NRec;
 PgSum1  := PgSum1  + Итого_верх_вес_1;
 PgSum2  := PgSum2  + Итого_верх_вес_2;
 PgSum3  := PgSum3  + Итого_верх_вес_3;
 PgSum4  := PgSum4  + Итого_верх_вес_4;
 TotSum1 := TotSum1 + Итого_верх_вес_1;
 TotSum2 := TotSum2 + Итого_верх_вес_2;
 TotSum3 := TotSum3 + Итого_верх_вес_3;
 TotSum4 := TotSum4 + Итого_верх_вес_4;
 PgSum1_Komiss  := PgSum1_Komiss  + Итого_верх_вес_1_Комиссионно;
 PgSum2_Komiss  := PgSum2_Komiss  + Итого_верх_вес_2_Комиссионно;
 PgSum3_Komiss  := PgSum3_Komiss  + Итого_верх_вес_3_Комиссионно;
 PgSum4_Komiss  := PgSum4_Komiss  + Итого_верх_вес_4_Комиссионно;
 TotSum1_Komiss := TotSum1_Komiss + Итого_верх_вес_1_Комиссионно;
 TotSum2_Komiss := TotSum2_Komiss + Итого_верх_вес_2_Комиссионно;
 TotSum3_Komiss := TotSum3_Komiss + Итого_верх_вес_3_Комиссионно;
 TotSum4_Komiss := TotSum4_Komiss + Итого_верх_вес_4_Комиссионно;
 PgNpp  := PgNpp  + 1;
 TotNpp := TotNpp + 1;
 PgKol  := PgKol + Round(Итого_верх_вес_1, 8)
                 + Round(Итого_верх_вес_2, 8)
                 + Round(Итого_верх_вес_3, 8)
                 + Round(Итого_верх_вес_4, 8)
                 + Round(Итого_верх_вес_1_Комиссионно, 8)
                 + Round(Итого_верх_вес_2_Комиссионно, 8)
                 + Round(Итого_верх_вес_3_Комиссионно, 8)
                 + Round(Итого_верх_вес_4_Комиссионно, 8);
 TotKol := TotKol + Round(Итого_верх_вес_1, 8)
                  + Round(Итого_верх_вес_2, 8)
                  + Round(Итого_верх_вес_3, 8)
                  + Round(Итого_верх_вес_4, 8)
                  + Round(Итого_верх_вес_1_Комиссионно, 8)
                  + Round(Итого_верх_вес_2_Комиссионно, 8)
                  + Round(Итого_верх_вес_3_Комиссионно, 8)
                  + Round(Итого_верх_вес_4_Комиссионно, 8);
End.
.Fields
  TotNpp
  Верх_Наименование
  Верх_Номенклатурный_номер
  Верх_ЕдИзмИк_Наим
  Верх_ЕдИзмИк_Код
  if (NeedDopInf=1, if (longint(Верх_дата_выпуска) > 0, String(Year(Верх_дата_выпуска), 4), ''), '')
  Верх_заводской_номер
  Верх_ИнвНомер
  if (Итого_верх_вес_1<>0,Trim(DoubleToStr(Round(Итого_верх_вес_1, 8), Формат)),'')
  if (Итого_верх_вес_1_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_верх_вес_1_Комиссионно, 8), Формат)),'')
  if (Итого_верх_вес_2<>0,Trim(DoubleToStr(Round(Итого_верх_вес_2, 8), Формат)),'')
  if (Итого_верх_вес_2_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_верх_вес_2_Комиссионно, 8), Формат)),'')
  if (Итого_верх_вес_3<>0,Trim(DoubleToStr(Round(Итого_верх_вес_3, 8), Формат)),'')
  if (Итого_верх_вес_3_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_верх_вес_3_Комиссионно, 8), Формат)),'')
  if (Итого_верх_вес_4<>0,Trim(DoubleToStr(Round(Итого_верх_вес_4, 8), Формат)),'')
  if (Итого_верх_вес_4_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_верх_вес_4_Комиссионно, 8), Формат)),'')
  if ( Верх_предп_срок_списания = Date(0,0,0), '',
   String(Month(Верх_предп_срок_списания),2) + '.' + String(Year(Верх_предп_срок_списания),4) )
.EndFields                                                           
 Ш│@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@│@~@@@│@~@@│@~@@@@│@~@@@@@@@│@~@@@@@@@@@│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│@~@@@@@@│ Ш
.}
.{ CheckEnter DM_Data
.}
.}
.{ CheckEnter NameOS5
.}
.{ CheckEnter ItogOS5
.{?INTERNAL;Tail_TempDescr_NRec<>cRec;
.Fields
  Итого
  if (Итого_вес_1<>0,Trim(DoubleToStr(Round(Итого_вес_1, 8), Формат)),'')
  if (Итого_вес_1_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_вес_1_Комиссионно, 8), Формат)),'')
  if (Итого_вес_2<>0,Trim(DoubleToStr(Round(Итого_вес_2, 8), Формат)),'')
  if (Итого_вес_2_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_вес_2_Комиссионно, 8), Формат)),'')
  if (Итого_вес_3<>0,Trim(DoubleToStr(Round(Итого_вес_3, 8), Формат)),'')
  if (Итого_вес_3_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_вес_3_Комиссионно, 8), Формат)),'')
  if (Итого_вес_4<>0,Trim(DoubleToStr(Round(Итого_вес_4, 8), Формат)),'')
  if (Итого_вес_4_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_вес_4_Комиссионно, 8), Формат)),'')
.EndFields
 Ш│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│        │ Ш
.}
.{ CheckEnter DM_Itog
.}
.}
.[f                                                                   
 Ш└──────┴──────────────────────────────┴─────────┴─────┴────┴──────┴─────────┴───────────┴────────────────┴──────────────┴────────────────┴──────────────┴────────────────┴──────────────┴────────────────┴──────────────┴────────┘ Ш
.Fields
  UpCase(Trim(DoubleToStr(Double(PgNpp), '4')))
  if ( ((PgKol) > 0.0), UpCase(Trim(DoubleToStr(PgKol, '4 целых 5'))), '' )
.EndFields
 ШИтого по странице:
  а) количество порядковых номеров   Е@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Е
                                                                                                                      прописью
  б) общее количество
     в натуральных показателях  Е@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Е
                                                                                                                      прописью Ш
.]f
.}
.Fields
  UpCase(Trim(DoubleToStr(Double(TotNpp), '4')))
  if ( ((TotKol) > 0.0), UpCase(Trim(DoubleToStr(TotKol, '4 целых 5'))), '' )
.EndFields
 ШИтого по описи:
  а) количество порядковых номеров   Е@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Е
                                                                                                                 прописью
  б) общее количество
     в натуральных показателях  Е@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Е
                                                                                                                      прописью Ш
.Fields
  Председатель_комиссии_Должность
  Председатель_комиссии_ФИО
.EndFields
 Р  Председатель комиссии   Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д  __________________________________   Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
 В                                    (должность)                          (подпись)                                     (инициалы,фамилия) Т

.{While (Номер_члена_комиссии < Количество_членов_комиссии)
.begin
  Номер_члена_комиссии := Номер_члена_комиссии + 1;
end.
.fields
  if (Номер_члена_комиссии = word(1), 'Члены комиссии:', '')
  Массив_Член_комиссии_Должность [Номер_члена_комиссии]
  Массив_Член_комиссии_ФИО       [Номер_члена_комиссии]
.endfields
 Р  @@@@@@@@@@@@@@@@@@@   Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д  __________________________________    Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
 В                                    (должность)                                (подпись)                               (инициалы,фамилия) Т
.}
.{?INTERNAL;(Количество_членов_комиссии = 0)
 Р  Члены комиссии:     __________________________________   __________________________________  ________________________________________________________________
 В                                   (должность)                          (подпись)                                      (инициалы,фамилия) В
                      __________________________________   __________________________________  ________________________________________________________________
 В                                   (должность)                          (подпись)                                      (инициалы,фамилия) В
                      __________________________________   __________________________________  ________________________________________________________________
 В                                   (должность)                          (подпись)                                      (инициалы,фамилия) В
.}

  Все ценности, поименованные в настоящей инвентаризационной описи с №________________________ по № ________________________ комиссией проверены в натуре в моем
  присутствии и внесены в опись, в связи с чем претензий к инвентаризационной комиссии не имею. Ценности, перечисленные в описи, находятся на моем ответственном
  хранении.
  Материально ответственное лицо: ______________________________________________

  "____"  ____________________  20 ___ г.

  Указанные в настоящем акте данные
  и подсчеты проверил               __________________________________   __________________        ____________________________________________________________
 В                                                 (должность)                   (подпись)                               (инициалы, фамилия) Т
 Р
  "____"  ____________________  20 ___ г. Р

.EndForm

!=============================================================================
.LinkForm 'NalDrag_03Ext' Prototype is 'NalDrag'
!=============================================================================
.NameInList 'Инвентаризационная опись N ИНВ-8а(с дополнительными итогами)'
.defo landscape
.p 40
.Group '<<Беларусь>>'
.Create View NalDrag_02_t1
 From
      TempDescr (ReadOnly)
;
.Var
  cRec : Comp
  TotNpp : LongInt
  PgNpp  : LongInt
  TotSum1 : Double
  TotSum2 : Double
  TotSum3 : Double
  TotSum4 : Double
  PgSum1  : Double
  PgSum2  : Double
  PgSum3  : Double
  PgSum4  : Double
  TotSum1_Komiss : Double
  TotSum2_Komiss : Double
  TotSum3_Komiss : Double
  TotSum4_Komiss : Double
  PgSum1_Komiss  : Double
  PgSum2_Komiss  : Double
  PgSum3_Komiss  : Double
  PgSum4_Komiss  : Double
  MainItogUp   : Boolean
  MainItogDown : Boolean
  cRec_MainItogUp : Comp
  PageNumber : Comp;
  TotKol : Double
  PgKol  : Double
.EndVar
#CommissionLinkVar
#CommissionLinkInit(NalDrag)
.Fields
  CommonFormHeader
  Наименование_организации
  DateToStr(Дата,'DD Mon YYYY')
  Наим_колонка_1
  Наим_колонка_2
  Наим_колонка_3
  Наим_колонка_4
.EndFields
.Begin
 Var ObjectIsLastLevel : Boolean;
 ObjectIsLastLevel := False;
 ReadMyDsk(ObjectIsLastLevel, 'ObjectIsLastLevel', False);
 if (Not ObjectIsLastLevel)
 {
  Message(''#3'Для получения выбранного отчета в настройке необходимо '#13#3+
          'задать последний уровень группировки данных "Карточки ОС"'#13#3+
          '                     или "Инвентарный объект"'
         );
  NalDrag_03Ext.fBreak;
  Exit;
 }
 else
 {
  SaveMyDsk(True, 'Inv8aForm');
  cRec := Comp(0);
  TotKol := 0.0;
  TotNpp  := 0;
  TotSum1 := 0;
  TotSum2 := 0;
  TotSum3 := 0;
  TotSum4 := 0;
  TotSum1_Komiss := 0;
  TotSum2_Komiss := 0;
  TotSum3_Komiss := 0;
  TotSum4_Komiss := 0;
  MainItogUp   := False;
  MainItogDown := False;
  cRec_MainItogUp := Comp(0);
 }
 PageNumber := Comp(2);
End.
 Ш ^ Ш
 Р                                                                                                                                                 Приложение 1
                                                                                                                                       к Инструкции о порядке
                                                                                                                              использования, учета и хранения
                                                                                                                                       драгоценных металлов и
                                                                                                                                           драгоценных камней
                                                                                                                        Постановление МФ РБ от 15.03.2004 №34

                                                                                                                                                 Форма ИНВ-8а

 Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                  В(наименование организации) В                                                                                          ┌─────────────────────┐
                                                                                                                         Код по ОКУД │                     │
 Д_________________________________________________________________ Д                                                                    └─────────────────────┘
             В(наименование структурного подразделения) В


 Б                                  ИНВЕНТАРИЗАЦИОННАЯ ОПИСЬ                                                            ┌───────────────────┬────────────────────┐
                           драгоценных металлов и драгоценных камней,                                                 │  Номер документа  │  Дата составления  │
                         содержащихся в полуфабрикатах, узлах и деталях                                               ├───────────────────┼────────────────────┤
                         оборудования, приборах и иных изделиях, а также                                              │                   │@~@@@@@@@@@@@@@@@@@@│
                             находящихся в составе любых материальных                                                 └───────────────────┴────────────────────┘
                                ценностей, в ломе и отходах С
 Р


                                                                          Б Р А С П И С К А Б


К началу проведения инвентаризации все расходные и приходные документы на инвентаризируемые ценности сданы в бухгалтерию, ценности, поступившие под мою
ответственность, оприходованы, а выбывшие - списаны в расход.

Материально ответственное лицо:    _________________________________   _________________   ___________________________________________________________________
 В                                            (должность)                   (подпись)                                (инициалы, фамилия) В
На основании приказа (распоряжения) от  "____" ___________________ 20 ___ г.  № ____ проведена инвентаризация драгоценных металлов

и драгоценных камней, содержащихся в изделях по состоянию на  "____" ___________________ 20 ___ г.



При инвентаризации установлено следующее: Р
 Р                                                                                             Раздел 1 Р
.{ CheckEnter FilterOS5
.}
.{ CheckEnter HeadCreator
.}
.{
.[h
 Ш┌──────┬──────────────────────────────┬─────────┬──────────┬──────┬─────────┬───────────┬───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┬────────┐
│Поряд-│Наименование объектов основных│Код мате-│ Единица  │ Год  │Заводской│Инвентарный│                                           Количество драгоценных металлов, г                                                  │Предпо- │
│ковый │средств,материалов,продукции и│риалов,  │измерения │ вы-  │  номер  │   номер   ├───────────────────────────────┬───────────────────────────────┬───────────────────────────────┬───────────────────────────────┤лагаемый│
│номер │изделий,лома и отходов        │продукции┼─────┬────┤пуска │         │           │@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│  срок  │
│записи│                              │и т.д.   │наи- │Код │(изго-│         │           ├────────────────┬──────────────┼────────────────┬──────────────┼────────────────┬──────────────┼────────────────┬──────────────┤списания│
│      │                              │         │мено-│    │товле-│         │           │    по учету    │  определено  │    по учету    │  определено  │    по учету    │  определено  │    по учету    │  определено  │        │
│      │                              │         │вание│    │ ния) │         │           │   (паспорту)   │"комиссионно" │   (паспорту)   │"комиссионно" │   (паспорту)   │"комиссионно" │   (паспорту)   │"комиссионно" │        │
├──────┼──────────────────────────────┼─────────┼─────┼────┼──────┼─────────┼───────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────┤
│  1   │            2                 │    3    │  4  │ 5  │   6  │    7    │     8     │        9       │     10       │        11      │     12       │        13      │     14       │        15      │     16       │   17   │
├──────┼──────────────────────────────┼─────────┼─────┼────┼──────┼─────────┼───────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────┤ Ш
.Begin
  PgSum1 := 0;
  PgSum2 := 0;
  PgSum3 := 0;
  PgSum4 := 0;
  PgSum1_Komiss := 0;
  PgSum2_Komiss := 0;
  PgSum3_Komiss := 0;
  PgSum4_Komiss := 0;
  PgNpp  := 0;
  PageNumber := PageNumber+1;
  PgKol  := 0.0;
End.
.]h
.{ CheckEnter GruppaOS5
.Begin
 if (cRec_MainItogUp = Comp(0))
 {
  if (NalDrag_02_t1.GetFirst TempDescr Where (( Head_TempDescr_NRec == TempDescr.NRec )) = 0)
   if (NalDrag_02_t1.TempDescr.Level = 0)
   {
    MainItogUp := True;
    cRec_MainItogUp := NalDrag_02_t1.TempDescr.NRec
   }
 }
 else
  MainItogUp := False;
End.
.{?INTERNAL;(Not NeedPrintAsLeaf) and (Not MainItogUp);
.Begin
 cRec := Comp(0);
End.
.Fields
  Ветка
  if ( NeedSum2,
    if ( Итого_верх_вес_1<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_1, 8), Формат)), ''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_1_Комиссионно<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_1_Комиссионно, 8), Формат)), ''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_2<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_2, 8), Формат)), ''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_2_Комиссионно<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_2_Комиссионно, 8), Формат)), ''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_3<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_3, 8), Формат)), ''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_3_Комиссионно<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_3_Комиссионно, 8), Формат)), ''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_4<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_4, 8), Формат)),''),
         '')
  if ( NeedSum2,
    if ( Итого_верх_вес_4_Комиссионно<>0,
         Trim(DoubleToStr(Round(Итого_верх_вес_4_Комиссионно, 8), Формат)),''),
         '')
.EndFields
 Ш│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│        │ Ш
.}
.{?INTERNAL;NeedPrintAsLeaf;
.Begin
 cRec := Head_TempDescr_NRec;
 PgSum1  := PgSum1 + Итого_верх_вес_1;
 PgSum2  := PgSum2 + Итого_верх_вес_2;
 PgSum3  := PgSum3 + Итого_верх_вес_3;
 PgSum4  := PgSum4 + Итого_верх_вес_4;
 TotSum1 := TotSum1 + Итого_верх_вес_1;
 TotSum2 := TotSum2 + Итого_верх_вес_2;
 TotSum3 := TotSum3 + Итого_верх_вес_3;
 TotSum4 := TotSum4 + Итого_верх_вес_4;

 PgSum1_Komiss  := PgSum1_Komiss + Итого_верх_вес_1_Комиссионно;
 PgSum2_Komiss  := PgSum2_Komiss + Итого_верх_вес_2_Комиссионно;
 PgSum3_Komiss  := PgSum3_Komiss + Итого_верх_вес_3_Комиссионно;
 PgSum4_Komiss  := PgSum4_Komiss + Итого_верх_вес_4_Комиссионно;
 TotSum1_Komiss := TotSum1_Komiss + Итого_верх_вес_1_Комиссионно;
 TotSum2_Komiss := TotSum2_Komiss + Итого_верх_вес_2_Комиссионно;
 TotSum3_Komiss := TotSum3_Komiss + Итого_верх_вес_3_Комиссионно;
 TotSum4_Komiss := TotSum4_Komiss + Итого_верх_вес_4_Комиссионно;

 PgNpp  := PgNpp  + 1;
 TotNpp := TotNpp + 1;
 PgKol  := PgKol + Round(Итого_верх_вес_1, 8)
                 + Round(Итого_верх_вес_2, 8)
                 + Round(Итого_верх_вес_3, 8)
                 + Round(Итого_верх_вес_4, 8)
                 + Round(Итого_верх_вес_1_Комиссионно, 8)
                 + Round(Итого_верх_вес_2_Комиссионно, 8)
                 + Round(Итого_верх_вес_3_Комиссионно, 8)
                 + Round(Итого_верх_вес_4_Комиссионно, 8);
 TotKol := TotKol + Round(Итого_верх_вес_1, 8)
                  + Round(Итого_верх_вес_2, 8)
                  + Round(Итого_верх_вес_3, 8)
                  + Round(Итого_верх_вес_4, 8)
                  + Round(Итого_верх_вес_1_Комиссионно, 8)
                  + Round(Итого_верх_вес_2_Комиссионно, 8)
                  + Round(Итого_верх_вес_3_Комиссионно, 8)
                  + Round(Итого_верх_вес_4_Комиссионно, 8);
End.
.Fields
  TotNpp
  Верх_Наименование
  Верх_Номенклатурный_номер
  Верх_ЕдИзмИк_Наим
  Верх_ЕдИзмИк_Код
  if (NeedDopInf=1, if (longint(Верх_дата_выпуска) > 0, String(Year(Верх_дата_выпуска), 4), ''), '')
  Верх_заводской_номер
  Верх_ИнвНомер
  if (Итого_верх_вес_1<>0,Trim(DoubleToStr(Round(Итого_верх_вес_1, 8), Формат)), '')
  if (Итого_верх_вес_1_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_верх_вес_1_Комиссионно, 8), Формат)), '')
  if (Итого_верх_вес_2<>0,Trim(DoubleToStr(Round(Итого_верх_вес_2, 8), Формат)), '')
  if (Итого_верх_вес_2_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_верх_вес_2_Комиссионно, 8), Формат)), '')
  if (Итого_верх_вес_3<>0,Trim(DoubleToStr(Round(Итого_верх_вес_3, 8), Формат)), '')
  if (Итого_верх_вес_3_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_верх_вес_3_Комиссионно, 8), Формат)), '')
  if (Итого_верх_вес_4<>0,Trim(DoubleToStr(Round(Итого_верх_вес_4, 8), Формат)), '')
  if (Итого_верх_вес_4_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_верх_вес_4_Комиссионно, 8), Формат)), '')
  if ( Верх_предп_срок_списания = Date(0,0,0), '',
   String(Month(Верх_предп_срок_списания),2) + '.' + String(Year(Верх_предп_срок_списания),4) )
.EndFields
 Ш│@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@│@~@@@│@~@@│@~@@@@│@~@@@@@@@│@~@@@@@@@@@│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│@~@@@@@@│ Ш
.}
.{ CheckEnter DM_Data
.}
.}
.{ CheckEnter NameOS5
.}
.{ CheckEnter ItogOS5
.Begin
 if (Tail_TempDescr_NRec = cRec_MainItogUp)
  MainItogDown := True;
 else
  MainItogDown := False;
End.
.{?INTERNAL;(Tail_TempDescr_NRec<>cRec)and(Not MainItogDown);
.Fields
  Итого
  if (Итого_вес_1<>0,Trim(DoubleToStr(Round(Итого_вес_1, 8), Формат)),'')
  if (Итого_вес_1_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_вес_1_Комиссионно, 8), Формат)),'')
  if (Итого_вес_2<>0,Trim(DoubleToStr(Round(Итого_вес_2, 8), Формат)),'')
  if (Итого_вес_2_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_вес_2_Комиссионно, 8), Формат)),'')
  if (Итого_вес_3<>0,Trim(DoubleToStr(Round(Итого_вес_3, 8), Формат)),'')
  if (Итого_вес_3_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_вес_3_Комиссионно, 8), Формат)),'')
  if (Итого_вес_4<>0,Trim(DoubleToStr(Round(Итого_вес_4, 8), Формат)),'')
  if (Итого_вес_4_Комиссионно<>0,Trim(DoubleToStr(Round(Итого_вес_4_Комиссионно, 8), Формат)),'')
.EndFields
 Ш│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│        │ Ш
.}
.{ CheckEnter DM_Itog
.}
.}
.[f
.Fields
  if (PgSum1<>0,Trim(DoubleToStr(Round(PgSum1, 8), Формат)),'')
  if (PgSum1_Komiss<>0,Trim(DoubleToStr(Round(PgSum1_Komiss, 8), Формат)),'')
  if (PgSum2<>0,Trim(DoubleToStr(Round(PgSum2, 8), Формат)),'')
  if (PgSum2_Komiss<>0,Trim(DoubleToStr(Round(PgSum2_Komiss, 8), Формат)),'')
  if (PgSum3<>0,Trim(DoubleToStr(Round(PgSum3, 8), Формат)),'')
  if (PgSum3_Komiss<>0,Trim(DoubleToStr(Round(PgSum3_Komiss, 8), Формат)),'')
  if (PgSum4<>0,Trim(DoubleToStr(Round(PgSum4, 8), Формат)),'')
  if (PgSum4_Komiss<>0,Trim(DoubleToStr(Round(PgSum4_Komiss, 8), Формат)),'')
  UpCase(Trim(DoubleToStr(Double(PgNpp), '4')))
  if ( ((PgKol) > 0.0), UpCase(Trim(DoubleToStr(PgKol, '4 целых 5'))), '' )
.EndFields
 Ш└──────┴──────────────────────────────┴─────────┴─────┴────┴──────┴─────────┴───────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────┤
                                                                                 Итого  │&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│    X   │
                                                                                        └────────────────┴──────────────┴────────────────┴──────────────┴────────────────┴──────────────┴────────────────┴──────────────┴────────┘
    Итого по странице:
                       а) количество порядковых номеров   Е@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Е
                                                                                                                           прописью
                       б) общее количество
                          в натуральных показателях  Е@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Е
                                                                                                                              прописью Ш
.]f
.}

.Fields
  Наим_колонка_1
  Наим_колонка_2
  Наим_колонка_3
  Наим_колонка_4
  if (TotSum1<>0,Trim(DoubleToStr(Round(TotSum1, 8), Формат)),'')
  if (TotSum1_Komiss<>0,Trim(DoubleToStr(Round(TotSum1_Komiss, 8), Формат)),'')
  if (TotSum2<>0,Trim(DoubleToStr(Round(TotSum2, 8), Формат)),'')
  if (TotSum2_Komiss<>0,Trim(DoubleToStr(Round(TotSum2_Komiss, 8), Формат)),'')
  if (TotSum3<>0,Trim(DoubleToStr(Round(TotSum3, 8), Формат)),'')
  if (TotSum3_Komiss<>0,Trim(DoubleToStr(Round(TotSum3_Komiss, 8), Формат)),'')
  if (TotSum4<>0,Trim(DoubleToStr(Round(TotSum4, 8), Формат)),'')
  if (TotSum4_Komiss<>0,Trim(DoubleToStr(Round(TotSum4_Komiss, 8), Формат)),'')
  UpCase(Trim(DoubleToStr(Double(TotNpp), '4')))
  if ( ((TotKol) > 0.0), UpCase(Trim(DoubleToStr(TotKol, '4 целых 5'))), '' )
.EndFields
 Ш┌──────┬──────────────────────────────┬─────────┬──────────┬──────┬─────────┬───────────┬───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┬────────┐
│Поряд-│Наименование объектов основных│Код мате-│ Единица  │ Год  │Заводской│Инвентарный│                                           Количество драгоценных металлов, г                                                  │Предпо- │
│ковый │средств,материалов,продукции и│риалов,  │измерения │ вы-  │  номер  │   номер   ├───────────────────────────────┬───────────────────────────────┬───────────────────────────────┬───────────────────────────────┤лагаемый│
│номер │изделий,лома и отходов        │продукции┼─────┬────┤пуска │         │           │@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│  срок  │
│записи│                              │и т.д.   │наи- │Код │(изго-│         │           ├────────────────┬──────────────┼────────────────┬──────────────┼────────────────┬──────────────┼────────────────┬──────────────┤списания│
│      │                              │         │мено-│    │товле-│         │           │    по учету    │  определено  │    по учету    │  определено  │    по учету    │  определено  │    по учету    │  определено  │        │
│      │                              │         │вание│    │ ния) │         │           │   (паспорту)   │"комиссионно" │   (паспорту)   │"комиссионно" │   (паспорту)   │"комиссионно" │   (паспорту)   │"комиссионно" │        │
├──────┼──────────────────────────────┼─────────┼─────┼────┼──────┼─────────┼───────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────┤
│  1   │            2                 │    3    │  4  │ 5  │   6  │    7    │     8     │        9       │     10       │        11      │     12       │        13      │     14       │        15      │     16       │   17   │
└──────┴──────────────────────────────┴─────────┴─────┴────┴──────┴─────────┴───────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────────────┼──────────────┼────────┤
                                                                         Всего по акту  │&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│    X   │
                                                                                        └────────────────┴──────────────┴────────────────┴──────────────┴────────────────┴──────────────┴────────────────┴──────────────┴────────┘
     Итого по описи:
                       а) количество порядковых номеров   Е@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Е
                                                                                                                           прописью
                       б) общее количество
                          в натуральных показателях  Е@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Е
                                                                                                                              прописью
 Ш
.Fields
  Председатель_комиссии_Должность
  Председатель_комиссии_ФИО
.EndFields
 Ш    Председатель комиссии   Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д        __________________________________         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                       должность                                   подпись                                                                  расшифровка подписи Ш

.{While (Номер_члена_комиссии < Количество_членов_комиссии)
.begin
  Номер_члена_комиссии := Номер_члена_комиссии + 1;
end.
.fields
  if (Номер_члена_комиссии = word(1), 'Члены комиссии:', '')
  Массив_Член_комиссии_Должность [Номер_члена_комиссии]
  Массив_Член_комиссии_ФИО       [Номер_члена_комиссии]
.endfields
 Ш    @@@@@@@@@@@@@@@         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д        __________________________________         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                       должность                                   подпись                                                                  расшифровка подписи Ш

.}
.{?INTERNAL;(Количество_членов_комиссии = 0)
 Ш    Члены комиссии         __________________________________        __________________________________        _________________________________________________________________________________________________________________
                                       должность                                   подпись                                                                  расшифровка подписи

                           __________________________________        __________________________________        _________________________________________________________________________________________________________________
                                       должность                                   подпись                                                                  расшифровка подписи

                           __________________________________        __________________________________        _________________________________________________________________________________________________________________
                                       должность                                   подпись                                                                  расшифровка подписи Ш

.}
 Ш    Все ценности, поименованные в настоящей инвентаризационной описи с N                         по N                        , комиссией проверены в натуре по количеству, массе в моем (нашем) присутствии и внесены в
                                                                          ──────────────────────      ───────────────────────
    опись, в связи с чем претензий к инвентаризационной комиссии не имею(не имеем). Ценности, перечисленные в описи, находятся на моем(нашем) ответственном хранении.


    Материально ответственное(ые) лицо(а)
                                            ________________________        ________________________        _______________________________________________________________________________________
                                                   должность                         подпись                                                расшифровка подписи

                                            ________________________        ________________________        _______________________________________________________________________________________
                                                   должность                         подпись                                                расшифровка подписи

                                            ________________________        ________________________        _______________________________________________________________________________________
                                                   должность                         подпись                                                расшифровка подписи


                                                                                   "       "  _________________________            г.


    Указанные в настоящем акте данные и расчеты проверил     _________________________        ________________________        __________________________________________________________________________________________________
                                                                     должность                         подпись                                                расшифровка подписи


                                                                           "       "  _________________________            г. Ш
.EndForm

!=============================================================================
.LinkForm 'NalDrag_04' Prototype is 'NalDrag'
!=============================================================================
.NameInList 'Акт инвентаризации драгоценных металлов N ИНВ-8'
.defo landscape
.p 60
.Group '<<Россия>>'
.Create View NalDrag_04_t1
 From
  TempDescr (ReadOnly)
;
.Var
  cRec : Comp
  TotNpp : LongInt
  PgNpp  : LongInt
  TotSum1 : Double
  PgSum1  : Double
  MainItogUp   : Boolean
  MainItogDown : Boolean
  cRec_MainItogUp : Comp
  PageNumber : Comp;
.EndVar
#CommissionLinkVar
#CommissionLinkInit(NalDrag)
.Fields
  CommonFormHeader
  Наименование_организации
  ОКПО
  Подразделение
  String(PageNumber)
.EndFields
.Begin
 Var ObjectIsLastLevel : Boolean;
 ObjectIsLastLevel := False;
 ReadMyDsk(ObjectIsLastLevel, 'ObjectIsLastLevel', False);
 if (Not ObjectIsLastLevel)
 {
  Message(''#3'Для получения выбранного отчета в настройке необходимо '#13#3+
          'задать последний уровень группировки данных "Карточки ОС"'#13#3+
          '                     или "Инвентарный объект"'
         );
  NalDrag_04.fBreak;
  Exit;
 }
 else
 {
  SaveMyDsk(True, 'Inv8aForm');
  cRec := Comp(0);
  TotNpp  := 0;
  TotSum1 := 0;
  MainItogUp   := False;
  MainItogDown := False;
  cRec_MainItogUp := Comp(0);
 }
 PageNumber := Comp(2);
End.
 Ш ^
                                                                                                                                                                                           Унифицированная форма N ИНВ-8
                                                                                                                                                                                           Утверждена постановлением Госкомстата
                                                                                                                                                                                           России от 18.08.98  N 88
                                                                                                                                                                                                         ┌─────────────────────┐
                                                                                                                                                                                                         │         КОД         │
                                                                                                                                                                                                         ├─────────────────────┤
                                                                                                                                                                                           Форма по ОКУД │        0317008      │
                                                                                                                                                                                                         ├─────────────────────┤
     Е@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Е по ОКПО │@~@@@@@@@@@@@@@@@@@@@│
                                                                                                        oрганизация                                                                                      ├─────────────────────┤
     Е@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Е │                     │
                                                                                                 структурное подразделение                                                                               ├─────────────────────┤
                                                                                                                                                                                        Вид деятельности │                     │
                                                                                                                                                                                                 ┌───────┼─────────────────────┤
         Основание для проведения инвентаризации:                                             приказ,     постановление,     распоряжение                                                        │ Номер │                     │
                                                  ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼───────┼─────────────────────┤
                                                                                                       ненужное зачеркнуть                                                                       │ Дата  │                     │
                                                                                                                                                                                                 └───────┼─────────────────────┤
                                                                                                                                                                                            Вид операции │                     │
                                                                                                                                                                                                         └─────────────────────┘
                                                                                                                                           ┌───────────────────────────┬────────────────────────────┐
                                                                                                                                           │      Номер документа      │      Дата составления      │
                                                                                                                                           ├───────────────────────────┼────────────────────────────┤
                                                                                        Б                   А К Т                        Б     │                           │                            │
                                                                                                                                           └───────────────────────────┴────────────────────────────┘
                                                                                         Бинвентаризации драгоценных металлов и изделий из них Б

                                                                                                     Б Р А С П И С К А Б

              К началу проведения инвентаризации все расходные и приходные документы на драгоценные металлы и изделия из них сданы в
    бухгалтерию, и все драгоценные металлы и изделия из них, поступившие на мою (нашу) ответственность, оприходованы, а выбывшие списаны в расход.

              Материально ответственное(ые) лицо(а)
                                                            ________________________       ________________________        _____________________________________________________________________________________________________
                                                                    должность                      подпись                                                     расшифровка подписи

                                                            ________________________       ________________________        _____________________________________________________________________________________________________
                                                                    должность                      подпись                                                     расшифровка подписи

                                                            ________________________       ________________________        _____________________________________________________________________________________________________
                                                                    должность                      подпись                                                     расшифровка подписи

    Акт составлен комиссией о том, что проведена инвентаризация драгоценных металлов и изделий из них

    по состоянию на  "     " ______________________        г.

    При инвентаризации установлено следующее:













.{ CheckEnter FilterOS5
.}
.{ CheckEnter HeadCreator
.}
.{
.[h
                                                                                                                                                                                                  ^-я страница формы № ИНВ-8
.{?INTERNAL;(PageNumber=2);
                                                                                                                                                                                           ┌──────────┬────────────────────────┐
                                                                                                                                                                                           │          │   Единица измерения    │
                                                                                                                                                                                           │          ├────────────┬───────────┤
                                                                                                                                                                                           │          │наименование│код по ОКЕИ│
                                                                                                                                                                                           ├──────────┼────────────┼───────────┤
                                                                                                                                                                                           │количество│            │           │
                                                                                                                                                                                           ├──────────┼────────────┼───────────┤
                                                                                                                                                                                           │  масса   │   грамм    │    163    │
                                                                                                                                                                                           └──────────┴────────────┴───────────┘
.}
┌────────┬──────────────────────────────────────────────────────────────────────────┬──────────────────┬────────────────┬──────────────────────────────────────────────────┬───────────────────────────────────────────────────┐
│Номер по│                   Драгоценные металлы и изделия из них                   │  Размер, номер,  │   Проба или    │               Фактическое наличие                │             Числится по данным учета              │
│порядку │                                                                          │диаметр сечения и │    процент     ├────────────────┬─────────────────────────────────┼────────────────┬──────────────────────────────────┤
│        ├───────────────────────────────────────────────────────────────┬──────────┤      т.п.        │  содержания    │     коли-      │              масса              │     коли-      │              масса               │
│        │                         Наименование                          │Код(номен-│                  │  драгоценных   │     чество     ├────────────────┬────────────────┤     чество     ├────────────────┬─────────────────┤
│        │                                                               │клатурный │                  │   металлов     │                │   лигатурная   │     чистая     │                │   лигатурная   │     чистая      │
│        │                                                               │  номер)  │                  │                │                │                │                │                │                │                 │
├────────┼───────────────────────────────────────────────────────────────┼──────────┼──────────────────┼────────────────┼────────────────┼────────────────┼────────────────┼────────────────┼────────────────┼─────────────────┤
│   1    │                               2                               │     3    │         4        │       5        │       6        │       7        │       8        │       9        │       10       │        11       │
├────────┼───────────────────────────────────────────────────────────────┼──────────┼──────────────────┼────────────────┼────────────────┼────────────────┼────────────────┼────────────────┼────────────────┼─────────────────┤
.Begin
  PgSum1 := 0;
  PgNpp  := 0;
  PageNumber := PageNumber+1;
End.
.]h
.{ CheckEnter GruppaOS5
.Begin
 if (cRec_MainItogUp = Comp(0))
 {
  if (NalDrag_04_t1.GetFirst TempDescr Where (( Head_TempDescr_NRec == TempDescr.NRec )) = 0)
   if (NalDrag_04_t1.TempDescr.Level = 0)
   {
    MainItogUp := True;
    cRec_MainItogUp := NalDrag_04_t1.TempDescr.NRec
   }
 }
 else
  MainItogUp := False;
End.
.{?INTERNAL;(Not NeedPrintAsLeaf) and (Not MainItogUp);
.Begin
 cRec := Comp(0);
End.
.Fields
  Ветка
  if ( NeedSum1, Trim(DoubleToStr(Итого_верх_вес, Формат)), '')
.EndFields
│ Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б│                │                │                │                │                │                │&&&&&&&&&&&&&&&&&│
.}
.{?INTERNAL;NeedPrintAsLeaf;
.Begin
 cRec := Head_TempDescr_NRec;
End.
.}
.{ CheckEnter DM_Data
.}
.}
.{ CheckEnter NameOS5
.Begin
  PgNpp  := PgNpp  + 1;
  TotNpp := TotNpp + 1;
  PgSum1  := PgSum1  + Вес;
  TotSum1 := TotSum1 + Вес;
End.
.Fields
  TotNpp
  Верх_Наименование +' , ' + ДрагМет_наим
  Верх_Номенклатурный_номер
  Trim(DoubleToStr(Вес, Формат))
.EndFields
│@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@│                  │                │                │                │                │                │                │&&&&&&&&&&&&&&&&&│
.}
.{ CheckEnter ItogOS5
.Begin
 if (Tail_TempDescr_NRec = cRec_MainItogUp)
  MainItogDown := True;
 else
  MainItogDown := False;
End.
.{?INTERNAL;(Tail_TempDescr_NRec<>cRec)and(Not MainItogDown);
.Fields
  Итого
  Trim(DoubleToStr(Итого_вес, Формат))
.EndFields
│ Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б│                │                │                │                │                │                │&&&&&&&&&&&&&&&&&│
.}
.{ CheckEnter DM_Itog
.}
.}
.[f
.{?INTERNAL;(Not MainItogDown);
.Fields
  if (PgSum1<>0,Trim(DoubleToStr(PgSum1, Формат)),'')
.EndFields
└────────┴───────────────────────────────────────────────────────────────┴──────────┴──────────────────┴────────────────┼────────────────┼────────────────┼────────────────┼────────────────┼────────────────┼─────────────────┤
                                                                                                                 Итого  │                │                │                │                │                │&&&&&&&&&&&&&&&&&│
                                                                                                                        └────────────────┴────────────────┴────────────────┴────────────────┴────────────────┴─────────────────┘
.}
.{?INTERNAL;MainItogDown;
.Fields
  if (PgSum1<>0,Trim(DoubleToStr(PgSum1, Формат)),'')
  if (TotSum1<>0,Trim(DoubleToStr(TotSum1, Формат)),'')
.EndFields
└────────┴───────────────────────────────────────────────────────────────┴──────────┴──────────────────┴────────────────┼────────────────┼────────────────┼────────────────┼────────────────┼────────────────┼─────────────────┤
                                                                                                                 Итого  │                │                │                │                │                │&&&&&&&&&&&&&&&&&│
                                                                                                                        ├────────────────┼────────────────┼────────────────┼────────────────┼────────────────┼─────────────────┤
                                                                                                         Всего по акту  │                │                │                │                │                │&&&&&&&&&&&&&&&&&│
                                                                                                                        └────────────────┴────────────────┴────────────────┴────────────────┴────────────────┴─────────────────┘
.}
.Fields
  UpCase(Trim(DoubleToStr(Double(PgNpp), '4')))
.EndFields
    Итого по странице:
                       а) количество порядковых номеров   Е@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Е
                                                                                                                           прописью
                       б) общее количество единиц фактически  __________________________________________________________________________________________________________________________________________________________________
                                                                                                                              прописью
                       в) масса драгоценных металлов фактически:
                                                                 лигатурная  ____________________________________________________________________________________________________________________________________  г
                                                                                                                                   прописью
                                                                   чистая    ____________________________________________________________________________________________________________________________________  г
                                                                                                                                   прописью
.]f
.}

.Fields
  String(PageNumber)
  UpCase(Trim(DoubleToStr(Double(TotNpp), '4')))
.EndFields
                                                                                                                                                                                                  ^-я страница формы № ИНВ-8
     Итого по акту:
                       а) количество порядковых номеров   Е@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Е
                                                                                                                           прописью
                       б) общее количество единиц фактически  __________________________________________________________________________________________________________________________________________________________________
                                                                                                                              прописью
                       в) масса драгоценных металлов фактически:
                                                                 лигатурная  ____________________________________________________________________________________________________________________________________  г
                                                                                                                                   прописью
                                                                   чистая    ____________________________________________________________________________________________________________________________________  г
                                                                                                                                   прописью
    Все подсчеты итогов по строкам, страницам и в целом по акту проверены.


.Fields
  Председатель_комиссии_Должность
  Председатель_комиссии_ФИО
.EndFields
    Председатель комиссии   Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д        __________________________________         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                       должность                                   подпись                                                                  расшифровка подписи

.{While (Номер_члена_комиссии < Количество_членов_комиссии)
.begin
  Номер_члена_комиссии := Номер_члена_комиссии + 1;
end.
.fields
  if (Номер_члена_комиссии = word(1), 'Члены комиссии:', '')
  Массив_Член_комиссии_Должность [Номер_члена_комиссии]
  Массив_Член_комиссии_ФИО       [Номер_члена_комиссии]
.endfields
    @@@@@@@@@@@@@@@         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д        __________________________________         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                       должность                                   подпись                                                                  расшифровка подписи

.}
.{?INTERNAL;(Количество_членов_комиссии = 0)
    Члены комиссии         __________________________________        __________________________________        _________________________________________________________________________________________________________________
                                       должность                                   подпись                                                                  расшифровка подписи

                           __________________________________        __________________________________        _________________________________________________________________________________________________________________
                                       должность                                   подпись                                                                  расшифровка подписи

                           __________________________________        __________________________________        _________________________________________________________________________________________________________________
                                       должность                                   подпись                                                                  расшифровка подписи

.}

    Все ценности, поименованные в настоящем инвентаризационном акте с N                         по N                        , комиссией проверены в натуре в моем (нашем) присутствии и внесены в
                                                                          ──────────────────────      ───────────────────────
    акт, в связи с чем претензий к инвентаризационной комиссии не имею(не имеем). Ценности, перечисленные в акте, находятся на моем(нашем) ответственном хранении.


    Материально ответственное(ые) лицо(а)
                                            ________________________        ________________________        _______________________________________________________________________________________
                                                   должность                         подпись                                                расшифровка подписи

                                            ________________________        ________________________        _______________________________________________________________________________________
                                                   должность                         подпись                                                расшифровка подписи

                                            ________________________        ________________________        _______________________________________________________________________________________
                                                   должность                         подпись                                                расшифровка подписи


                                                                                   "       "  _________________________            г.


    Указанные в настоящем акте данные и расчеты проверил     _________________________        ________________________        __________________________________________________________________________________________________
                                                                     должность                         подпись                                                расшифровка подписи


                                                                           "       "  _________________________            г. Ш
.EndForm

!=============================================================================
.LinkForm 'NalDrag_05' Prototype is 'NalDrag'
!=============================================================================
.NameInList 'Инвентаризационная опись'
.defo landscape
.p 60
.Group '<<Общие>>'
.Var
  cRec : Comp
  TotNpp : LongInt
  VarHeader      : Array[1..15] of String;  // строки заголовка
  КолонкаИмя     : Array[1..15] of String;  // КолонкаИмя
  КолонкаМассаГруппИтог
  , КолонкаМассаВсего
  , КолонкаМасса : Array[1..30] of Double;  // данные по карточке (пасспорт + коммисионно)
  КолонкаНомер
  , Кол_воКол
  , i, j, k  : byte;
  Empty_3_12 : string;
.EndVar
#CommissionLinkVar
#CommissionLinkInit(NalDrag)
.Fields
  CommonFormHeader
  Наименование_организации
  DateToStr(Дата,'MONTH YYYY')
.EndFields
.Begin
 Var ObjectIsLastLevel : Boolean;
 ObjectIsLastLevel := False;
 ReadMyDsk(ObjectIsLastLevel, 'ObjectIsLastLevel', False);
 if (Not ObjectIsLastLevel)
 {
  Message(''#3'Для получения выбранного отчета в настройке необходимо '#13#3+
          'задать последний уровень группировки данных "Карточки ОС"'#13#3+
          '                     или "Инвентарный объект"'
         );
  NalDrag_05.fBreak;
  Exit;
 }
 else
 {
  SaveMyDsk(True, 'Inv8aForm');
  cRec := Comp(0);
  TotNpp  := 0;
 }
  Empty_3_12 := PadCh('',' ', 16);
End.
 Ш ^
   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
   ───────────────────────────────────────────────────────────────────────────────────────
                      (предприятие, организация, учреждение)
 Ш


                                     Инвентаризационная опись
               драгоценных металлов и драгоценных камней, содержащихся в полуфабрикатах,
                         узлах и деталях оборудования, приборах и иных изделиях,
                а также находящихся в составе любых материальных ценностей, в ломе и отходах
                                    по состоянию на ^

 Ш
.{ CheckEnter FilterOS5
.}
.{ CheckEnter HeadCreator
.Begin
  Inc(j);
  КолонкаИмя[j] := Наим_колонка;
  End.
.}
.Begin
  Кол_воКол := j;
          j := 1;
  for ( i := 1; i <= (2*Кол_воКол + 1); Inc(i))
    КолонкаМассаВсего[i] := 0;
End.
!.[h
.Begin j := 1 End.
┌──────┬───────────────────────────────────┬──────────┬──────┬────────────────────────┬
.{Horizontal margin while j <= Кол_воКол
.Fields
  '─────────────────────────────────'+ If(j = Кол_воКол, '┬', '─')
.EndFields
^
.Begin Inc(j) End.
.}
────────┐
.Begin j := 1 End.
│Поряд-│Оборудование, сырье, материалы,    │ Единица  │ Год  │          Номер         │
.{Horizontal margin while j <= Кол_воКол
.Fields
  If( Round( Кол_воКол/2 ) =  Trunc( Кол_воКол/2 ),   // четное кол-во колонок
    If( j = Round( Кол_воКол/2 ), PadCh('',' ', 17)+'Масса драгметалл',
      If( j = Round( Кол_воКол/2 )+1, 'ов в объекте, гр.'+PadCh('',' ', 17)+If(j = Кол_воКол,'│',' '),
        Empty_3_12 + ' '  + Empty_3_12 + If( j = Кол_воКол, '│', ' ' ))),
    If( j = Round( Кол_воКол/2 ), 'Масса драгметаллов в объекте, гр.'+If(j = Кол_воКол,'│',' '),
        Empty_3_12 + ' '  + Empty_3_12 + If( j = Кол_воКол, '│', ' ' )))
.EndFields
^
.Begin Inc(j) End.
.}
Предпо- │
.Begin j := 1 End.
│ковый │продукция и изделия, лом и отходы  │измерения │ вы-  ├───────────────┬────────┼
.{Horizontal margin while j <= Кол_воКол
.Fields
  '─────────────────────────────────' + If( j = Кол_воКол, '┤', '┬')
.EndFields
^
.Begin Inc(j) End.
.}
лагаемый│
.Begin j := 1 End.
│номер ├─────────────────────────┬─────────┼─────┬────┤пуска │  Инвентарный  │ Завод- │
.{Horizontal margin while j <= Кол_воКол
.Fields
  КолонкаИмя[j]
.EndFields
@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
.Begin Inc(j) End.
.}
  срок  │
.Begin j := 1 End.
│записи│      Наименование       │   Код   │наи- │Код │(изго-│               │  ской  ├
.{Horizontal margin while j <= Кол_воКол
.Fields
  '────────────────┬' + '────────────────' + If( j = Кол_воКол, '┤', '┼')
.EndFields
^
.Begin Inc(j) End.
.}
списания│
.Begin j := 1 End.
│      │                         │         │мено-│    │товле-│               │        │
.{Horizontal margin while j <= Кол_воКол
.Fields
  '    по учету    │' + '  определено    │'
.EndFields
^
.Begin Inc(j) End.
.}
        │
.Begin j := 1 End.
│      │                         │         │вание│    │ ния) │               │        │
.{Horizontal margin while j <= Кол_воКол
.Fields
  '   (паспорту)   │' + ' "комиссионно"  │'
.EndFields
^
.Begin Inc(j) End.
.}
        │
.Begin j := 1 End.
├──────┼─────────────────────────┼─────────┼─────┼────┼──────┼───────────────┼────────┼
.{Horizontal margin while j <= Кол_воКол
.Fields
  '────────────────┼────────────────┼'
.EndFields
^
.Begin Inc(j) End.
.}
────────┤
.Begin j := 1; End.
│  1   │            2            │    3    │  4  │ 5  │   6  │       7       │    8   │
.{Horizontal margin while  j <= Кол_воКол
.Fields
  LPad( 2*( j-1 ) + 9, 2)
  LPad( 2*( j-1 ) +10, 2)
.EndFields
       @@       │       @@       │
.Begin Inc(j) End.
.}
.Fields
  LPad( 2*( j-1 ) + 9, 2)
.EndFields
   @@   │
.Begin j := 1 End.
├──────┼─────────────────────────┼─────────┼─────┼────┼──────┼───────────────┼────────┼
.{Horizontal margin while j <= Кол_воКол
.Fields
  '────────────────┼────────────────┼'
.EndFields
^
.Begin Inc(j) End.
.}
────────┤
.Begin
End.
.{
.{ CheckEnter GruppaOS5
.Begin j := 1 End.
.{ CheckEnter DM_Data
.Begin
  КолонкаМасса[2*j  ]      := Итого_верх_вес_i;
  КолонкаМасса[2*j+1]      := Итого_верх_вес_i_Комиссионно;
  Inc( j );
End.
.}
.{?INTERNAL;(Not NeedPrintAsLeaf);
.Fields
  Ветка
.EndFields
.Begin j := 1 End.
  Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
.{Horizontal margin while j <= Кол_воКол
.Fields
  if (NeedSum2 and КолонкаМасса[2*j  ] <> 0, Trim(DoubleToStr(Round(КолонкаМасса[2*j  ], 8), Формат)), '')
  if (NeedSum2 and КолонкаМасса[2*j+1] <> 0, Trim(DoubleToStr(Round(КолонкаМасса[2*j+1], 8), Формат)), '')
.EndFields
 &&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&
.Begin Inc(j) End.
.}

.Begin
 cRec := Comp(0);
End.
.}
.{?INTERNAL;NeedPrintAsLeaf;
.Begin
 cRec := Head_TempDescr_NRec;

 for ( i := 1; i <= (2*Кол_воКол + 1); Inc(i))
   КолонкаМассаВсего[i] := КолонкаМассаВсего[i] + КолонкаМасса[i  ];

 TotNpp := TotNpp + 1;
End.
.Fields
  TotNpp
  Верх_Наименование
  Верх_Номенклатурный_номер
  Верх_ЕдИзмИк_Наим
  Верх_ЕдИзмИк_Код
  if (NeedDopInf=1, if (longint(Верх_дата_выпуска) > 0, String(Year(Верх_дата_выпуска), 4), ''), '')
  Верх_ИнвНомер
  Верх_заводской_номер
.EndFields
.Begin j := 1 End.
 @@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@@@@ @~@@@ @~@@ @~@@@@ @~@@@@@@@@@@@@@ @~@@@@@@
.{Horizontal margin while j <= Кол_воКол
.Fields
  if (КолонкаМасса[2*j  ] = 0, '', Trim(DoubleToStr(Round(КолонкаМасса[2*j  ], 8), Формат)))
  if (КолонкаМасса[2*j+1] = 0, '', Trim(DoubleToStr(Round(КолонкаМасса[2*j+1], 8), Формат)))
.EndFields
 &&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&
.Begin Inc(j) End.
.}
.Fields
  if ( Верх_предп_срок_списания = Date(0,0,0), '',
   String(Month(Верх_предп_срок_списания),2) + '.' + String(Year(Верх_предп_срок_списания),4) )
 .EndFields
  @~@@@@@@
.}
.}
.{ CheckEnter NameOS5
.}
.{ CheckEnter ItogOS5
.Begin j := 1 End.
.{ CheckEnter DM_Itog
.Begin
  КолонкаМассаГруппИтог[2*j  ] := Итого_вес_i;
  КолонкаМассаГруппИтог[2*j+1] := Итого_вес_i_Комиссионно;
  Inc( j );
End.
.}
.{?INTERNAL;Tail_TempDescr_NRec<>cRec;
.Fields
  Итого
.EndFields
.Begin j := 1 End.
  Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
.{Horizontal margin while j <= Кол_воКол
.Fields
  if (КолонкаМассаГруппИтог[2*j  ] = 0, '', Trim(DoubleToStr(Round(КолонкаМассаГруппИтог[2*j  ], 8), Формат)))
  if (КолонкаМассаГруппИтог[2*j+1] = 0, '', Trim(DoubleToStr(Round(КолонкаМассаГруппИтог[2*j+1], 8), Формат)))
.EndFields
 &&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&
.Begin Inc(j) End.
.}

.}
.}
.}
.Begin j := 1 End.
└─────────────────────────────────────────────────────────────────────────────────────┼
.{Horizontal margin while j <= Кол_воКол

────────────────┼────────────────┼
.Begin Inc(j) End.
.}
────────┤
.Begin j := 1 End.
                                                                      Итого по описи  │
.{Horizontal margin while j <= Кол_воКол
.Fields
  if (КолонкаМассаВсего[2*j  ] = 0, '', Trim(DoubleToStr(Round(КолонкаМассаВсего[2*j  ], 8), Формат)))
  if (КолонкаМассаВсего[2*j+1] = 0, '', Trim(DoubleToStr(Round(КолонкаМассаВсего[2*j+1], 8), Формат)))
.EndFields
&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│
.Begin Inc(j) End.
.}
    X   │
.Begin j := 1 End.
                                                                                      └
.{Horizontal margin while j <= Кол_воКол
────────────────┴────────────────┴
.Begin Inc(j) End.
.}
────────┘



.Fields
  Председатель_комиссии_Должность
  Председатель_комиссии_ФИО
.EndFields
    Председатель комиссии   Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д        __________________________________         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                       должность                                   подпись                                                                  и.о. фамилия

.{While (Номер_члена_комиссии < Количество_членов_комиссии)
.begin
  Номер_члена_комиссии := Номер_члена_комиссии + 1;
end.
.fields
  if (Номер_члена_комиссии = word(1), 'Члены комиссии:', '')
  Массив_Член_комиссии_Должность [Номер_члена_комиссии]
  Массив_Член_комиссии_ФИО       [Номер_члена_комиссии]
.endfields
    @@@@@@@@@@@@@@@         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д        __________________________________         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                       должность                                   подпись                                                                  и.о. фамилия

.}
.{?INTERNAL;(Количество_членов_комиссии = 0)
    Члены комиссии:        __________________________________        __________________________________        ______________________________________________________________________________________________________
                                       должность                                   подпись                                                                  и.о. фамилия

                           __________________________________        __________________________________        ______________________________________________________________________________________________________
                                       должность                                   подпись                                                                  и.о. фамилия

                           __________________________________        __________________________________        ______________________________________________________________________________________________________
                                       должность                                   подпись                                                                  и.о. фамилия

.}
 Ш.EndForm
!=============================================================================
.LinkForm 'NalDrag_06' Prototype is 'NalDrag'
!=============================================================================
.NameInList 'Акт инвентаризации драгоценных металлов и изделий из них № ИНВ-8а'
.defo landscape
.p 40
.Group '<<Беларусь>>'
.Create View NalDrag_06_t1
 From
  TempDescr (ReadOnly)
;
.Var
  cRec : Comp
  TotNpp : LongInt
  PgNpp  : LongInt
  TotSum1 : Double
  PgSum1  : Double
  MainItogUp   : Boolean
  MainItogDown : Boolean
  cRec_MainItogUp : Comp
  PageNumber : Comp;
.EndVar
#CommissionLinkVar
#CommissionLinkInit(NalDrag)
.Fields
  CommonFormHeader
  Наименование_организации
  DateToStr(Дата,'DD Mon YYYY')
  // ОКПО
  //Подразделение
  // String(PageNumber)
.EndFields
.Begin
 Var ObjectIsLastLevel : Boolean;
 ObjectIsLastLevel := False;
 ReadMyDsk(ObjectIsLastLevel, 'ObjectIsLastLevel', False);
 if (Not ObjectIsLastLevel)
 {
  Message(''#3'Для получения выбранного отчета в настройке необходимо '#13#3+
          'задать последний уровень группировки данных "Карточки ОС"'#13#3+
          '                     или "Инвентарный объект"'
         );
  NalDrag_06.fBreak;
  Exit;
 }
 else
 {
  SaveMyDsk(True, 'Inv8aForm');
  cRec := Comp(0);
  TotNpp  := 0;
  TotSum1 := 0;
  MainItogUp   := False;
  MainItogDown := False;
  cRec_MainItogUp := Comp(0);
 }
 PageNumber := Comp(2);
End.
 Ш ^
 И                                                                                                                                                 Приложение 2
                                                                                                                                       к Инструкции о порядке
                                                                                                                              использования, учета и хранения
                                                                                                                                       драгоценных металлов и
                                                                                                                                           драгоценных камней
                                                                                                                        Постановление МФ РБ от 15.03.2004 №34

                                                                                                                                                 Форма ИНВ-8а

 Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
 В          (предприятие, oрганизация, учреждение) В                                                                                     ┌─────────────────────┐
                                                                                                                         Код по ОКУД │                     │
 Д_________________________________________________________________ Д                                                                    └─────────────────────┘
 В        (наименование структурного подразделения) В


 Б                                                АКТ                                                                ┌───────────────────┬────────────────────┐
                                     инвентаризации  драгоценных                                                   │  Номер документа  │  Дата составления  │
                                      металлов и изделий из них                                                    ├───────────────────┼────────────────────┤
                                                                                                                   │                   │@~@@@@@@@@@@@@@@@@@@│
                                                                                                                   └───────────────────┴────────────────────┘ С
 Р



 Б                                                                          Р А С П И С К А С
 Р

К началу проведения инвентаризации все расходные и приходные документы на драгоценные металлы и изделия из них сданы в бухгалтерию и все драгоценные металлы и
изделия из них, поступившие под мою ответственность, оприходованы, а выбывшие - списаны в расход.

Материально ответственное лицо:    _________________________________   _________________   ___________________________________________________________________
 В                                            (должность)                   (подпись)                                (инициалы, фамилия) Т
 Р
На основании приказа (распоряжения) от  "____" ___________________ 20 ___ г.  № ____ проведена инвентаризация драгоценных металлов и

изделий из них по состоянию на  "____" ___________________ 20 ___ г. Р



 РПри инвентаризации установлено следующее: Р
.{ CheckEnter FilterOS5
.}
.{ CheckEnter HeadCreator
.}
.{
.[h
 Р                                                                                                                      (в граммах, с точностью до одной десятой грамма) Р
.{?INTERNAL;(PageNumber=2);

.}
 Р┌───────┬──────────────────────────────────────────────┬───────┬────────┬────────────────────────────────────────┬─────────────────────────────────────────┬───────────┐
│       │     Драгоценные металлы и изделия из них     │Размер,│ Проба  │         Фактическое наличие            │ Числится по данным бухгалтерского учета │           │
│       │                                              │ номер,│ или %  ├──────┬─────────────────────────────────┼──────┬──────────────────────────────────┤           │
│       ├───────────────────────────────────┬──────────┤диаметр│ содер- │      │              масса              │      │              масса               │           │
│   №   │                                   │  Номен-  │сечения│ жания  │      ├────────────────┬────────────────┤      ├────────────────┬─────────────────┤Расхождения│
│  п/п  │            Наименование           │клатурный │ и т.п.│ драго- │ коли-│                │                │коли- │                │                 │           │
│       │                                   │  номер   │       │ ценных │чество│   лигатурная   │     чистая     │чество│   лигатурная   │     чистая      │           │
│       │                                   │          │       │металлов│      │                │                │      │                │                 │           │
├───────┼───────────────────────────────────┼──────────┼───────┼────────┼──────┼────────────────┼────────────────┼──────┼────────────────┼─────────────────┤           │
│   1   │                 2                 │     3    │   4   │    5   │   6  │       7        │       8        │   9  │       10       │        11       │           │
├───────┼───────────────────────────────────┼──────────┼───────┼────────┼──────┼────────────────┼────────────────┼──────┼────────────────┼─────────────────┼───────────┤ Р
.Begin
  PgSum1 := 0;
  PgNpp  := 0;
  PageNumber := PageNumber+1;
End.
.]h
.{ CheckEnter GruppaOS5
.Begin
 if (cRec_MainItogUp = Comp(0))
 {
  if (NalDrag_06_t1.GetFirst TempDescr Where (( Head_TempDescr_NRec == TempDescr.NRec )) = 0)
   if (NalDrag_06_t1.TempDescr.Level = 0)
   {
    MainItogUp := True;
    cRec_MainItogUp := NalDrag_06_t1.TempDescr.NRec
   }
 }
 else
  MainItogUp := False;
End.
.{?INTERNAL;(Not NeedPrintAsLeaf) and (Not MainItogUp);
.Begin
 cRec := Comp(0);
End.
.Fields
  Ветка
  if ( NeedSum1, Trim(DoubleToStr(Итого_верх_вес, Формат)), '')
.EndFields
 Р│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│        │      │                │                │      │                │&&&&&&&&&&&&&&&&&│           │ Р
.}
.{?INTERNAL;NeedPrintAsLeaf;
.Begin
 cRec := Head_TempDescr_NRec;
End.
.}
.{ CheckEnter DM_Data
.}
.}
.{ CheckEnter NameOS5
.Begin
  PgNpp  := PgNpp  + 1;
  TotNpp := TotNpp + 1;
  PgSum1  := PgSum1  + Вес;
  TotSum1 := TotSum1 + Вес;
End.
.Fields
  TotNpp
  Верх_Наименование +' , ' + ДрагМет_наим
  Верх_Номенклатурный_номер
  Trim(DoubleToStr(Вес, Формат))
.EndFields
 Р│@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@│       │        │      │                │                │      │                │&&&&&&&&&&&&&&&&&│           │ Р
.}
.{ CheckEnter ItogOS5
.Begin
 if (Tail_TempDescr_NRec = cRec_MainItogUp)
  MainItogDown := True;
 else
  MainItogDown := False;
End.
.{?INTERNAL;(Tail_TempDescr_NRec<>cRec)and(Not MainItogDown);
.Fields
  Итого
  Trim(DoubleToStr(Итого_вес, Формат))
.EndFields
 Р│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│        │      │                │                │      │                │&&&&&&&&&&&&&&&&&│           │ Р
.}
.{ CheckEnter DM_Itog
.}
.}
.}
 Р└───────┴───────────────────────────────────┴──────────┴───────┴────────┴──────┴────────────────┴────────────────┴──────┴────────────────┴─────────────────┴───────────┘ Р
.Fields
  Председатель_комиссии_Должность
  Председатель_комиссии_ФИО
.EndFields
 Р    Председатель комиссии   Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д   __________________         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
 В                                       (должность)                   (подпись)                                   (инициалы, фамилия) Т

.{While (Номер_члена_комиссии < Количество_членов_комиссии)
.begin
  Номер_члена_комиссии := Номер_члена_комиссии + 1;
end.
.fields
  if (Номер_члена_комиссии = word(1), 'Члены комиссии:', '')
  Массив_Член_комиссии_Должность [Номер_члена_комиссии]
  Массив_Член_комиссии_ФИО       [Номер_члена_комиссии]
.endfields
 Р   @@@@@@@@@@@@@@@         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д   __________________         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
 В                                       (должность)                   (подпись)                                   (инициалы, фамилия) Т
.}
.{?INTERNAL;(Количество_членов_комиссии = 0)
 Р   Члены комиссии:         __________________________________    __________________        _____________________________________________________________
 В                                       (должность)                   (подпись)                                   (инициалы, фамилия) Т
 Р                           __________________________________    __________________        _____________________________________________________________
 В                                       (должность)                   (подпись)                                   (инициалы, фамилия) Т
 Р                           __________________________________    __________________        _____________________________________________________________
 В                                       (должность)                   (подпись)                                   (инициалы, фамилия) Т
.}
 Р   Все ценности, поименованные в настоящем инвентаризационном акте с №  ____________________  по №  ____________________   комиссией проверены в натуре в моем
   присутствии и внесены в акт, в связи с чем претензий к инвентаризационной комиссии не имею. Ценности, перечисленные в акте, находятся на моем ответственном
   хранении.

   Материально ответственное лицо: ______________________________________________

   "____"  ____________________  20 ___ г.

   Указанные в настоящем акте данные
   и подсчеты проверил               __________________________________   __________________        _____________________________________________________________
 В                                                 (должность)                   (подпись)                                   (инициалы, фамилия) Т
 Р
   "____"  ____________________  20 ___ г. Р
.EndForm
