/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1995, 2004 корпорация ГАЛАКТИКА                   ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : УКС - Управление капитальным строительством               ║
 ║ Версия        : 5.8x                                                      ║
 ║ Назначение    : Ведомости наличия МЦ в разрезе объектов строительства     ║
 ║ Ответственный : Окуневич Руслан Васильевич (RusLAN)                       ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/

#doc
Ведомости наличия МЦ в разрезе объектов строительства
#end
.Set Name = 'UksRepSaldo'
.Hide
.Fields
  dDate  sEdMode  sFilter
  sKolName sCurVal
  iIerLevel iRepLevel sGroup fGrpTotal
  sMC sBarKod sCurEd
  fKol : double
  fPrc : double
  fSum : double
  fTotal : double
.EndFields
  ^^^^^
.{
.{CheckEnter UrsHeader
  ^^^^
.}
  ^^^^^^
.}
  ^
.EndForm

!-----------------------------------------------------------------------------
#doc
Ведомости наличия МЦ в разрезе объектов строительства
#end
.LinkForm 'UksRepSaldo_01' prototype is 'UksRepSaldo'
.NameInList 'Ведомости наличия МЦ в разрезе объектов строительства'
.Group 'WithEd'
.Fields
  dDate
.EndFields

                    БВЕДОМОСТЬ САЛЬДОВЫХ ОСТАТКОВ МТР Б
                      по объектам учета запасов
                     по состоянию на ^ г.

.{?Internal;sEdMode <> ''
.Fields
  sEdMode
.EndFields
 В^ В
.}// Internal
.{?Internal;sFilter <> ''
.Fields
  sFilter
.EndFields
 ВФильтр : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ В
.}// Internal
.Fields
  sKolName : 'P:C' sCurVal : 'P:C' sCurVal : 'P:C'
  sGroup : 'T:R' fGrpTotal
  sMC sBarKod sCurEd DoubleToStr(fKol, '[|-]3666`666`666`666`666.' + PadCh('','8',wGetTune('ROUND.KOLSIGN'))) fPrc fSum
  fTotal
.EndFields
 И───────────────────────────────┬────────────┬───────────┬──────────┬───────────────┬─────────────────────
   Наименование матценности    │ Номенклат. │  Единица  │@@@@@@@@@@│    Цена в     │     Стоимость в
         (группировки)         │   номер    │ измерения │          │@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@
.{
.{CheckEnter UrsHeader
.{?Internal;iIerLevel=1
─────────────────────────────────────────────────────────────────────────────────────────────────────────
.}// Internal
 Б @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&&.&& Й
 И.}
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@ &'&&&&&&&&&&.&& &'&&&&&&&&&&&&&&&&.&&
.}
─────────────────────────────────────────────────────────────────────────────────────────────────────────
 Б ИТОГО ПО ВЕДОМОСТИ   :                                                             &'&&&&&&&&&&&&&&&&.&& Й
.EndForm


!-----------------------------------------------------------------------------
#doc
Ведомости наличия МЦ в разрезе объектов строительства
#end
.LinkForm 'UksRepSaldo_02' prototype is 'UksRepSaldo'
.NameInList 'Ведомости наличия МЦ в разрезе объектов строительства'
.Group 'WithoutEd'
.Fields
  dDate
.EndFields

                    БВЕДОМОСТЬ САЛЬДОВЫХ ОСТАТКОВ МТР Б
                      по объектам учета запасов
                     по состоянию на ^ г.

.{?Internal;sEdMode <> ''
.Fields
  sEdMode
.EndFields
 В^ В
.}// Internal
.{?Internal;sFilter <> ''
.Fields
  sFilter
.EndFields
 ВФильтр : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ В
.}// Internal
.Fields
  sKolName : 'P:C' sCurVal : 'P:C' sCurVal : 'P:C'
  sGroup : 'T:R' fGrpTotal
  sMC sBarKod DoubleToStr(fKol, '[|-]3666`666`666`666`666.' + PadCh('','8',wGetTune('ROUND.KOLSIGN'))) fPrc fSum
  fTotal
.EndFields
 И───────────────────────────────┬────────────┬──────────┬───────────────┬─────────────────────
   Наименование матценности    │ Номенклат. │@@@@@@@@@@│    Цена в     │     Стоимость в
         (группировки)         │   номер    │          │@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@
.{
.{CheckEnter UrsHeader
.{?Internal;iIerLevel=1
─────────────────────────────────────────────────────────────────────────────────────────────
.}// Internal
 Б @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&&.&& Й
 И.}
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@ @@@@@@@@@@ &'&&&&&&&&&&.&& &'&&&&&&&&&&&&&&&&.&&
.}
─────────────────────────────────────────────────────────────────────────────────────────────
 Б ИТОГО ПО ВЕДОМОСТИ   :                                                 &'&&&&&&&&&&&&&&&&.&& Й
.EndForm
