//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
//------------------------------------------------------------------------------
// Галактика 5.8 - ФРО
// Аналитическая ведомость (оборотная)
//------------------------------------------------------------------------------

// Внимание! Существует slk-отчет (копии этих присоединенных форм)

#doc
Базовая форма отчета "Аналитическая ведомость (оборотная)"
#end
.set name = 'AnFrm_Ob'
.hide
.defo LANDSCAPE

.fields
//-------------------
  PlanSchet_Capt
  MainSchet
  MainPeriod
  GroupTuneName  // наименование настройки группировки
  BuhName
//-------------------
  FilterTitle
  FilterName
//-------------------
  O_NRec       // Oborot.nRec
  O_Kol        // Oborot.Kol

  KAUName : string :'t:r'
  SumInD  SumInK
  SumD    SumK
  SumOutD SumOutK
.endfields
План счетов ^ 
Счет ^ 
Период ^
Группировка ^
Главный бухгалтер ^
.if FiltOb
.{ Ob_Filters CheckEnter
^
.{ Ob_Detail
^
.}
.}
.end
.{
.{ An_Obor
 ^ ^
 ^  ^ ^  ^ ^  ^ ^
.}
.}
.endform

.linkform 'AnFrm_Nob' prototype is 'AnFrm_Ob'
.nameinlist 'Оборотная ведомость'
.defo LANDSCAPE
.nonextheader
.fields
CommonFormHeader PlanSchet_Capt
MainSchet MainPeriod
FilterTitle FilterName
KAUName : 't:r'
SumD SumK
BuhName
.endfields
 Р^ [^]
                                           Аналитическая ведомость по счету ^
                                           @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.if FiltOb
 ВПрименен фильтр... В
.{ Ob_Filters CheckEnter
 В   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ В
.{ Ob_Detail
 В     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ В
.}
.}
.end
.{
.[H
─────────────────────────────────────────────────────────────────────────┬─────────────────────────┬────────────────────────┐
 Объект учета (по параметрам группировки)                                │          Оборот         │          Оборот        │
                                                                         │           дебет         │          кредит        │
─────────────────────────────────────────────────────────────────────────┼─────────────────────────┼────────────────────────┤
.]H
.{ An_Obor
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │&'&&&&&&&&&&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&&&&&&&&&&│
.}
.}
─────────────────────────────────────────────────────────────────────────┴─────────────────────────┴────────────────────────┘


Главный бухгалтер  ___________________   ^
                          подпись Р
.endform


//***************************************************************************
.linkform 'AnFrm_NobSaldo' prototype is 'AnFrm_Ob'
.nameinlist 'Оборотная ведомость (с учетом сальдо)'
.defo LANDSCAPE
.nonextheader
.fields
CommonFormHeader PlanSchet_Capt
MainSchet MainPeriod
FilterTitle FilterName
 KAUName : 't:r'
 SumInD  SumInK
 SumD    SumK
 SumOutD SumOutK
 BuhName
.endfields
 Р^ [^]
                                                                          Аналитическая ведомость по счету ^
                                                                          @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.if FiltOb
 ВПрименен фильтр... В
.{ Ob_Filters CheckEnter
 В   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ В
.{ Ob_Detail
 В     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ В
.}
.}
.end
.{
.[H
─────────────────────────────────────────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
                                                                         │           Сальдо входящее           │               Обороты               │           Сальдо исходящее
 Объект учета (по параметрам группировки)                                ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
                                                                         │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
─────────────────────────────────────────────────────────────────────────┼──────────────────┼──────────────────┼──────────────────┼──────────────────┼──────────────────┼──────────────────
.]H
.{ An_Obor
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │&'&&&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&&&&
.}
.}
─────────────────────────────────────────────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────


Главный бухгалтер  ___________________   ^
                          подпись Р
.endform
