! ╔═══════════════════════════════════════════════════════════════════════════╗
! ║                     (c) 1994,99 корпорация ГАЛАКТИКА                      ║
! ║ Проект        : ГАЛАКТИКА                                                 ║
! ║ Система       : Оперативный контур                                        ║
! ║ Версия        : 5.85                                                      ║
! ║ Назначение    : Акт сверки в разрезе ДО                                   ║
! ║ Ответственный : Шукан Александр Леонидович                                ║
! ╚═══════════════════════════════════════════════════════════════════════════╝
#include predefs.inc

#doc
Акт сверки в разрезе ДО
#end
.set name 'AktSvDO'
.hide
.fields
  Date1 : Date Date2 : Date
  HeaderSopr
  HeaderDir
  HeaderBuhSchet
  KontrSelfName
  KontrName
  NRecKontr
  Balans_Debet
  Balans_Kredit

  DOInfo
  DO_Debet
  DO_Kredit

  Date_Doc
  Debet_Doc
  Kredit_Doc
  DocNumber DocName DocPrim
  NameRabot SpPostavki
  _wTiDkGal // тип документа системный
  _cRec     // для платежный док-тов ссылка на BaseFin

  Itogo_Debet
  Itogo_Kredit
  Balans_End_Debet
  Balans_End_Kredit

  Director
  GlBuh
.endfields
^^
^^^
Собственная организация : ^
Контрагент : ^ ^
Входящее сальдо : ^ ^
.{
.if NeedDOInfo
 ^ ^ ^
.end
.{ AktSvDO_forDoc CheckEnter
дата : ^
общие суммы по документу ^ ^
документ : ^ ^ ^ ^ ^
тип_документа_системный ^
ссылка на документ ^
.}
.}
 ^ ^ ^ ^
 ^ ^
.endform

!
!==============================================================================
!
#doc
Beдомость расчетов по хронологии операций детальная с входящим сальдо
#end
.linkform 'AktSvDO_1' prototype is 'AktSvDO'
.nameinlist 'Test Beдомость расчетов по хронологии операций детальная с входящим сальдо'
.group '3. Подробная ведомость взаиморасчетов'
.defo landscape
.fields
  CommonFormHeader
  KontrSelfName
  KontrName
  Date1 Date2
  'сформирован ' + HeaderSopr + ' сопроводительным документам'
  'направление - ' + HeaderDir
  'Наличие оборотов по счету - ' + HeaderBuhSchet
  KontrSelfName
  KontrName
.endfields
^
 Б     АКТ СВЕРКИ
  между @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
  и @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Б  за период с @@@@@@@@@@ г. по @@@@@@@@@@ г.
  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
  ^
 Б
 Ш──────────┬─────────────────────────────────────────────────────────────┬───────────────────────────────┬──────────────────────────────┬───────────────────────────────────────┬───────────────────────────────────────
          │                                                             │                               │                              │@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
   Дата   │                         Документ                            │ Наименование МЦ, работ, услуг │ Способ поставки (через кого) ├───────────────────┬───────────────────┼───────────────────┬───────────────────
          │                                                             │                               │                              │       Дебет       │      Кредит       │       Дебет       │      Кредит
──────────┴─────────────────────────────────────────────────────────────┴───────────────────────────────┴──────────────────────────────┴───────────────────┴───────────────────┴───────────────────┴─────────────────── Ш
.fields
  Balans_Debet
  Balans_Kredit
.endfields
 Ш                                                                                                                       Входящее сальдо  &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&.&& Ш
 Ш─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Ш
.{
.fields
  DOInfo
  DO_Debet
  DO_Kredit
  Date_Doc
  DocNumber + ' ' + DocName
  NameRabot
  SpPostavki
  Debet_Doc
  Kredit_Doc
// Поменяла местами две предыдущие суммы, т.к. в данном отчете то,
// что мы выполняем, грузим и платим нашим контрагентам, порождает дебиторскую задолженность
// наших контрагентов перед нами и должно отражаться в колонке "Дебет".
// Все, что нам делают, грузят и платят наши контрагенты, порождает нашу кредиторскую
// задолженность по отношению к нашим контрагентам и должно отражаться в колонке "Кредит".
.endfields
.if NeedDOInfo
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&.&& Ш
.end
.{ AktSvDO_forDoc CheckEnter
 Щ@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&.&& Щ
.}
 Ш─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Ш
.}
.fields
  Itogo_Debet
  Itogo_Kredit
  Balans_End_Debet
  Balans_End_Kredit
  Director
  GlBuh
.endfields
 Ш   ИТОГО :                                                                                                                              &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&.&& Ш
 Ш                                                                                                                Сальдо на конец периода &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&.&& Ш
 Ш─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Ш


 Щ      Директор                           ____________________________        ^ Щ


 Щ      Главный бухгалтер                  ____________________________        ^ Щ
.endform
