//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.80 - модуль "Управление бюджетом"
// Форма печати: Центры ответственности
//------------------------------------------------------------------------------
#doc
Форма печати: Центры ответственности
#end
.set name='RepCO'
.hide
.fields
  coTab nTab
  NRec Nam Kod Abbr
  TypeCO NameType
  DirectorCO ValCO
.endfields
  ^  ^
.{CycleOfCO CheckEnter
 ^ ^ ^ ^ ^ ^ ^ ^
.}

.endform
!
!
!
.linkform 'RepCO1' prototype is 'RepCO'
.Nameinlist 'Отчет каталога центров ответствености'
.P 55
.fields
  CommonFormHeader
  Nam Kod Abbr
  TypeCO NameType
  DirectorCO ValCO

.endfields
.[H Skip
 P                                                                                                                          лист @np@ P
 P────────────────────────────────────────┬────────────┬──────┬──────────────────────┬───────────────────┬─────────────────┬─────────
              Наименование              │    Код     │ Аббр │        Тип ЦО        │ Имя в справочнике │ Руководитель ЦО │ Ден.Ед.
                                        │            │      │                      │                   │                 │
────────────────────────────────────────┼────────────┼──────┼──────────────────────┼───────────────────┼─────────────────┼───────── Р
.]H
^

 Р                                                           Каталог центров ответственности                               лист @np@
────────────────────────────────────────┬────────────┬──────┬──────────────────────┬───────────────────┬─────────────────┬─────────
              Наименование              │    Код     │ Аббр │        Тип ЦО        │ Имя в справочнике │ Руководитель ЦО │ Ден.Ед.
                                        │            │      │                      │                   │                 │
────────────────────────────────────────┼────────────┼──────┼──────────────────────┼───────────────────┼─────────────────┼───────── Р
.{CycleOfCO CheckEnter
 Р@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&&&&&│&&&&&&│@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@│@@@@@@@@@
.[F
────────────────────────────────────────┴────────────┴──────┴──────────────────────┴───────────────────┴─────────────────┴───────── Р
.]F
.}

.endform
!
!
!

