/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,2001 корпорация ГАЛАКТИКА                    ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Управление капитального строительства                     ║
 ║ Версия        : 5.8                                                       ║
 ║ Назначение    : Форма каталогов отраслей, типов, видов                    ║
 ║ Ответственный : Боровский Евгений Васильевич                              ║
 ║ Параметры     : Нет                                                       ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/

#doc
Форма каталогов отраслей, типов, видов
#end
.set name = 'kat_otv'
.hide
.fields
 namekat katnrec nazv code
.endfields
 ^
.{ ForKatalog CHECKENTER
 ^ ^ ^
.}
.endform

#doc
Форма каталогов отраслей, типов, видов
#end
.linkform 'kat_otvf' prototype is 'kat_otv'
.fields
 namekat
 nazv
 code
.endfields
            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Ш┌───────────────────────────────────────────────────────────────────────────────────┬───────────────────────┐
│                                     Наименование                                  │         Код           │
└───────────────────────────────────────────────────────────────────────────────────┴───────────────────────┘
.{ ForKatalog CHECKENTER
  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @@@@@@@@@@@@@@@@@@@@@
.}
.endform
