/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,2001 корпорация ГАЛАКТИКА                    ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Управление капитального строительства                     ║
 ║ Версия        : 5.8                                                       ║
 ║ Назначение    : Форма каталогов мест стр-ва, регистрации                  ║
 ║ Ответственный : Боровский Евгений Васильевич                              ║
 ║ Параметры     : Нет                                                       ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
#doc
Форма каталогов мест стр-ва, регистрации
#end
.set name = 'kat_place'
.hide
.fields
 namekat katnrec nazv state region rayon city indeks adres
.endfields
 ^
.{ ForKatPlace CHECKENTER
 ^ ^ ^ ^ ^ ^ ^ ^
.}
.endform

#doc
Форма каталогов мест стр-ва, регистрации
#end
.linkform 'kat_placef' prototype is 'kat_place'
.fields
 namekat nazv state region rayon city indeks adres
.endfields
                                                 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Ш┌────────────────────────────────────────────────────────┬──────────────────────────────┬──────────────────────────────┬──────────────────────────────┬────────────────────────────────┬──────┬─────────────────────────────────────────────────────────┐
│                       Наименование                     │        Государство           │           Область            │           Район              │       Населенный пункт         │Индекс│                          Адрес                          │
└────────────────────────────────────────────────────────┴──────────────────────────────┴──────────────────────────────┴──────────────────────────────┴────────────────────────────────┴──────┴─────────────────────────────────────────────────────────┘
.{ ForKatPlace CHECKENTER
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

.}
.endform
