/*
 ╔════════════════════════════════════════════════════════════════════════════╗
 ║                     (c) Корпорация ГАЛАКТИКА, 1996,2000                    ║
 ║ Проект        : ГАЛАКТИКА                                                  ║
 ║ Система       : Основные средства                                          ║
 ║ Версия        : 5.8                                                        ║
 ║ Назначение    : Инвентарная карточка (форма N ОС-6)                        ║
 ║ Ответственный : Какареко Сергей Александрович                              ║
 ╚════════════════════════════════════════════════════════════════════════════╝
*/
#include PREDEFS.INC
#doc
 Базовая форма формирования отчетов по инвентарной карточке модуля ОС (НМА).<br>
#end
.Form 'FormOS6'
!.group 'OS_Form6_Rus'
!.group 'Бюджетная организация' // во все формы этой группы добавить группу бюджетников, + когда будем выпускать на патче, в карточке написать что если у вас включена настройка бюджет... и есть свои присоеденённые формы на данном прототипе входящие в группу ... то нужно в свои присоединенные формы добавить группу если хотите чтобы они отображались при включенной данной настройке...
.group 'Бюджетная организация НМА'
!.group 'OS_Form6_Bel'
!.group 'OS_Form6_Other'
!.group 'NMA_Form6'
!.group 'NMA_Form6_Bel'
.Hide
.Fields

  Отчетный_период                        : date

  Метод_Учета
  Настройка_Метод_Учета                  : word      // 0 -стоимость за единицу, 1 -общая стоимость

  WriteDivisionOne                       : word      // Печать раздела 1
                                                     // 0 - на момент поступления
                                                     // 1 - на момент печати
  WriteOsnovOperation                    : word

  Организация_Наименование
  Организация_ОКПО

  KatOsNRec : comp
  Инвентарный_Номер
  Наименование_ОС
  Номенклатурный_Номер
  Количество_Объектов                    : double
  Десят_Знаков_Количества                : word      // Вывод десятичных знаков количества производится в зав-ти от настройки
  Стоимость                              : double    // Стоимость на текущий, момент так как она записана в текущем методе учета
  Стоимость_за_единицу                               // Стоимость за единицу
  Стоимость_Объектов                                 // Стоимость всех объектов
  Стоимость_Поступ                                   // Стоимость за единицу при поступлении
  Стоимость_Объектов_Поступ                          // Стоимость всех объектов при поступлении

  Наименование_Изготовителя
  Тип_Марка
  Подразделение
  Код_Подразделения
  Вид_деятельности                       : longint
  МОЛ_nRec                               : comp
  МОЛ                                                // Текущий МОЛ в карточке
  МОЛ_Табельный_номер
  МОЛ_Должность

  ЛОзаВК_nRec                                           : comp
  ЛОзаВК
  ЛОзаВК_Должность

  Проведенное_Поступление                : boolean
  Дата_Составления                       : date      // Дата получения
  Дата_Документа_Получения               : date
  Номер_Документа_Получения
  Стоимость_получения                    : double
  Стоимость_Объектов_Получения           : double
  Сумма_Амортизации_получения            : double
  Сумма_Амортизации_Объектов_Получения   : double
  Дата_Документа_Ввода                   : date      // Дата ввода в эксплуатацию
  Номер_Документа_Ввода
  Дата_Операции_Получения                : date
  Номер_Приказа_Получения
  Дата_Приказа_Получения                 : date

  Вид_Оборудования_ОКОФ
  Код_Оборудования_ОКОФ
  Вид_Оборудования
  Код_Оборудования
  Срок_Использования                     : double    // Срок полезного использования
  Срок_Использования_До_Поступления      : double
  Срок_Использования_При_поступлении     : double    // Срок полезного использования, установленный при поступлении
  Срок_Использования_на_заданную_дату    : double
  Норма_Амортизации                      : double
  Норма_Амортизации_расчетная            : double
  Код_Нормы_Амортизации
  Амортизационная_Группа
  Алгоритм_начисления_амортизации

  Счет                                   : string    // Счет, на который оприходовано ОС
  Субсчет                                : string
  КАУ
  Счет_Аморт                             : string    // Счет начисления амортизации
  Субсчет_Аморт                          : string
  Сумма_Износа_В_Месяц                   : double

  // Признак_Собственности   - теперь вычисляется в присоединенной форме
  Заводской_Номер
  Номер_Паспорта
  Регистрационный_Номер
  Имущественный_Номер
  Гаражный_Номер

  Сумма_Амортизации                      : double    // за единицу
  Сумма_Амортизации_Объектов                         // всех объектов
  Сумма_Амортизации_Поступ                           // за единицу при поступлении
  Сумма_Амортизации_Объектов_Поступ                  // всех объектов при поступлении
  Год_Выпуска
  Дата_Выпуска                           : date
  Дата_Документа_Выбытия
  Номер_Документа_Выбытия
  Причина_Выбытия
  Код_Причины_Выбытия
  Сумма_выручки_от_реализации            : double
  Дата_последней_начисленной_амортизации : date
  Дата_окончания_начисления              : date

!{ -- Амортизация ---------------------------------
  Амортизация_ArcIznosNRec               : comp
  Амортизация_VidNormaNRec               : comp

  Амортизация_Дата                       : date
  Амортизация_Норма                      : double
  Амортизация_СПИ                        : double    // Срок полезного использования, выводится в том виде в каком хранится в базе... Затем нужно применять настройку wGetTune('OS.SrokIspEdIzm')
  Амортизация_Сумма                      : double
  Амортизация_Накоплено                  : double
  Амортизация_SpMoveOSNRec               : comp
  Амортизация_тип_операции               : word
!}

!{ -- Переоценка ----------------------------------
  SpMoveOsNRec_Переоценка                : comp
  Дата_Переоценка                        : date
  Коэффициент_Переоценка                 : double
  Восст_Стоимость_Переоценка             : double
!}

!{ -- Операции ------------------------------------
  SpMoveOsNRec_Операции                  : comp
  Дата_Операции                          : date
  Номер_Операции
  Дата_Номер_Операции
  Тип_Операции                           : word
  Вид_Операции
  Основание_Операции
  Структ_Подраздел_Операции
  Ост_Стоимость_Операции
  МОЛ_Операции
!}

!{ -- Модернизации --------------------------------
  MoveOsNRec_Изменения                   : comp
  Mode                                   : double    // Признак модернизации - 0 модернизация, 1 - ремонт
  Основание_Документа_Изменения
  Дата_Документа_Изменения               : date
  Номер_Документа_Изменения
  Сумма_Изменения                        : double
  Инв_Номер_Изменения
!}

#ifdef __YUKOS_OSSP__
!{ -- Состав объекта ------------------------------
  OsMcNRec
  Наименование_Составляющей
  Кол_во_Составляющих                    : double
!}
#end

!{ -- Драгметаллы ---------------------------------
  NalDragNRec                            : comp
  Наименование_ДрагМеталлов                          // В цикле выводятся только поля по
  Номенклат_Номер_ДрагМеталлов                       // драгметаллам. Остальные поля таблицы выводятся
  ЕдИзм_ДрагМеталлов                                 // только один раз и на следующих
  Масса_ДрагМеталлов                     : double    // итерациях являются пустыми.
!} ------------------------------------------------

!!!! Старый цикл, только для поддержки старых форм
!{ -- Модернизации --------------------------------
  MoveOsNRec                             : comp
  Дата_Документа_Модернизации
  Номер_Документа_Модернизации
  Сумма_Модернизации
  Инв_Номер

  MoveOsNRec_Ремонт1                     : comp
  Дата_Документа_Ремонт1
  Номер_Документа_Ремонт1
  Сумма_Ремонт1
  Инв_Номер_Ремонт1

  MoveOsNRec_Ремонт2                     : comp
  Дата_Документа_Ремонт2
  Номер_Документа_Ремонт2
  Сумма_Ремонт2
  Инв_Номер_Ремонт2
  
!} ------------------------------------------------

!{ -- Характеристика объекта ----------------------
  InfoMemo
!} ------------------------------------------------

 PageBreak                               : boolean
.Endfields
! --------------------------------------------------------------------------
! Следующая строка нужна только для поддержки старого функционала,
! возможно реализованного пользователями и партнёрами.
! В формах написанных разработчиками Галактики использован новый подход,
! реализованный через объектную переменную iExcelFormat типа ExcelFormat.
#include ExcelFormat.frn
!
.var
  iExcelFormat : ExcelFormat;
.endvar
! --------------------------------------------------------------------------
.var
  Счет_Субсчет                           : string
  Счет_Субсчет_Аморт                     : string
.endvar
.{
 { *** Начало формы ***
  Отчетный_период                        - ^
  Метод_Учета                            - ^
  Настройка_Метод_Учета                  - ^
  WriteDivisionOne                       - ^
  WriteOsnovOperation                    - ^
  Организация_Наименование               - ^
  Организация_ОКПО                       - ^
  KatOsNRec                              - ^
  Инвентарный_Номер                      - ^
  Наименование_ОС                        - ^
  Номенклатурный_Номер                   - ^
  Количество_Объектов                    - ^
  Десят_Знаков_Количества                - ^
  Стоимость                              - ^
  Стоимость_за_единицу                   - ^
  Стоимость_Объектов                     - ^
  Стоимость_Поступ                       - ^
  Стоимость_Объектов_Поступ              - ^

  Наименование_Изготовителя              - ^
  Тип_Марка                              - ^
  Подразделение                          - ^
  Код_Подразделения                      - ^
  Вид_деятельности                       - ^
  МОЛ_nRec                               - ^
  МОЛ                                    - ^
  МОЛ_Табельный_номер                    - ^
  МОЛ_Должность                          - ^

  ЛОзаВК_nRec                            - ^
  ЛОзаВК                                 - ^
  ЛОзаВК_Должность                       - ^

  Проведенное_Поступление                - ^
  Дата_Составления                       - ^
  Дата_Документа_Получения               - ^
  Номер_Документа_Получения              - ^
  Стоимость_получения                    - ^
  Стоимость_Объектов_Получения           - ^
  Сумма_Амортизации_получения            - ^
  Сумма_Амортизации_Объектов_Получения   - ^
  Дата_Документа_Ввода                   - ^
  Номер_Документа_Ввода                  - ^
  Дата_Операции_Получения                - ^
  Номер_Приказа_Получения                - ^
  Дата_Приказа_Получения                 - ^

  Вид_Оборудования_ОКОФ                  - ^
  Код_Оборудования_ОКОФ                  - ^
  Вид_Оборудования                       - ^
  Код_Оборудования                       - ^
  Срок_Использования                     - ^
  Срок_Использования_До_Поступления      - ^
  Срок_Использования_При_поступлении     - ^
  Срок_Использования_на_заданную_дату    - ^
  Норма_Амортизации                      - ^
  Норма_Амортизации_расчетная            - ^
  Код_Нормы_Амортизации                  - ^
  Амортизационная_Группа                 - ^
  Алгоритм_начисления_амортизации        - ^

  Счет                                   - ^
  Субсчет                                - ^
  КАУ                                    - ^
  Счет_Аморт                             - ^
  Субсчет_Аморт                          - ^
  Сумма_Износа_В_Месяц                   - ^

  // Признак_Собственности   - теперь вычисляется в присоединенной форме
  Заводской_Номер                        - ^
  Номер_Паспорта                         - ^
  Регистрационный_Номер                  - ^
  Имущественный_Номер                    - ^
  Гаражный_Номер                         - ^

  Сумма_Амортизации                      - ^
  Сумма_Амортизации_Объектов             - ^
  Сумма_Амортизации_Поступ               - ^
  Сумма_Амортизации_Объектов_Поступ      - ^
  Год_Выпуска                            - ^
  Дата_Выпуска                           - ^
  Дата_Документа_Выбытия                 - ^
  Номер_Документа_Выбытия                - ^
  Причина_Выбытия                        - ^
  Код_Причины_Выбытия                    - ^
  Сумма_выручки_от_реализации            - ^
  Дата_последней_начисленной_амортизации - ^
  Дата_окончания_начисления              - ^

.begin
  Счет_Субсчет := Счет + ' ' + if( trim(Субсчет)='00','',Субсчет)
  Счет_Субсчет_Аморт := Счет_Аморт + ' ' + if( trim(Субсчет_Аморт)='00','',Субсчет_Аморт)
end.
   { *** Амортизация ********************************
.{ FormOS6Amortization CheckEnter
     { -- Амортизация ------------------------------- // все операции где изменяется износ(!)
       Амортизация_ArcIznosNRec          - ^
       Амортизация_VidNormaNRec          - ^

       Амортизация_Дата                  - ^
       Амортизация_Норма                 - ^
       Амортизация_СПИ                   - ^
       Амортизация_Сумма                 - ^
       Амортизация_Накоплено             - ^
       Амортизация_SpMoveOSNRec          - ^
       Амортизация_тип_операции          - ^
     } -- Амортизация -------------------------------
.}
   } *** Амортизация ********************************

   { *** Переоценка *********************************
.{ FormOS6Pereoc CheckEnter
     { -- Переоценка --------------------------------
       SpMoveOsNRec_Переоценка           - ^
       Дата_Переоценка                   - ^
       Коэффициент_Переоценка            - ^
       Восст_Стоимость_Переоценка        - ^
     } -- Переоценка --------------------------------
.}
   } *** Переоценка *********************************

   { *** Операции ***********************************
.{ FormOS6Oper CheckEnter
     { -- Операции ----------------------------------
       SpMoveOsNRec_Операции             - ^
       Дата_Операции                     - ^
       Номер_Операции                    - ^
       Дата_Номер_Операции               - ^
       Тип_Операции                      - ^
       Вид_Операции                      - ^
       Основание_Операции                - ^
       Структ_Подраздел_Операции         - ^
       Ост_Стоимость_Операции            - ^
       МОЛ_Операции                      - ^
     } -- Операции ----------------------------------
.}
   } *** Операции ***********************************

   { *** Модернизации *******************************
.{ FormOS6ModernNew CheckEnter
     { -- Модернизации ------------------------------
       MoveOsNRec_Изменения              - ^
       Mode                              - ^
       Основание_Документа_Изменения     - ^
       Дата_Документа_Изменения          - ^
       Номер_Документа_Изменения         - ^
       Сумма_Изменения                   - ^
       Инв_Номер_Изменения               - ^
     } -- Модернизации ------------------------------
.}
   } *** Модернизации *******************************

#ifdef __YUKOS_OSSP__
   { *** Состав объекта *****************************
.{ FormOS6OsMc   CheckEnter
     { -- Состав объекта ----------------------------
       OsMcNRec                          - ^
       Наименование_Составляющей         - ^
       Кол_во_Составляющих               - ^
     } -- Состав объекта ----------------------------
.}
   } *** Состав объекта *****************************
#end

   { *** Драгметаллы ********************************
.{ FormOS6Drag   CheckEnter
     { -- Драгметаллы -------------------------------
       NalDragNRec                      - ^
       Наименование_ДрагМеталлов        - ^
       Номенклат_Номер_ДрагМеталлов     - ^
       ЕдИзм_ДрагМеталлов               - ^
       Масса_ДрагМеталлов               - ^
     } ----------------------------------------------
.}
   } *** Драгметаллы ********************************

   { *** Модернизации *******************************
.{ FormOS6Modern CheckEnter
!!!! Старый цикл, только для поддержки старых форм
     { -- Модернизации ------------------------------
       MoveOsNRec                       - ^
       Дата_Документа_Модернизации      - ^
       Номер_Документа_Модернизации     - ^
       Сумма_Модернизации               - ^
       Инв_Номер                        - ^

       MoveOsNRec_Ремонт1               - ^
       Дата_Документа_Ремонт1           - ^
       Номер_Документа_Ремонт1          - ^
       Сумма_Ремонт1                    - ^
       Инв_Номер_Ремонт1                - ^

       MoveOsNRec_Ремонт2               - ^
       Дата_Документа_Ремонт2           - ^
       Номер_Документа_Ремонт2          - ^
       Сумма_Ремонт2                    - ^
       Инв_Номер_Ремонт2                - ^
     } ----------------------------------------------
.}
   } *** Модернизации *******************************

   { *** Характеристика объекта *********************
.{ FormOS6Memo   CheckEnter
     { -- Характеристика объекта --------------------
       InfoMemo                         - ^
     } ----------------------------------------------
.}
   } *** Характеристика объекта *********************

 PageBreak                              - ^
 } *** Конец формы ***
.} // Конец формы
.EndForm

.linkform 'FormOS6_Other' prototype is 'FormOS6'
.NameInList 'Инвентарная карточка (форма N ОС-6)'
.group 'OS_Form6_Other'
.group 'OS_Form6_Kaz'
.defo portrait
.Create View PrSob
 From
  ExClassVal  (ReadOnly),
  ExClassName (ReadOnly),
  ExClassSeg  (ReadOnly)
where
((
//----получаем ссылку на внешнюю классификацию------------
   word(coKatos)                   == ExClassName.wTable    and
   'Признак собственности объекта' == ExClassName.Name      and
//----получаем ссылку на сегмент вн. классификации--------
   ExClassName.ClassCode           == ExClassVal.ClassCode  and
   KatOsNRec                       == ExClassVal.cRec       and
//----получаем признак собственности----------------------
   ExClassVal.cClassSeg            == ExClassSeg.Nrec
))
;
.var
  PriznakSobstvennosty : string;
  bWasDrag : boolean // флаг того, что были выведены драгметаллы
  bWasMemo : boolean // флаг того, что была выведена доп информации
  Vid          : string;
  Kod          : string;
  wCountry     : word;
  strNDE       : string;
.endvar
#include funcOs.frn
end.  // funcOs.frn - вынес из файла чтобы не создавалась пустая строка перед формой
.begin
  bWasDrag := false;
  bWasMemo := false;
  wCountry := wGetTune('Country');
  strNDE   := sGetTune('NDE.ShortRub') + sGetTune('NDE.ShortKop');
  PriznakSobstvennosty := '';
  if (PrSob.GetFirst ExClassName = tsOK)
    if (PrSob.GetFirst ExClassVal = tsOk)
      if (PrSob.GetFirst ExClassSeg  = tsOk )
        PriznakSobstvennosty := ExClassSeg.Name;
end.
.{
.fields
  '(Метод учета: ' +Метод_Учета +')'
.endfields
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                               Типовая межотраслевая форма N ОС-6 Ш
.fields
 Инвентарный_Номер
 Организация_Наименование
 Организация_ОКПО
 strNDE
 Отчетный_период
 Дата_Документа_Получения
 Номер_Документа_Получения
 String(Количество_Объектов, 6 , byte(Десят_Знаков_Количества))
! Стоимость_Объектов
 Стоимость_Объектов_Получения
.endfields

                      Инвентарная карточка N  Д@@@@@@@@@@@@@ Д
                          учета основных средств
 Ш                                                                                                                                              ┌─────────┐ Ш
 Ш                                                                                                                                              │  Коды   │ Ш
 Ш                                                                                                                                              ├─────────┤ Ш
 Ш                                                                                                                                Форма по ОКУД │ 0306005 │ Ш
 Ш                                                                                                                                              ├─────────┤ Ш
    БОрганизация  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Е   Ш      по ОКПО │@~@@@@@@@│ Ш
 Ш                                                                                                                                              └─────────┘ Ш
 Ш                                                                                           ┌──────────┬───────────────────────────┬──────┬───────────────┐
                                                                                           │Дата сос- │ Документ на оприходование │Коли- │Первоначальная │
                                                                                           │тавления  ├──────────┬────────────────┤чество│стоимость всех │
                                                                                           │          │   дата   │     номер      │объек-│объектов,      │
                                                                                           │          │          │                │тов   │@~@@@@@@@@@@@@@│
                                                                                           ├──────────┼──────────┼────────────────┼──────┼───────────────┤
                                                                                           │@@@@@@@@@@│@@@@@@@@@@│@~@@@@@@@@@@@@@@│&&&&&&│&&&&&&&&&&&&.&&│
                                                                                           └──────────┴──────────┴────────────────┴──────┴───────────────┘ Ш
.fields
 Наименование_ОС
 Наименование_Изготовителя
 Тип_Марка
 strNDE
.endfields

 Ш     @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
     ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                           полное наименование и назначение объекта
     @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
     ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                            наименование организации-изготовителя
     @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
     ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                                      модель,тип,марка

    ┌─────────────────┬───────┬───────┬────────┬───────────────┬───────┬─────────┬─────────────────────┬─────────────────────────────┬───────────────────┐
    │   Структурное   │ Вид   │ Счет, │  Код   │ Первоначальная│ Срок  │  Норма  │        Код          │             Объект          │      Акт о        │
    │  подразделение  │ дея-  │субсчет│ анали- │  (балансовая) │полез- │амортиза-├────────┬────────────┤         (оборудование)      │     вводе в       │
    │                 │ тель- │       │ тичес- │   стоимость,  │ного   │ции,% или│нормы   │счета и объ-│                             │   эксплуатацию    │
    │                 │ ности │       │ кого   │ @~@@@@@@@@@@@ │исполь-│сметная  │аморти- │екта АУ (для├───────────────────┬─────────┼──────────┬────────┤
    │                 │       │       │ учета  │               │зования│ ставка  │зацион- │отнесения   │        вид        │   код   │   дата   │  номер │
    │                 │       │       │        │               │       │         │ных от- │амортизации │                   │         │          │        │
    │                 │       │       │        │               │       │         │числений│осн.средств)│                   │         │          │        │
    ├─────────────────┼───────┼───────┼────────┼───────────────┼───────┼─────────┼────────┼────────────┼───────────────────┼─────────┼──────────┼────────┤
    │        1        │   2   │   3   │   4    │       5       │   6   │    7    │   8    │      9     │         10        │    11   │    12    │   13   │
    ├─────────────────┼───────┼───────┼────────┼───────────────┼───────┼─────────┼────────┼────────────┼───────────────────┼─────────┼──────────┼────────┤ Ш
.begin
  if (wCountry = 0)
  {
    Vid := Вид_Оборудования_ОКОФ;
    Kod := Код_Оборудования_ОКОФ;
  }
  else
  {
    Vid := Вид_Оборудования;
    Kod := Код_Оборудования;
  }
end.
.fields
 Подразделение
 if (Вид_деятельности=0,'Осн.','Не осн.')
 Счет_Субсчет
 КАУ
 Стоимость
 SrokIspEdIzmWord (Срок_Использования)
 string(Норма_Амортизации, 10, 6)
 Код_Нормы_Амортизации
 Счет_Субсчет_Аморт
 Vid
 Kod
 Дата_Документа_Ввода
 Номер_Документа_Ввода
 strNDE
.endfields Ш
    │@@@@@@@@@@@@@@@@@│@@@@@@@│@~@@@@@│@~@@@@@@│&&&&&&&&&&&&.&&│@~@@@@@│&&.&&&&&&│@~@@@@@@│@~@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@│@~@@@@@@@│@@@@@@@@@@│@~@@@@@@│
    └─────────────────┴───────┴───────┴────────┴───────────────┴───────┴─────────┴────────┴────────────┴───────────────────┴─────────┴──────────┴────────┘
    ┌──────┬───────────────────────┬────────────┬──────┬────────────────────────────────────────────────┬────────────────────────────────────────────────┐
    │      │                       │            │      │       Содержание драгоценных материалов        │                                                │
    │При-  │        Номер          │Сумма начис-│Год   │           (металлов, камней и т.п.)            │               Выбыло (передано)                │
    │знак  ├───────┬───────┬───────┤ленной амор-│выпус-├─────────┬───────┬───────────┬──────────────────┼───────────────────┬────────────────────────────┤
    │собс- │инвен- │завод- │ пас-  │тизации,    │ка,   │наимено- │номенк-│ единица   │    количество    │   по документу    │причина выбытия(перемещения)│
    │твен- │тарный │ской   │ порта │ @~@@@@@@@@ │(пост-│вание    │латур- │измерения  │     (масса)      ├──────────┬────────┼──────────────────────┬─────┤
    │ности │       │       │       │            │ройки)│драгоцен-│ный    ├───────┬───┤                  │   дата   │ номер  │    наименование      │ код │
    │      │       │       │       │            │      │ных мате-│номер  │наиме- │код│                  │          │        │                      │     │
    │      │       │       │       │            │      │риалов   │       │нование│   │                  │          │        │                      │     │
    ├──────┼───────┼───────┼───────┼────────────┼──────┼─────────┼───────┼───────┼───┼──────────────────┼──────────┼────────┼──────────────────────┼─────┤
    │  14  │  15   │  16   │  17   │    18      │  19  │   20    │  21   │  22   │ 23│        24        │    25    │   26   │         27           │  28 │
    ├──────┼───────┼───────┼───────┼────────────┼──────┼─────────┼───────┼───────┼───┼──────────────────┼──────────┼────────┼──────────────────────┼─────┤ Ш
.fields
  if( bWasDrag, '', PriznakSobstvennosty/*Признак_Собственности*/)
  if( bWasDrag, '', Инвентарный_Номер)
  if( bWasDrag, '', Заводской_Номер)
  if( bWasDrag, '', Номер_Паспорта)
  if( bWasDrag, '', Сумма_Амортизации)
  if( bWasDrag, '', Год_Выпуска)
  Наименование_ДрагМеталлов
  Номенклат_Номер_ДрагМеталлов
  ЕдИзм_ДрагМеталлов
  Масса_ДрагМеталлов
  if( bWasDrag, '', Дата_Документа_Выбытия)
  if( bWasDrag, '', Номер_Документа_Выбытия)
  if( bWasDrag, '', Причина_Выбытия)
  if( bWasDrag, '', Код_Причины_Выбытия)
.endfields
.{ FormOS6Amortization CheckEnter
.}
.{ FormOS6Pereoc CheckEnter
.}
.{ FormOS6Oper CheckEnter
.}
.{ FormOS6ModernNew CheckEnter
.}
#ifdef __YUKOS_OSSP__
.{ FormOS6OsMc   CheckEnter
.}
#end
.{ FormOS6Drag   CheckEnter
 Ш    │@@@@@@│@@@@@@@│@@@@@@@│@@@@@@@│&&&&&&&&&.&&│ @@@@ │@@@@@@@@@│@~@@@@@│@@@@@@@│   │&&&&&.&&&&&&&&&&&&│@@@@@@@@@@│@~@@@@@@│@@@@@@@@@@@@@@@@@@@@@@│@~@@@│ Ш
.begin
  bWasDrag := true;
end.
.}
.{?INTERNAL;(not bWasDrag)
.fields
  /*Признак_Собственности*/PriznakSobstvennosty
  Инвентарный_Номер
  Заводской_Номер
  Номер_Паспорта
  Сумма_Амортизации
  Год_Выпуска
  Дата_Документа_Выбытия
  Номер_Документа_Выбытия
  Причина_Выбытия
  Код_Причины_Выбытия
.endfields
 Ш    │@@@@@@│@@@@@@@│@@@@@@@│@@@@@@@│&&&&&&&&&.&&│ @@@@ │         │       │       │   │                  │@@@@@@@@@@│@~@@@@@@│@@@@@@@@@@@@@@@@@@@@@@│@~@@@│ Ш
.}
 Ш    └──────┴───────┴───────┴───────┴────────────┴──────┴─────────┴───────┴───────┴───┴──────────────────┴──────────┴────────┴──────────────────────┴─────┘ Ш
.fields
  strNDE
  Сумма_Износа_В_Месяц
.endfields Ш
                                        ┌─────────────────┐
              Сумма износа, @@@@@@@@@@@ │&'&&&&&&&&&&&&.&&│
                                        └─────────────────┘
 Ш
.{ FormOS6Modern CheckEnter
.}
.{ FormOS6Memo   CheckEnter
.}

.}
.endform

!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------

.linkform 'FormOS6_Other2' prototype is 'FormOS6'
.NameInList 'Инвентарная карточка (форма N ОС-6) (оборотная сторона)'
.group 'OS_Form6_Other'
.group 'OS_Form6_Kaz'
.defo landscape
.var
  bWasDrag : boolean // флаг того, что были выведены драгметаллы
  bWasMemo : boolean // флаг того, что была выведена доп информации
  strNDE   : string;
.endvar
.begin
  bWasDrag := false;
  bWasMemo := false;
  strNDE   := sGetTune('NDE.ShortRub') + sGetTune('NDE.ShortKop');
end.
.{
.{ FormOS6Amortization CheckEnter
.}
.{ FormOS6Pereoc CheckEnter
.}
.{ FormOS6Oper CheckEnter
.}
.{ FormOS6ModernNew CheckEnter
.}
#ifdef __YUKOS_OSSP__
.{ FormOS6OsMc   CheckEnter
.}
#end
.{ FormOS6Drag   CheckEnter
.}
.fields
 strNDE
 strNDE
 strNDE
.endfields
 И                                                                                                      Оборотная сторона формы N ОС-6
  ┌───────────────────────────────────────────┬──────────────────────────────────────────────────────────────────────────────────────┐
  │          Достройка,дооборудование,        │                   Ремонт объекта (бухгалтерская запись)                              │
  │    реконструкция,модернизация объекта     │                                                                                      │
  │           (бухгалтерская запись)          │                                                                                      │
  ├──────────┬──────┬───────┬─────────────────┼──────────┬──────┬────────┬────────────────┬──────────┬──────┬───────┬────────────────┤
  │   дата   │номер │инвен- │  сумма затрат,  │   дата   │номер │инвен-  │ сумма затрат,  │   дата   │номер │инвен- │ сумма затрат,  │
  │          │      │тарный │  @~@@@@@@@@@@@  │          │      │тарный  │ @~@@@@@@@@@@@  │          │      │тарный │ @~@@@@@@@@@@@  │
  │          │      │номер  │                 │          │      │номер   │                │          │      │номер  │                │
  ├──────────┼──────┼───────┼─────────────────┼──────────┼──────┼────────┼────────────────┼──────────┼──────┼───────┼────────────────┤
  │    1     │  2   │    3  │        4        │    5     │  6   │   7    │       8        │     9    │  10  │   11  │       12       │
  ├──────────┼──────┼───────┼─────────────────┼──────────┼──────┼────────┼────────────────┼──────────┼──────┼───────┼────────────────┤
.fields
  Дата_Документа_Модернизации
  Номер_Документа_Модернизации
  Инв_Номер
  Сумма_Модернизации
  Дата_Документа_Ремонт1
  Номер_Документа_Ремонт1
  Инв_Номер_Ремонт1
  Сумма_Ремонт1
  Дата_Документа_Ремонт2
  Номер_Документа_Ремонт2
  Инв_Номер_Ремонт2
  Сумма_Ремонт2
.endfields
.{ FormOS6Modern CheckEnter
  │@@@@@@@@@@│@@@@@@│@~@@@@@│&&&&&&&&&&&&&&.&&│@@@@@@@@@@│@@@@@@│@~@@@@@ │&&&&&&&&&&&&&.&&│@@@@@@@@@@│@@@@@@│@~@@@@@│&&&&&&&&&&&&&.&&│
.}
  └──────────┴──────┴───────┴─────────────────┴──────────┴──────┴────────┴────────────────┴──────────┴──────┴───────┴────────────────┘
                                     ЙКраткая индивидуальная характеристика объекта Й
  ┌───────────────────────────────────────────────────┬──────────────────────────────────────────────────────────────────────────────┐
  │                                                   │         Материалы, размеры и прочие сведения                                 │
  │ Наименование конструктивных элементов и других    ├─────────────────────────┬────────────────────────────────────────────────────┤
  │       признаков,характеризующих объект            │     основной объект     │ наименование важнейших пристроек, приспособлений и │
  │                                                   │                         │ принадлежностей, относящихся к основному объекту   │
  ├───────────────────────────────────────────────────┼─────────────────────────┼────────────┬─────────────┬─────────────┬───────────┤
  │                        1                          │            2            │     3      │     4       │     5       │     6     │
  ├───────────────────────────────────────────────────┼─────────────────────────┼────────────┼─────────────┼─────────────┼───────────┤
.fields
  InfoMemo
.endFields
.{ FormOS6Memo   CheckEnter
  │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│                         │            │             │             │           │
.begin
  bWasMemo := true;
end.
.}
.{?INTERNAL;(not bWasMemo)
  ├───────────────────────────────────────────────────┼─────────────────────────┼────────────┼─────────────┼─────────────┼───────────┤
  ├───────────────────────────────────────────────────┼─────────────────────────┼────────────┼─────────────┼─────────────┼───────────┤
  ├───────────────────────────────────────────────────┼─────────────────────────┼────────────┼─────────────┼─────────────┼───────────┤
  ├───────────────────────────────────────────────────┼─────────────────────────┼────────────┼─────────────┼─────────────┼───────────┤
  ├───────────────────────────────────────────────────┼─────────────────────────┼────────────┼─────────────┼─────────────┼───────────┤
.}
  └───────────────────────────────────────────────────┴─────────────────────────┴────────────┴─────────────┴─────────────┴───────────┘

     Карточку заполнил __________________     __________________     ______________________
                          должность                подпись            расшифровка подписи

     "___" _________________ 20__ г.
 И

.}
.endform

!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------

// Новые Белоруские формы
#include Form_OS_06_Bel.frn

#include Form_NA_02_Bel.frn

// Старые Белоруские формы

!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------

.linkform 'Form_OS_06_Bel_Old' prototype is 'FormOS6'
.NameInList 'Инвентарная карточка (форма N ОС-6) << Беларусь >> (до 31.12.2004)'
.group 'OS_Form6_Bel'
.hide
.defo portrait
.var
  bWasDrag : boolean // флаг того, что были выведены драгметаллы
  bWasMemo : boolean // флаг того, что была выведена доп информации
  Vid      : string;
  Kod      : string;
  wCountry : word;
.endvar
.begin
  bWasDrag := false;
  bWasMemo := false;
  wCountry := wGetTune('Country');
end.
.{
.fields
  '(Метод учета: ' +Метод_Учета +')'
.endfields
 Ш^ Ш
.fields
  Организация_Наименование
  Организация_ОКПО
.endfields



 Р        Б  Р@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Р  Б    Типовая междуведомственная форма N ОС-6
       ───────────────────────────────────────────────────────────────────────                                   ┌─────────┐
       Код ОКПО  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                  Код по ОКУД │ 0302006 │
                                                                                                                 └─────────┘
.fields
  Инвентарный_Номер
  Дата_Документа_Получения
  Номер_Документа_Получения
  Стоимость_Объектов_Получения
  Наименование_ОС
  Наименование_Изготовителя
  Тип_Марка
.endfields
                                                                       ┌───────────────────────────────────┬─────────────────┐
        БИНВЕНТАРНАЯ КАРТОЧКА N @@@@@@@@@@@@@@@@@ Б                        │Бухгалтерская запись(акт,накладная)│ Первоначальная  │
                                                                       ├──────────┬────────────────────────┤   стоимость     │
        БУЧЕТА ОСНОВНЫХ СРЕДСТВ                   Б                        │   Дата   │          Номер         │    объектов     │
                                                                       ├──────────┼────────────────────────┼─────────────────┤
                                                                       │@@@@@@@@@@│     @@@@@@@@@@@@@@@@   │ &&&&&&&&&&&&.&& │
                                                                       └──────────┴────────────────────────┴─────────────────┘
       Б @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
      ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                              Полное наименование и назначение объекта
       @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
      ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                  наименование завода-изготовителя
       @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
      ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                            модель,тип,марка
      ┌─────────────┬────┬───────┬───────────────┬──────────────────┬──────────────┬────┬──────────────────┬─────────────────┐
      │     Цех     │Счет│  Код  │Первоначальная │       Код        │    Норма     │Попр│   Оборудование   │      Акт о      │
      │    отдел    │суб-│  А/У  │  стоимость    ├─────┬────────────┤  амортизац.  │авоч│                  │     вводе в     │
      │   участок   │счет│       │               │счета│нормы аморт.│  отчислений  │ный │                  │  эксплуатацию   │
      │    линия    │    │       │               │и объ│ отчислений ├──────────┬───┤коэф├────────────┬─────┼──────────┬──────┤
      │             │    │       │               │екта ├──────┬─────┤    на    │на │фици│    вид     │ код │   дата   │номер │
      │             │    │       │               │ А/У │  п/в │ к/р │    п/в   │к/р│ент │            │     │          │      │
      ├─────────────┼────┼───────┼───────────────┼─────┼──────┼─────┼──────────┼───┼────┼────────────┼─────┼──────────┼──────┤
.begin
  if (wCountry = 0)
  {
    Vid := Вид_Оборудования_ОКОФ;
    Kod := Код_Оборудования_ОКОФ;
  }
  else
  {
    Vid := Вид_Оборудования;
    Kod := Код_Оборудования;
  }
end.
.fields
  Подразделение
  Счет_Субсчет
  КАУ
  Стоимость
  Счет_Субсчет_Аморт
  Код_Нормы_Амортизации
  string(Норма_Амортизации, 10, 6)
  Vid
  Kod
  Дата_Документа_Ввода
  Номер_Документа_Ввода
.endfields
      │@@@@@@@@@@@@@│&&&&│@~@@@@@│&&&&&&&&&&&&.&&│&&&& │@~@@@@│     │&&&.&&&&&&│   │    │@@@@@@@@@@@@│@~@@@│@@@@@@@@@@│@@@@@@│
      └─────────────┴────┴───────┴───────────────┴─────┴──────┴─────┴──────────┴───┴────┴────────────┴─────┴──────────┴──────┘
      ┌───────────────────────────────┬──────────────┬────┬──────────────────────────────┬───────────────────────────────────┐
      │             Номер             │ Сумма износа │Год │          Драгметалл          │           Выбыло(передано)        │
      ├──────────┬─────────┬──────────┤  по данным   │выпу├──────────┬───────────────────┼──────────────────────┬────────────┤
      │  инвен-  │заводской│ паспорта │переоценки или│ска │ наимено- │       масса       │ бухгалтерская запись │  Причина   │
      │  тарный  │         │          │  документам  │    │  вание   │                   │   дата   │  номер    │  выб/пер   │
      ├──────────┼─────────┼──────────┼──────────────┼────┼──────────┼───────────────────┼──────────┼───────────┼────────────┤
.fields
  if( bWasDrag, '', Инвентарный_Номер)
  if( bWasDrag, '', Заводской_Номер)
  if( bWasDrag, '', Номер_Паспорта)
  if( bWasDrag, '', Сумма_Амортизации)
  if( bWasDrag, '', Год_Выпуска)
  Наименование_ДрагМеталлов
  Масса_ДрагМеталлов
  if( bWasDrag, '', Дата_Документа_Выбытия)
  if( bWasDrag, '', Номер_Документа_Выбытия)
  if( bWasDrag, '', Причина_Выбытия)
.endfields
.{ FormOS6Amortization CheckEnter
.}
.{ FormOS6Pereoc CheckEnter
.}
.{ FormOS6Oper CheckEnter
.}
.{ FormOS6ModernNew CheckEnter
.}
#ifdef __YUKOS_OSSP__
.{ FormOS6OsMc   CheckEnter
.}
#end
.{ FormOS6Drag   CheckEnter
      │@~@@@@@@@@│@~@@@@@@@│@~@@@@@@@@│&&&&&&&&&&&.&&│@@@@│@@@@@@@@@@│&&&&&&.&&&&&&&&&&&&│@@@@@@@@@@│@@@@@@@@@@@│@@@@@@@@@@@@│
.begin
  bWasDrag := true;
end.
.}
.{?INTERNAL;(not bWasDrag)
.fields
  Инвентарный_Номер
  Заводской_Номер
  Номер_Паспорта
  Сумма_Амортизации
  Год_Выпуска
  Дата_Документа_Выбытия
  Номер_Документа_Выбытия
  Причина_Выбытия
.endfields
      │@~@@@@@@@@│@~@@@@@@@│@~@@@@@@@@│&&&&&&&&&&&.&&│@@@@│          │                   │@@@@@@@@@@│@@@@@@@@@@@│@@@@@@@@@@@@│
.}
      └──────────┴─────────┴──────────┴──────────────┴────┴──────────┴───────────────────┴──────────┴───────────┴────────────┘

      Источник приобретения(финансирования)___________________________________________________________________________________

      ┌───────────────────────────────────────┬──────────────────────────────────────────────────────────────────────────────┐
      │      Достройка,дооборудование,        │                                    РЕМОНТ                                    │
      │    реконструкция,модернизация         │                                                                              │
      │      (бухгалтерская запись)           │                                                                              │
      ├──────────┬──────┬───────┬─────────────┼──────────┬───────┬──────────┬─────────┬──────────┬───────┬──────────┬────────┤
      │   дата   │номер │инвент.│    сумма    │   дата   │ номер │ инвент.  │ сумма   │   дата   │ номер │ инвент.  │ сумма  │
      │          │      │номер  │             │          │       │  номер   │         │          │       │  номер   │        │
      ├──────────┼──────┼───────┼─────────────┼──────────┼───────┼──────────┼─────────┼──────────┼───────┼──────────┼────────┤
.fields
  Дата_Документа_Модернизации
  Номер_Документа_Модернизации
  Инв_Номер
  Сумма_Модернизации
  Дата_Документа_Ремонт1
  Номер_Документа_Ремонт1
  Инв_Номер_Ремонт1
  Сумма_Ремонт1
  Дата_Документа_Ремонт2
  Номер_Документа_Ремонт2
  Инв_Номер_Ремонт2
  Сумма_Ремонт2
.endfields
.{ FormOS6Modern CheckEnter
      │@@@@@@@@@@│@@@@@@│@~@@@@@│&&&&&&&&&&.&&│@@@@@@@@@@│@@@@@@@│@~@@@@@@@@│&&&&&&.&&│@@@@@@@@@@│@@@@@@@│@~@@@@@@@@│&&&&&.&&│
.}
      └──────────┴──────┴───────┴─────────────┴──────────┴───────┴──────────┴─────────┴──────────┴───────┴──────────┴────────┘
 Р

 Р

                             Р  БКраткая индивидуальная характеристика объекта Р  Б

.fields
  InfoMemo
.endFields

      ┌─────────────────────────────────────────────────┬────────────────────────────────────────────────────────────────────┐
      │                                                 │             Материалы, размеры и прочие сведения                   │
      │                                                 ├───────────────────────┬────────────────────────────────────────────┤
      │    Наименование конструктивных элементов и      │                       │     Наименование важнейших пристроек       │
      │    других признаков,характеризующих объект      │    Основной объект    │     приспособлений и принадлежностей       │
      │                                                 │                       │      относящихся к основному объекту       │
      │                                                 │                       ├──────────┬───────────┬───────────┬─────────┤
.{ FormOS6Memo   CheckEnter
      ├─────────────────────────────────────────────────┼───────────────────────┼──────────┼───────────┼───────────┼─────────┤
      │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│                       │          │           │           │         │
.begin
  bWasMemo := true;
end.
.}
.{?INTERNAL;(not bWasMemo)
      ├─────────────────────────────────────────────────┼───────────────────────┼──────────┼───────────┼───────────┼─────────┤
      │                                                 │                       │          │           │           │         │
      ├─────────────────────────────────────────────────┼───────────────────────┼──────────┼───────────┼───────────┼─────────┤
      │                                                 │                       │          │           │           │         │
      ├─────────────────────────────────────────────────┼───────────────────────┼──────────┼───────────┼───────────┼─────────┤
      │                                                 │                       │          │           │           │         │
      ├─────────────────────────────────────────────────┼───────────────────────┼──────────┼───────────┼───────────┼─────────┤
      │                                                 │                       │          │           │           │         │
      ├─────────────────────────────────────────────────┼───────────────────────┼──────────┼───────────┼───────────┼─────────┤
      │                                                 │                       │          │           │           │         │
      ├─────────────────────────────────────────────────┼───────────────────────┼──────────┼───────────┼───────────┼─────────┤
      │                                                 │                       │          │           │           │         │
.}
      └─────────────────────────────────────────────────┴───────────────────────┴──────────┴───────────┴───────────┴─────────┘

       Карточку заполнил _______________________       _______________________        __________________________
                              должность                       подпись                         и.о. фамилия

       "___" _________________ 20__ г.

 Р

.}
.endform


!-----------------------------------------------------------------------------
!-----------------------------------------------------------------------------
!-----------------------------------------------------------------------------

.linkform 'OsnOC6_04' prototype is 'FormOS6'
.NameInList 'Инвентарная карточка учета НМА << Форма НМА-1 >> Россия'
.group 'NMA_Form6'
.group 'Бюджетная организация НМА'
.hide
.defo portrait
.var
  bWasMemo : boolean // флаг того, что была выведена доп информации
.endvar
#include funcOs.frn
end.  // funcOs.frn - вынес из файла чтобы не создавалась пустая строка перед формой
.begin
  bWasMemo := false;
end.
.{
.fields
  '(Метод учета: ' +Метод_Учета +')'
.endfields
 Ш^ Ш
 Р                                                                                         Типовая межотраслевая форма N НМА-1
                                                                                       Утверждена постановлением Госкомстата
                                                                                                    России от 30.10.97 N 71a Р

.fields
Инвентарный_Номер
Организация_Наименование
Организация_ОКПО
Подразделение
Дата_Документа_Получения
Номер_Документа_Получения
Наименование_ОС
.endfields



                               БКАРТОЧКА N  Д@@@@@@@@@@@@@ Д Б
                           Бучета нематериальных активов Б

 Р                                                                                                                   ┌─────────┐ Р
 Р                                                                                                                   │  Коды   │ Р
 Р                                                                                                                   ├─────────┤ Р
 Р                                                                                                     Форма по ОКУД │ 0310001 │ Р
 Р                                                                                                                   ├─────────┤ Р
 Р     Организация  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д по ОКПО │ @@@@@@@@│ Р
 Р                                                                                                                   └─────────┘ Р
 Р     Структурное подразделение  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д Р

 Р                                                                             ┌───────┬──────────┬────────────────────────────┐
                                                                             │ Дата  │ Код вида │ Документ на оприходование  │
                                                                             │состав-│ операции ├──────────┬─────────────────┤
                                                                             │ ления │          │   дата   │     номер       │
                                                                             ├───────┼──────────┼──────────┼─────────────────┤
                                                                             │       │          │@@@@@@@@@@│@@@@@@@@@@@@@@@@@│
                                                                             └───────┴──────────┴──────────┴─────────────────┘

     @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
     ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                             полное наименование и назначение объекта нематериальных активов

     ┌─────────────────┬──────────┬─────┬───────┬──────────────┬───────┬────────────┬─────────┬───────────────────┬──────────┐
     │   Структурное   │   Вид    │Счет,│Код    │Первоначальная│ Срок  │   Сумма    │  Норма  │Код счета и объекта│  Дата    │
     │  подразделение  │ деятель- │суб- │анали- │ (балансовая) │полез- │ начисленной│амортиза-│аналитического уче-│постановки│
     │                 │  ности   │счет │тичес- │  стоимость,  │ного   │амортизации,│ции,% или│та (для отнесения  │ на учет  │
     │                 │          │     │кого   │  руб.коп.    │исполь-│ руб.коп.   │сметная  │амортизации немате-│          │
     │                 │          │     │учета  │              │зования│            │ ставка  │риальных активов)  │          │
     ├─────────────────┼──────────┼─────┼───────┼──────────────┼───────┼────────────┼─────────┼───────────────────┼──────────┤
     │       1         │     2    │  3  │   4   │      5       │   6   │     7      │    8    │          9        │    10    │
     ├─────────────────┼──────────┼─────┼───────┼──────────────┼───────┼────────────┼─────────┼───────────────────┼──────────┤
.begin
end.
.fields
  Подразделение
  if (Вид_деятельности=0,'Осн.','Не осн.')
  Счет_Субсчет
  КАУ
  Стоимость
  SrokIspEdIzmWord (Срок_Использования)
  Сумма_Амортизации
  string(Норма_Амортизации_расчетная, 10, 6)
  Счет_Субсчет_Аморт
  Дата_Документа_Ввода
.endfields
     │@@@@@@@@@@@@@@@@@│ @~@@@@@@ │@@@@@│@~@@@@@│&&&&&&&&&&&.&&│@~@@@@@│&&&&&&&&&.&&│&&.&&&&&&│       @@@@        │@@@@@@@@@@│
     └─────────────────┴──────────┴─────┴───────┴──────────────┴───────┴────────────┴─────────┴───────────────────┴──────────┘


     ┌────────────────────────┬────────────────────────────┬─────────────────────────────────────────────────────────────────┐
     │                        │                            │                          Выбыло (передано)                      │
     │  Способ приобретения   │         Документ           ├───────────────────┬────────────────────────────┬────────────────┤
     │                        │       о регистрации        │    по документу   │причина выбытия(перемещения)│ сумма выручки  │
     │                        │  (наименование,номер,дата) ├────────┬──────────┼──────────────────────┬─────┤ от реализации, │
     │                        │                            │  номер │   дата   │    наименование      │ код │    руб.коп.    │
     ├────────────────────────┼────────────────────────────┼────────┼──────────┼──────────────────────┼─────┼────────────────┤
     │           11           │            12              │   13   │    14    │         15           │  16 │       17       │
     ├────────────────────────┼────────────────────────────┼────────┼──────────┼──────────────────────┼─────┼────────────────┤
.fields
  Номер_Документа_Выбытия
  Дата_Документа_Выбытия
  Причина_Выбытия
  Код_Причины_Выбытия
  Сумма_выручки_от_реализации
.endfields
     │                        │                            │@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@│@~@@@│&&&&&&&&&&&&&.&&│
     └────────────────────────┴────────────────────────────┴────────┴──────────┴──────────────────────┴─────┴────────────────┘
.fields
  Сумма_Износа_В_Месяц
.endfields


                             ┌─────────────────┐
      Сумма износа, руб.коп. │&'&&&&&&&&&&&&.&&│
                             └─────────────────┘ Р




 Р                                                                                         Оборотная сторона формы N НМА-1 Р

               БКраткая характеристика объекта нематериальных активов Б

 Р

.{ FormOS6Amortization CheckEnter
.}
.{ FormOS6Pereoc CheckEnter
.}
.{ FormOS6Oper CheckEnter
.}
.{ FormOS6ModernNew CheckEnter
.}
#ifdef __YUKOS_OSSP__
.{ FormOS6OsMc   CheckEnter
.}
#end
.{ FormOS6Drag   CheckEnter
.}
.{ FormOS6Modern CheckEnter
.}
.fields
  InfoMemo
.endFields
.{ FormOS6Memo   CheckEnter
     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
     ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.begin
  bWasMemo := true;
end.
.}
.{?INTERNAL;(not bWasMemo)

     ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

     ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

     ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

     ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

     ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

     ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

     ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

     ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

     ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

     ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

     ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

     ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

     ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}

 Р

.fields
  ЛОзаВК_Должность
  ЛОзаВК
.endfields


 И    Карточку заполнил  Д@@@@@@@@@@@@@@@@@@ Д    __________________      Д@@@@@@@@@@@@@@@@@@@@@@ Д
                         должность               подпись            расшифровка подписи

    "___" _________________ 20__ г.
 И

.}
.endform


!-----------------------------------------------------------------------------
!-----------------------------------------------------------------------------
!-----------------------------------------------------------------------------

.linkform 'FormOS6Russia' prototype is 'FormOS6'
.NameInList 'Инвентарная карточка (форма N ОС-6) <<Россия>>'
.group 'OS_Form6_Rus'
.group 'Бюджетная организация'
.hide
.defo portrait
.P 90
.var
  bWasPereoc : Boolean;  // проверка были ли мы в переоценке
  bWasOper : Boolean;    // проверка были ли мы в операциях
  Массив_Дата_Переоценка            : array[1..10] of date;
  Массив_Коэффициент_Переоценка     : array[1..10] of string;
  Массив_Восст_Стоимость_Переоценка : array[1..10] of string;
  N1 : word; // Текущий номер в цикле
  NN : word; // Количество элементов в массиве.
.endvar
#include funcOs.frn
end.  // funcOs.frn - вынес из файла чтобы не создавалась пустая строка перед формой
.fields
 '(Метод учета: ' +Метод_Учета +')'
 DateToStr(Отчетный_период,'Month YYYY')
 Center(Организация_Наименование, 65- Length(Организация_Наименование) )
 Организация_ОКПО
 Center(Подразделение, 65- Length(Подразделение) )
 Код_Оборудования_ОКОФ
 Амортизационная_Группа

 Инвентарный_Номер
 Отчетный_период

 Номер_Паспорта
 Заводской_Номер
 Инвентарный_Номер
 Center(Наименование_ОС, 60- Length(Наименование_ОС) )

 Дата_Документа_Получения
 Center(Тип_Марка, 60- Length(Тип_Марка) )
 Дата_Документа_Выбытия

 Счет_Субсчет+ ' ' + КАУ

 Center(Подразделение, 65- Length(Подразделение) )
 Center(Наименование_Изготовителя, 60- Length(Наименование_Изготовителя) )

.endfields
.{
.begin
  for (N1 := 1; N1 <= 10; N1 := N1 + 1)
  {
    Массив_Дата_Переоценка            [N1] := date(0,0,0);
    Массив_Коэффициент_Переоценка     [N1] := '';
    Массив_Восст_Стоимость_Переоценка [N1] := '';
  }
  bWasPereoc := false;
  bWasOper   := false;
  N1 := 0;
  NN := 0;
end.
 Р@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@                            Унифицированная форма № ОС-6
                                                                                                                         Утверждена
                                                                                                                     Постановлением
                                                                                                                 Госкомстата России
                                                                                                                  от 21.01.2003 № 7
                                                                                                                  ┌────────────────┐
                                                                                                                  │      Код       │
                                                                                                                  ├────────────────┤
                                                                                                    Форма по ОКУД │     0306005    │
                                                                                                                  ├────────────────┤
    Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д    по ОКПО │@~@@@@@@@@@@@@@@│
                      наименование организации                                                                    ├────────────────┤
    Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д            │                │
              наименование структурного подразделения                                                             ├────────────────┤
                                                                                                          по ОКОФ │@~@@@@@@@@@@@@@@│
                          ┌──────────────────────────┬──────────────────┐ ┌─────┬─────────────────────────────────┼────────────────┤
    Б      ИНВЕНТАРНАЯ      Б │      Номер документа     │ Дата составления │ │     │          амортизационной группы │@~@@@@@@@@@@@@@@│
    БКАРТОЧКА УЧЕТА ОБЪЕКТА Б ├──────────────────────────┼──────────────────┤ │     ├─────────────────────────────────┼────────────────┤
    Б   ОСНОВНЫХ СРЕДСТВ    Б │ @~@@@@@@@@@@@@@@@@@@@@@@ │ @~@@@@@@@@@@@@@@ │ │     │       паспорта (регистрационный)│@~@@@@@@@@@@@@@@│
                          └──────────────────────────┴──────────────────┘ │Номер├─────────────────────────────────┼────────────────┤
                                                                          │     │                       заводской │@~@@@@@@@@@@@@@@│
                                                                          │     ├─────────────────────────────────┼────────────────┤
                                                                          │     │                     инвентарный │@~@@@@@@@@@@@@@@│
                                                                          ├─────┼─────────────────────────────────┼────────────────┤
   Объект  Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│     │ принятия к бухгалтерскому учету │@~@@@@@@@@@@@@@@│
                                                                          │Дата ├─────────────────────────────────┼────────────────┤
    Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│     │ списания с бухгалтерского учета │@~@@@@@@@@@@@@@@│
                     серия, тип постройки или модель, марка               └─────┴─────────────────────────────────┼────────────────┤
                                                                          Счет, субсчет, код аналитического учета │@~@@@@@@@@@@@@@@│
                                                                                                                  └────────────────┘
                                                                                                                  ┌────────────────┐
   Место нахождения объекта основных средств  Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д │                │
                                                                                                                  └────────────────┘
   Организация-изготовитель  Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                                  наименование
.fields
 // Таблица 1
 if (longint(Дата_Выпуска) <> 0, DateToStr(Дата_Выпуска, 'DD/MM/YYYY'), '') // 01

  /*******************************************************************************************************************
   *                                                                                                                 *
   *  Комментарий к заполнению раздела "Документ о вводе в эксплуатацию" таблицы 1                                   *
   *  (т.е. к заполнению колонк 3 - 5), в форме ОС-6:                                                                *
   *  Помера ПиР: 102.59812, 101.32852, 101.34296                                                                    *
   *                                                                                                                 *
   *  1. Если есть проведенная операция поступление и в инвентарной карточке есть дата ввода в эксплуатацию,         *
   *     которая равна дате проведения операции поступления, то:                                                     *
   *     - Поле 3 "наименование" - заполняется словом "Акт";                                                         *
   *     - Поле 4 "номер"        - заполняется номером операции поступление;                                         *
   *     - Поле 3 "дата"         - заполняется датой ввода в эксплуатацию из инвентарной карточки;                   *
   *  Т.к. это соответствует ситуации, когда основное средство введено в эксплуатацию при поступлении                *
   *  (и соответственно документом на поступление)...                                                                *
   *                                                                                                                 *
   *  2. Если есть проведенная операция поступление, но и в инвентарной карточке нет даты ввода в эксплуатацию, то:  *
   *     - Поле 3 "наименование" - не заполняется;                                                                   *
   *     - Поле 4 "номер"        - не заполняется;                                                                   *
   *     - Поле 3 "дата"         - не заполняется;                                                                   *
   *  Т.к. это соответствует ситуации, когда основное средство поступило, но не введено в эксплуатацию...            *
   *                                                                                                                 *
   *  3. Если есть проведенная операция поступление и в инвентарной карточке есть дата ввода в эксплуатацию,         *
   *  но дата ввода в эксплуатацию не равна дате проведения операции поступление, то:                                *
   *     - Поле 3 "наименование" - заполняется словом "Акт";                                                         *
   *     - Поле 4 "номер"        - не заполняется;                                                                   *
   *     - Поле 3 "дата"         - заполняется датой ввода в эксплуатацию из инвентарной карточки;                   *
   *  Т.к. это соответствует ситуации, когда основное средство поступило, но введено в эксплуатацию                  *
   *  не при поступлении (и соответственно не документом на поступление)...                                          *
   *                                                                                                                 *
   *  4. Если нет проведенной операции поступления, но в инвентарной карточке есть дата ввода в эксплуатацию -       *
   * KatOs.DatEk. То это соответствует ситуации, когда ввод в эксплуататцию был, но это не было отражено операцией   *
   * поступления в Галактике. К примеру в ситуации со ставрым ОС-ом, когда ОС был преобреьтён и введен в             *
   * эксплуатацию до покупки Галактики...                                                                            *
   * Поэтому в данной ситуации:                                                                                      *
   *     - Поле 3 "наименование" - заполняется словом "Акт";                                                         *
   *     - Поле 4 "номер"        - не заполняется;                                                                   *
   *     - Поле 3 "дата"         - заполняется датой ввода в эксплуатацию из инвентарной карточки;                   *
   *                                                                                                                 *
   *******************************************************************************************************************/

 // 03
 // Выводим слово 'Акт':
 //   - В соответствии с 102.59812 и 101.32852, если:
 //     - Есть проведенная операция поступление, и в инвентарной карточке есть дата ввода в эксплуатацию.
 //     - На совпадение с датой проведения операции не проверяем...
 //   - В соответствии с 101.34296, если:
 //     - Если в инвентарной карточке есть дата ввода в эксплуатацию.
 if (LongInt(Дата_Документа_Ввода) <> 0, 'Акт','')

 // 04
 // Номер документа ввода в эксплуатацию заполняем:
 //   - В соответствии с 102.59812 и 101.32852, если:
 //     - Есть проведенная операция поступление, и в инвентарной карточке есть дата ввода в эксплуатацию,
 //       которая должна совпадать с датой проведения операции.
 //     - В противном случае не заполняем...
 if (Проведенное_Поступление
       and LongInt(Дата_Документа_Ввода) <> 0
       and Дата_Документа_Ввода = Дата_Операции_Получения,
     Номер_Документа_Ввода,'')

 // 05
 // Дату ввода в эксплуатацию заполняем:
 //   - В соответствии с 102.59812 и 101.32852, если:
 //     - Есть проведенная операция поступление, и в инвентарной карточке есть дата ввода в эксплуатацию.
 //     - На совпадение с датой проведения операции не проверяем...
 //   - В соответствии с 101.34296, если:
 //     - Если в инвентарной карточке есть дата ввода в эксплуатацию.
 if (longint(Дата_Документа_Ввода) <> 0, DateToStr(Дата_Документа_Ввода, 'DD/MM/YYYY'), '')

 // 06
 if (WriteDivisionOne = 0,
   if ((Сумма_Амортизации_получения = 0), '', SrokIspEdIzmWord (Срок_Использования_До_Поступления  ) ),
   SrokIspEdIzmWord (Срок_Использования_на_заданную_дату) )

  // 07
 if (WriteDivisionOne = 0,
   if ((Сумма_Амортизации_получения = 0), '', String(Сумма_Амортизации_получения,14,2) ),
   String(Сумма_Амортизации,14,2) )

 // 08
 if (WriteDivisionOne = 0,
   if ((Сумма_Амортизации_получения = 0), '', String((Стоимость_получения-Сумма_Амортизации_получения),13,2) ),
   String((Стоимость - Сумма_Амортизации),13,2) )

 // Таблица 2
 String(Стоимость_получения,15,2)                                                                // 01
 SrokIspEdIzmWord(Срок_Использования_При_поступлении - Срок_Использования_До_Поступления)        // 02
.endfields
                                                                                                          2. Сведения об объекте
                                                                                                          основных средств на дату
                                                                                                          принятия к бухгалтерскому
    1. Сведения об объекте основных средств на дату передачи                                              учету
   ┌─────────────────────┬─────────────────────────────────────────┬────────┬──────────────┬─────────────╥───────────────┬─────────┐
   │         Дата        │     Документ о вводе в эксплуатацию     │ Факти- │ Сумма начис- │ Остаточная  ║ Первоначальная│  Срок   │
   ├──────────┬──────────┼───────────────────┬──────────┬──────────┤ ческий │ ленной амор- │ стоимость,  ║ стоимость на  │ полез-  │
   │ выпуска  │последнего│                   │          │          │  срок  │    тизации   │    руб.     ║ дату принятия │  ного   │
   │ (пост-   │ капремон-│    наименование   │  номер   │   дата   │  экс-  │   (износа),  │             ║ к бухгалтерс- │ исполь- │
   │  ройки)  │та, модер-│                   │          │          │  плуа- │     руб.     │             ║  кому учету,  │ зования │
   │          │ низации, │                   │          │          │ тации  │              │             ║      руб.     │         │
   │          │  рекон-  │                   │          │          │        │              │             ║               │         │
   │          │ струкции │                   │          │          │        │              │             ║               │         │
   ├──────────┼──────────┼───────────────────┼──────────┼──────────┼────────┼──────────────┼─────────────╢───────────────┼─────────┤
   │     1    │     2    │         3         │     4    │     5    │    6   │       7      │      8      ║       1       │    2    │
   ├──────────┼──────────┼───────────────────┼──────────┼──────────┼────────┼──────────────┼─────────────╢───────────────┼─────────┤
   │@~@@@@@@@@│          │@~@@@@@@@@@@@@@@@@@│@~@@@@@@@@│@~@@@@@@@@│&&&&&&&&│&&&&&&&&&&&&&&│&&&&&&&&&&&&&║&&&&&&&&&&&&&&&│@@@@@@@@@│
   └──────────┴──────────┴───────────────────┴──────────┴──────────┴────────┴──────────────┴─────────────╨───────────────┴─────────┘
.{ FormOS6Amortization CheckEnter
.}
.{ FormOS6Pereoc CheckEnter
.begin
  N1:=N1+1;
  Массив_Дата_Переоценка           [N1] := Дата_Переоценка;
  Массив_Коэффициент_Переоценка    [N1] := String(Коэффициент_Переоценка    ,10,4);
  Массив_Восст_Стоимость_Переоценка[N1] := String(Восст_Стоимость_Переоценка,15,2);
end.
.}
.begin
  NN := N1;
  N1 := 1;
end.
    3. Переоценка
   ┌──────────┬──────────────┬────────────────╥──────────┬──────────────┬────────────────╥──────────┬─────────────┬────────────────┐
   │   Дата   │ Коэффициент  │  Восстанови-   ║   Дата   │ Коэффициент  │  Восстанови-   ║   Дата   │ Коэффициент │  Восстанови-   │
   │          │  пересчета   │    тельная     ║          │  пересчета   │    тельная     ║          │  пересчета  │    тельная     │
   │          │ (переоценки) │ стоимость,руб. ║          │ (переоценки) │ стоимость,руб. ║          │ (переоценки)│ стоимость,руб. │
   ├──────────┼──────────────┼────────────────╫──────────┼──────────────┼────────────────╫──────────┼─────────────┼────────────────┤
   │     1    │      2       │        3       ║     1    │      2       │        3       ║     1    │      2      │        3       │
   ├──────────┼──────────────┼────────────────╫──────────┼──────────────┼────────────────╫──────────┼─────────────┼────────────────┤
.{WHILE N1<=NN
.fields
  if (Longint(Массив_Дата_Переоценка [N1])<>0,DateToStr(Массив_Дата_Переоценка [N1], 'DD/MM/YYYY'),'')
  Массив_Коэффициент_Переоценка    [N1]
  Массив_Восст_Стоимость_Переоценка[N1]
  if (Longint(Массив_Дата_Переоценка [N1+1])<>0,DateToStr(Массив_Дата_Переоценка [N1+1], 'DD/MM/YYYY'),'')
  Массив_Коэффициент_Переоценка    [N1+1]
  Массив_Восст_Стоимость_Переоценка[N1+1]
  if (Longint(Массив_Дата_Переоценка [N1+2])<>0,DateToStr(Массив_Дата_Переоценка [N1+2], 'DD/MM/YYYY'),'')
  Массив_Коэффициент_Переоценка    [N1+2]
  Массив_Восст_Стоимость_Переоценка[N1+2]
.endfields
   │@@@@@@@@@@│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&║@@@@@@@@@@│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&║@@@@@@@@@@│&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&│
.begin
  N1 :=N1+3;
  bWasPereoc := true;
end.
.}
.{?INTERNAL;(not bWasPereoc)
   ├──────────┼──────────────┼────────────────╫──────────┼──────────────┼────────────────╫──────────┼─────────────┼────────────────┤
   ├──────────┼──────────────┼────────────────╫──────────┼──────────────┼────────────────╫──────────┼─────────────┼────────────────┤
   ├──────────┼──────────────┼────────────────╫──────────┼──────────────┼────────────────╫──────────┼─────────────┼────────────────┤
.}
   └──────────┴──────────────┴────────────────╨──────────┴──────────────┴────────────────╨──────────┴─────────────┴────────────────┘
    4. Сведения о приемке, внутренних перемещениях, выбытии (списании) объекта основных средств
   ┌───────────────────────┬───────────────────────┬─────────────────────────────────┬────────────────┬────────────────────────────┐
   │ Документ, дата, номер │     Вид операции      │   Наименование структурного     │   Остаточная   │  Фамилия, инициалы лица,   │
   │                       │                       │          подразделения          │ стоимость, руб.│ ответственного за хранение │
   ├───────────────────────┼───────────────────────┼─────────────────────────────────┼────────────────┼────────────────────────────┤
   │           1           │           2           │                3                │        4       │              5             │
   ├───────────────────────┼───────────────────────┼─────────────────────────────────┼────────────────┼────────────────────────────┤
.{ FormOS6Oper CheckEnter
.fields
  /*********************************************************************************************************************************
   *                                                                                                                               *
   *  01 "Документ, дата, номер"                                                                                                   *
   *                                                                                                                               *
   *  - При наличии проведенной операций - поступление или выбытие, в начале выводится слова "Акт", а затем дата проведения        *
   *  операции и при наличии номер операции;                                                                                       *
   *  - При наличии проведенной операции - внутреннее перемещение, в начале выводится слово "Накладная", а затем дата проведения   *
   *  операции и и при наличии номер операции;                                                                                     *
   *                                                                                                                               *
   *********************************************************************************************************************************/
  Дата_Номер_Операции

  Вид_Операции
  Структ_Подраздел_Операции
  Ост_Стоимость_Операции
  МОЛ_Операции
.endfields
   │@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&&&&&&.&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
.begin
  bWasOper := true;
end.
.}
.{?INTERNAL;(not bWasOper)
   ├───────────────────────┼───────────────────────┼─────────────────────────────────┼────────────────┼────────────────────────────┤
   ├───────────────────────┼───────────────────────┼─────────────────────────────────┼────────────────┼────────────────────────────┤
   ├───────────────────────┼───────────────────────┼─────────────────────────────────┼────────────────┼────────────────────────────┤
.}
   └───────────────────────┴───────────────────────┴─────────────────────────────────┴────────────────┴────────────────────────────┘
   Справочно: Участники долевой собственности                                                  ┌──────────────────┬────────────────┐
                                                                                               │Доля в праве общей│                │
              ─────────────────────────────────────────────────────────────────────────────────│собственности, %  ├────────────────┤
                                                                                               │                  │                │
              ─────────────────────────────────────────────────────────────────────────────────└──────────────────┴────────────────┘
 Р
.{ FormOS6ModernNew CheckEnter
.}
#ifdef __YUKOS_OSSP__
.{ FormOS6OsMc   CheckEnter
.}
#end
.{ FormOS6Drag   CheckEnter
.}
.{ FormOS6Modern CheckEnter
.}
.{ FormOS6Memo   CheckEnter
.}

.}
.endform

.linkform 'FormOS6Russia2' prototype is 'FormOS6'
.NameInList 'Инвентарная карточка (форма N ОС-6) <<Россия>> (оборотная сторона)'
.group 'OS_Form6_Rus'
.group 'Бюджетная организация'
.hide
.defo landscape
.P 60
.var
  bWasFormOS6Modern : boolean // флаг того, что была выведена FormOS6Modern
  bWasMemo          : boolean // флаг того, что была выведена доп информации

  Массив_Основание_Документа_Модернизации : array[1..10] of string;
  Массив_Дата_Документа_Модернизации  : array[1..10] of string;
  Массив_Номер_Документа_Модернизации : array[1..10] of string;
  Массив_Сумма_Модернизации           : array[1..10] of string;

  Массив_Основание_Документа_Ремонт1  : array[1..10] of string;
  Массив_Дата_Документа_Ремонт1       : array[1..10] of string;
  Массив_Номер_Документа_Ремонт1      : array[1..10] of string;
  Массив_Сумма_Ремонт1                : array[1..10] of string;

  Массив_Наименование_Объекта         : array[1..10] of string;
  Массив_Количество_Объектов          : array[1..10] of string;
  Массив_Наименование_ДрагМеталлов    : array[1..10] of string;
  Массив_Номенклат_Номер_ДрагМеталлов : array[1..10] of string;
  Массив_ЕдИзм_ДрагМеталлов           : array[1..10] of string;
  Массив_Масса_ДрагМеталлов           : array[1..10] of string;
  Массив_ИнфоМемо                     : array[1..10] of string;

  N1 : word; // Текущий номер в цикле Модернизации
  N2 : word; // Текущий номер в цикле Ремонта
  N3 : word; // Текущий номер в наименованиях объекта и составляющих
  NN : word; // Количество элементов в массиве.
.endvar
.{
.begin
  for (N1 := 1; N1 <= Count(Массив_Дата_Документа_Модернизации); N1 := N1 + 1)
  {
    Массив_Основание_Документа_Модернизации [N1]:= '';
    Массив_Дата_Документа_Модернизации  [N1]:= '';
    Массив_Номер_Документа_Модернизации [N1]:= '';
    Массив_Сумма_Модернизации           [N1]:= '';
  }
  for (N1 := 1; N1 <= Count(Массив_Дата_Документа_Ремонт1); N1 := N1 + 1)
  {
    Массив_Основание_Документа_Ремонт1  [N1]:= '';
    Массив_Дата_Документа_Ремонт1       [N1]:= '';
    Массив_Номер_Документа_Ремонт1      [N1]:= '';
    Массив_Сумма_Ремонт1                [N1]:= '';
  }
  for (N1 := 1; N1 <= Count(Массив_Наименование_Объекта); N1 := N1 + 1)
  {
    Массив_Наименование_Объекта         [N1]:= '';
    Массив_Количество_Объектов          [N1]:= '';
  }
  for (N1 := 1; N1 <= Count(Массив_Наименование_ДрагМеталлов); N1 := N1 + 1)
  {
    Массив_Наименование_ДрагМеталлов    [N1]:= '';
    Массив_Номенклат_Номер_ДрагМеталлов [N1]:= '';
    Массив_ЕдИзм_ДрагМеталлов           [N1]:= '';
    Массив_Масса_ДрагМеталлов           [N1]:= '';
  }
  for (N1 := 1; N1 <= Count(Массив_ИнфоМемо); N1 := N1 + 1)
  {
    Массив_ИнфоМемо                     [N1]:= '';
  }
  bWasFormOS6Modern := false;
  bWasMemo          := false;
  N1 := 0;
  N2 := 0;
  N3 := 0;
  NN := 0;
end.
.{ FormOS6Amortization CheckEnter
.}
.{ FormOS6Pereoc CheckEnter
.}
.{ FormOS6Oper CheckEnter
.}
                                                                                Оборотная сторона формы № ОС-6

  5. Изменения первоначальной стоимости объекта           6. Затраты на ремонт
  основных средств
  ┌─────────────────────────────────────────────────────╥─────────────────────────────────────────────────────┐
  │      Реконструкция, достройка, дооборудование,      ║                        Ремонт                       │
  │         частичная ликвидация, модернизация          ║                                                     │
  ├──────┬─────────────────────────────────┬────────────╫──────┬─────────────────────────────────┬────────────┤
  │ вид  │             документ            │сумма затрат║ вид  │             документ            │сумма затрат│
  │опера-├────────────┬──────────┬─────────┤    руб.    ║ремон-├────────────┬──────────┬─────────┤    руб.    │
  │ ции  │наименование│   дата   │  номер  │            ║  та  │наименование│   дата   │  номер  │            │
  ├──────┼────────────┼──────────┼─────────┼────────────╫──────┼────────────┼──────────┼─────────┼────────────┤
  │  1   │      2     │    3     │    4    │     5      ║  1   │      2     │    3     │    4    │     5      │
  ├──────┼────────────┼──────────┼─────────┼────────────╫──────┼────────────┼──────────┼─────────┼────────────┤
.{ FormOS6ModernNew CheckEnter
.begin
   if (Mode = 0)// Модернизация
   {
     N1:=N1+1;
     Массив_Основание_Документа_Модернизации[N1] := Основание_Документа_Изменения;
     Массив_Дата_Документа_Модернизации[N1]      := Дата_Документа_Изменения;
     Массив_Номер_Документа_Модернизации[N1]     := Номер_Документа_Изменения;
     Массив_Сумма_Модернизации[N1]               := String(Сумма_Изменения,12,2);
   }
   else
   {
     N2:=N2+1;
     Массив_Основание_Документа_Ремонт1[N2]      := Основание_Документа_Изменения;
     Массив_Дата_Документа_Ремонт1[N2]           := Дата_Документа_Изменения;
     Массив_Номер_Документа_Ремонт1[N2]          := Номер_Документа_Изменения;
     Массив_Сумма_Ремонт1[N2]                    := String(Сумма_Изменения,12,2);
   }
end.
.}
.begin
  if N2 > N1 NN := N2;
  else NN := N1;
  N1 :=0;
end.
.{WHILE N1<NN
.begin
 N1 :=N1+1;
end.
.fields
  Массив_Основание_Документа_Модернизации[N1] // Основание_Документа_Изменения
  Массив_Дата_Документа_Модернизации[N1]
  Массив_Номер_Документа_Модернизации[N1]
  Массив_Сумма_Модернизации[N1]

  Массив_Основание_Документа_Ремонт1[N1]      // Основание_Документа_Изменения
  Массив_Дата_Документа_Ремонт1[N1]
  Массив_Номер_Документа_Ремонт1[N1]
  Массив_Сумма_Ремонт1[N1]
.endfields
  │      │@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&&&│&&&&&&&&&&&&║      │@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&&&│&&&&&&&&&&&&│
.begin
  bWasFormOS6Modern := true;
end.
.}
.{?INTERNAL;(not bWasFormOS6Modern)
  │      │            │          │         │            ║      │            │          │         │            │
  ├──────┼────────────┼──────────┼─────────┼────────────╫──────┼────────────┼──────────┼─────────┼────────────┤
  │      │            │          │         │            ║      │            │          │         │            │
  ├──────┼────────────┼──────────┼─────────┼────────────╫──────┼────────────┼──────────┼─────────┼────────────┤
  │      │            │          │         │            ║      │            │          │         │            │
  ├──────┼────────────┼──────────┼─────────┼────────────╫──────┼────────────┼──────────┼─────────┼────────────┤
  │      │            │          │         │            ║      │            │          │         │            │
.}
  └──────┴────────────┴──────────┴─────────┴────────────╨──────┴────────────┴──────────┴─────────┴────────────┘
.begin
  N1 := 0;
  N2 := 0;
  N3 := 0;
  NN := 0;
end.
.begin
  N3 := N3 + 1;
  Массив_Наименование_Объекта [N3] := string(Наименование_ОС);
  Массив_Количество_Объектов  [N3] := string(Количество_Объектов,6,Десят_Знаков_Количества);
end.
#ifdef __YUKOS_OSSP__
.{ FormOS6OsMc   CheckEnter
.begin
  N3 := N3 + 1;
  Массив_Наименование_Объекта [N3] := string(Наименование_Составляющей);
  Массив_Количество_Объектов  [N3] := string(Кол_во_Составляющих,6,Десят_Знаков_Количества);
end.
.}
#end
.{ FormOS6Drag   CheckEnter
.begin
  N1:=N1+1;
  Массив_Наименование_ДрагМеталлов   [N1] := Наименование_ДрагМеталлов   ;
  Массив_Номенклат_Номер_ДрагМеталлов[N1] := Номенклат_Номер_ДрагМеталлов;
  Массив_ЕдИзм_ДрагМеталлов          [N1] := ЕдИзм_ДрагМеталлов          ;
  Массив_Масса_ДрагМеталлов          [N1] := string(Масса_ДрагМеталлов, 17, 12);
end.
.}
.{ FormOS6Modern CheckEnter
.}
.{ FormOS6Memo   CheckEnter
.begin
  N2:=N2+1;
  Массив_ИнфоМемо[N2] := InfoMemo;
end.
.}

  7. Краткая индивидуальная характеристика объекта основных средств
 Р    ┌────────────────────────────────┬────────────────────────────────────────────────────────┬───────────────────────────────────┬─────────────────────────────────────────────────┬───────┐
    │  Объект основных средств,при-  │    Содержание драгоценных и/или полудрагоценных        │Наименование конструктивных элемен-│   Качественные и количественные характеристики  │ Приме-│
    │  cпособления, принадлежности   │        материалов (металлов, камней и  т.д.)           │тов и других признаков, характери- │            (размеры, прочие сведения)           │ чание │
    ├─────────────────────────┬──────┼──────────────┬────────┬───────┬─────┬──────────────────┤           зующих объект           ├─────────┬───────────────────────────────────────┤       │
    │      наименование       │коли- │ наименование │номенк- │единица│коли-│      масса       │                                   │основного│   приспособлений, принадлежностей,    │       │
    │                         │чество│ драгоценных  │латурный│измере-│чест-│                  │                                   │ объекта │     пристроенных помещений и др.      │       │
    │                         │      │ и/или полу-  │ номер  │  ния  │ во  │                  │                                   │         ├─────────┬─────────┬─────────┬─────────┤       │
    │                         │      │ драгоценных  │        │       │     │                  │                                   │         │         │         │         │         │       │
    │                         │      │ материалов   │        │       │     │                  │                                   │         │         │         │         │         │       │
    ├─────────────────────────┼──────┼──────────────┼────────┼───────┼─────┼──────────────────┼───────────────────────────────────┼─────────┼─────────┼─────────┼─────────┼─────────┼───────┤
    │            1            │  2   │       3      │   4    │   5   │  6  │         7        │                 8                 │    9    │    10   │    11   │    12   │    13   │  14   │
    ├─────────────────────────┼──────┼──────────────┼────────┼───────┼─────┼──────────────────┼───────────────────────────────────┼─────────┼─────────┼─────────┼─────────┼─────────┼───────┤
.begin
  N2 := if(N1 > N2, N1, N2);

  if (N2 = 0)
    N2 := 1;

  NN := N2 + N3 - 1;
  N1 := 0;
end.
.{WHILE N1<NN
.begin
  N1 := N1 + 1;
end.
.fields
  if(N1 > N2, Массив_Наименование_Объекта [N1 - N2 + 1],
              if(N1 = 1, Массив_Наименование_Объекта [1], ''))
  if(N1 > N2, Массив_Количество_Объектов  [N1 - N2 + 1],
              if(N1 = 1, Массив_Количество_Объектов  [1], ''))

  Массив_Наименование_ДрагМеталлов   [N1]
  Массив_Номенклат_Номер_ДрагМеталлов[N1]
  Массив_ЕдИзм_ДрагМеталлов          [N1]
  Массив_Масса_ДрагМеталлов          [N1]

  Массив_ИнфоМемо[N1]
.endfields
    │@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&│@@@@@@@@@@@@@@│&&&&&&&&│@~@@@@@│     │&&&&&.&&&&&&&&&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│         │         │         │         │         │       │
.begin
  bWasMemo := true;
end.
.}
    ├─────────────────────────┼──────┼──────────────┼────────┼───────┼─────┼──────────────────┼───────────────────────────────────┼─────────┼─────────┼─────────┼─────────┼─────────┼───────┤
    │                         │      │              │        │       │     │                  │В том числе:                       │         │         │         │         │         │       │
    │                         │      │              │        │       │     │                  │материалы                          │         │         │         │         │         │       │
    └─────────────────────────┴──────┴──────────────┴────────┴───────┴─────┴──────────────────┴───────────────────────────────────┴─────────┴─────────┴─────────┴─────────┴─────────┴───────┘

.fields
  ЛОзаВК_Должность
  ЛОзаВК
.endfields

     Лицо, ответственное за ведение инвентарной карточки  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д    ____________________________      Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                                                       должность                            подпись                                   расшифровка подписи
 Р

.}
.endform

.linkform 'FormOS6Ru_Old' prototype is 'FormOS6'
.NameInList 'Инвентарная карточка (форма N ОС-6) Россия (до 21.01.2003)'
.group 'OS_Form6_Rus'
.group 'Бюджетная организация'
.hide
.defo portrait
.p 86
.Create View PrSob
 From
  ExClassVal  (ReadOnly),
  ExClassName (ReadOnly),
  ExClassSeg  (ReadOnly)
where
((
//----получаем ссылку на внешнюю классификацию------------
   word(coKatos)                   == ExClassName.wTable    and
   'Признак собственности объекта' == ExClassName.Name      and
//----получаем ссылку на сегмент вн. классификации--------
   ExClassName.ClassCode           == ExClassVal.ClassCode  and
   KatOsNRec                       == ExClassVal.cRec       and
//----получаем признак собственности----------------------
   ExClassVal.cClassSeg            == ExClassSeg.Nrec
))
;
.var
  PriznakSobstvennosty : string;
  bWasDrag : boolean // флаг того, что были выведены драгметаллы
  bWasMemo : boolean // флаг того, что была выведена доп информации
  Vid          : string;
  Kod          : string;
  wCountry     : word;
  strNDE       : string;
.endvar
#include funcOs.frn
end.  // funcOs.frn - вынес из файла чтобы не создавалась пустая строка перед формой
.begin
  bWasDrag := false;
  bWasMemo := false;
  wCountry := wGetTune('Country');
  strNDE   := sGetTune('NDE.ShortRub') + sGetTune('NDE.ShortKop');
  PriznakSobstvennosty := '';
  if (PrSob.GetFirst ExClassName = tsOK)
    if (PrSob.GetFirst ExClassVal = tsOk)
      if (PrSob.GetFirst ExClassSeg  = tsOk )
        PriznakSobstvennosty := ExClassSeg.Name;
end.
.{
.fields
  '(Метод учета: ' +Метод_Учета +')'
.endfields
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                               Типовая межотраслевая форма N ОС-6
                                                                                                                 Утверждена постановлением Госкомстата
                                                                                                                              России от 30.10.97 N 71a Ш
.fields
 Инвентарный_Номер
 Организация_Наименование
 Организация_ОКПО
 strNDE
 Отчетный_период
 Дата_Документа_Получения
 Номер_Документа_Получения
 String(Количество_Объектов, 6 , byte(Десят_Знаков_Количества))
 Стоимость_Объектов
.endfields

                      Инвентарная карточка N  Д@@@@@@@@@@@@@ Д
                          учета основных средств Ш
                                                                                                                                              ┌─────────┐
                                                                                                                                              │  Коды   │
                                                                                                                                              ├─────────┤
                                                                                                                                Форма по ОКУД │ 0306005 │
                                                                                                                                              ├─────────┤
 Ш    БОрганизация  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Е   Ш      по ОКПО │@~@@@@@@@│
                                                                                                                                              └─────────┘
                                                                                           ┌──────────┬───────────────────────────┬──────┬───────────────┐
                                                                                           │Дата сос- │ Документ на оприходование │Коли- │Первоначальная │
                                                                                           │тавления  ├──────────┬────────────────┤чество│стоимость всех │
                                                                                           │          │   дата   │     номер      │объек-│объектов,      │
                                                                                           │          │          │                │тов   │@~@@@@@@@@@@@@@│
                                                                                           ├──────────┼──────────┼────────────────┼──────┼───────────────┤
                                                                                           │@@@@@@@@@@│@@@@@@@@@@│@~@@@@@@@@@@@@@@│&&&&&&│&&&&&&&&&&&&.&&│
                                                                                           └──────────┴──────────┴────────────────┴──────┴───────────────┘
.fields
 Наименование_ОС
 Наименование_Изготовителя
 Тип_Марка
 strNDE
.endfields

      Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                                           полное наименование и назначение объекта

      Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                                            наименование организации-изготовителя

      Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                                                      модель,тип,марка

    ┌─────────────────┬───────┬───────┬────────┬───────────────┬───────┬─────────┬─────────────────────┬─────────────────────────────┬───────────────────┐
    │   Структурное   │ Вид   │ Счет, │  Код   │ Первоначальная│ Срок  │  Норма  │        Код          │             Объект          │      Акт о        │
    │  подразделение  │ дея-  │субсчет│ анали- │  (балансовая) │полез- │амортиза-├────────┬────────────┤         (оборудование)      │     вводе в       │
    │                 │ тель- │       │ тичес- │   стоимость,  │ного   │ции,% или│нормы   │счета и объ-│                             │   эксплуатацию    │
    │                 │ ности │       │ кого   │ @~@@@@@@@@@@@ │исполь-│сметная  │аморти- │екта АУ (для├───────────────────┬─────────┼──────────┬────────┤
    │                 │       │       │ учета  │               │зования│ ставка  │зацион- │отнесения   │        вид        │   код   │   дата   │  номер │
    │                 │       │       │        │               │       │         │ных от- │амортизации │                   │         │          │        │
    │                 │       │       │        │               │       │         │числений│осн.средств)│                   │         │          │        │
    ├─────────────────┼───────┼───────┼────────┼───────────────┼───────┼─────────┼────────┼────────────┼───────────────────┼─────────┼──────────┼────────┤
    │        1        │   2   │   3   │   4    │       5       │   6   │    7    │   8    │      9     │         10        │    11   │    12    │   13   │
    ├─────────────────┼───────┼───────┼────────┼───────────────┼───────┼─────────┼────────┼────────────┼───────────────────┼─────────┼──────────┼────────┤
.begin
  if (wCountry = 0)
  {
    Vid := Вид_Оборудования_ОКОФ;
    Kod := Код_Оборудования_ОКОФ;
  }
  else
  {
    Vid := Вид_Оборудования;
    Kod := Код_Оборудования;
  }
end.
.fields
 Подразделение
 if (Вид_деятельности=0,'Осн.','Не осн.')
 Счет_Субсчет
 КАУ
 Стоимость
 SrokIspEdIzmWord (Срок_Использования)
 string(Норма_Амортизации, 10, 6)
 Код_Нормы_Амортизации
 Счет_Субсчет_Аморт
 Vid
 Kod
 Дата_Документа_Ввода
 Номер_Документа_Ввода
 strNDE
.endfields
    │@@@@@@@@@@@@@@@@@│@@@@@@@│@~@@@@@│@~@@@@@@│&&&&&&&&&&&&.&&│@~@@@@@│&&.&&&&&&│@~@@@@@@│@~@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@│@~@@@@@@@│@@@@@@@@@@│@~@@@@@@│
    └─────────────────┴───────┴───────┴────────┴───────────────┴───────┴─────────┴────────┴────────────┴───────────────────┴─────────┴──────────┴────────┘
    ┌──────┬───────────────────────┬────────────┬──────┬────────────────────────────────────────────────────┬────────────────────────────────────────────┐
    │      │                       │            │      │          Содержание драгоценных материалов         │                                            │
    │При-  │        Номер          │Сумма начис-│Год   │              (металлов, камней и т.п.)             │              Выбыло (передано)             │
    │знак  ├───────┬───────┬───────┤ленной амор-│выпус-├─────────────┬───────┬───────────┬──────────────────┼───────────────────┬────────────────────────┤
    │собс- │инвен- │завод- │ пас-  │тизации,    │ка,   │наименование │номенк-│ единица   │    количество    │   по документу    │     причина выбытия    │
    │твен- │тарный │ской   │ порта │ @~@@@@@@@@ │(пост-│драгоценных  │латур- │измерения  │     (масса)      │                   │      (перемещения)     │
    │ности │       │       │       │            │ройки)│материалов   │ный    ├───────┬───┤                  ├──────────┬────────┼──────────────────┬─────┤
    │      │       │       │       │            │      │             │номер  │наиме- │код│                  │   дата   │ номер  │   наименование   │ код │
    │      │       │       │       │            │      │             │       │нование│   │                  │          │        │                  │     │
    ├──────┼───────┼───────┼───────┼────────────┼──────┼─────────────┼───────┼───────┼───┼──────────────────┼──────────┼────────┼──────────────────┼─────┤
    │  14  │  15   │  16   │  17   │    18      │  19  │     20      │  21   │  22   │ 23│        24        │    25    │   26   │         27       │  28 │
    ├──────┼───────┼───────┼───────┼────────────┼──────┼─────────────┼───────┼───────┼───┼──────────────────┼──────────┼────────┼──────────────────┼─────┤
.fields
  if( bWasDrag, '', PriznakSobstvennosty/*Признак_Собственности*/)
  if( bWasDrag, '', Инвентарный_Номер)
  if( bWasDrag, '', Заводской_Номер)
  if( bWasDrag, '', Номер_Паспорта)
  if( bWasDrag, '', Сумма_Амортизации)
  if( bWasDrag, '', Год_Выпуска)
  Наименование_ДрагМеталлов
  Номенклат_Номер_ДрагМеталлов
  ЕдИзм_ДрагМеталлов
  Масса_ДрагМеталлов
  if( bWasDrag, '', Дата_Документа_Выбытия)
  if( bWasDrag, '', Номер_Документа_Выбытия)
  if( bWasDrag, '', Причина_Выбытия)
  if( bWasDrag, '', Код_Причины_Выбытия)
.endfields
.{ FormOS6Amortization CheckEnter
.}
.{ FormOS6Pereoc CheckEnter
.}
.{ FormOS6Oper CheckEnter
.}
.{ FormOS6ModernNew CheckEnter
.}
#ifdef __YUKOS_OSSP__
.{ FormOS6OsMc   CheckEnter
.}
#end
.{ FormOS6Drag   CheckEnter
    │@@@@@@│@@@@@@@│@@@@@@@│@@@@@@@│&&&&&&&&&.&&│ @@@@ │@@@@@@@@@@@@@│@~@@@@@│@@@@@@@│   │&&&&&.&&&&&&&&&&&&│@@@@@@@@@@│@~@@@@@@│@@@@@@@@@@@@@@@@@@│@~@@@│
.begin
  bWasDrag := true;
end.
.}
.{?INTERNAL;(not bWasDrag)
.fields
  /*Признак_Собственности*/PriznakSobstvennosty
  Инвентарный_Номер
  Заводской_Номер
  Номер_Паспорта
  Сумма_Амортизации
  Год_Выпуска
  Дата_Документа_Выбытия
  Номер_Документа_Выбытия
  Причина_Выбытия
  Код_Причины_Выбытия
.endfields
    │@@@@@@│@@@@@@@│@@@@@@@│@@@@@@@│&&&&&&&&&.&&│ @@@@ │             │       │       │   │                  │@@@@@@@@@@│@~@@@@@@│@@@@@@@@@@@@@@@@@@│@~@@@│
.}
    └──────┴───────┴───────┴───────┴────────────┴──────┴─────────────┴───────┴───────┴───┴──────────────────┴──────────┴────────┴──────────────────┴─────┘
.fields
  strNDE
  Сумма_Износа_В_Месяц
.endfields
                                        ┌─────────────────┐
              Сумма износа, @@@@@@@@@@@ │&'&&&&&&&&&&&&.&&│
                                        └─────────────────┘
 Ш
.{ FormOS6Modern CheckEnter
.}
.{ FormOS6Memo   CheckEnter
.}

.}
.endform

!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------

.linkform 'FormOS6Ru2_Old' prototype is 'FormOS6'
.NameInList 'Инвентарная карточка (форма N ОС-6) Россия (оборотная сторона) (до 21.01.2003)'
.group 'OS_Form6_Rus'
.group 'Бюджетная организация'
.hide
.defo landscape
.var
  bWasDrag : boolean // флаг того, что были выведены драгметаллы
  bWasMemo : boolean // флаг того, что была выведена доп информации
  strNDE   : string;
.endvar
.begin
  bWasDrag := false;
  bWasMemo := false;
  strNDE   := sGetTune('NDE.ShortRub') + sGetTune('NDE.ShortKop');
end.
.{
.{ FormOS6Amortization CheckEnter
.}
.{ FormOS6Pereoc CheckEnter
.}
.{ FormOS6Oper CheckEnter
.}
.{ FormOS6ModernNew CheckEnter
.}
#ifdef __YUKOS_OSSP__
.{ FormOS6OsMc   CheckEnter
.}
#end
.{ FormOS6Drag   CheckEnter
.}
.fields
 strNDE
 strNDE
 strNDE
.endfields
 И                                                                                                      Оборотная сторона формы N ОС-6
  ┌───────────────────────────────────────────┬──────────────────────────────────────────────────────────────────────────────────────┐
  │          Достройка,дооборудование,        │                   Ремонт объекта (бухгалтерская запись)                              │
  │    реконструкция,модернизация объекта     │                                                                                      │
  │           (бухгалтерская запись)          │                                                                                      │
  ├──────────┬──────┬───────┬─────────────────┼──────────┬──────┬────────┬────────────────┬──────────┬──────┬───────┬────────────────┤
  │   дата   │номер │инвен- │  сумма затрат,  │   дата   │номер │инвен-  │ сумма затрат,  │   дата   │номер │инвен- │ сумма затрат,  │
  │          │      │тарный │  @~@@@@@@@@@@@  │          │      │тарный  │ @~@@@@@@@@@@@  │          │      │тарный │ @~@@@@@@@@@@@  │
  │          │      │номер  │                 │          │      │номер   │                │          │      │номер  │                │
  ├──────────┼──────┼───────┼─────────────────┼──────────┼──────┼────────┼────────────────┼──────────┼──────┼───────┼────────────────┤
  │    1     │  2   │    3  │        4        │    5     │  6   │   7    │       8        │     9    │  10  │   11  │       12       │
  ├──────────┼──────┼───────┼─────────────────┼──────────┼──────┼────────┼────────────────┼──────────┼──────┼───────┼────────────────┤
.fields
  Дата_Документа_Модернизации
  Номер_Документа_Модернизации
  Инв_Номер
  Сумма_Модернизации
  Дата_Документа_Ремонт1
  Номер_Документа_Ремонт1
  Инв_Номер_Ремонт1
  Сумма_Ремонт1
  Дата_Документа_Ремонт2
  Номер_Документа_Ремонт2
  Инв_Номер_Ремонт2
  Сумма_Ремонт2
.endfields
.{ FormOS6Modern CheckEnter
  │@@@@@@@@@@│@@@@@@│@~@@@@@│&&&&&&&&&&&&&&.&&│@@@@@@@@@@│@@@@@@│@~@@@@@ │&&&&&&&&&&&&&.&&│@@@@@@@@@@│@@@@@@│@~@@@@@│&&&&&&&&&&&&&.&&│
.}
  └──────────┴──────┴───────┴─────────────────┴──────────┴──────┴────────┴────────────────┴──────────┴──────┴───────┴────────────────┘

                                     ЙКраткая индивидуальная характеристика объекта Й
  ┌───────────────────────────────────────────────────┬──────────────────────────────────────────────────────────────────────────────┐
  │                                                   │         Материалы, размеры и прочие сведения                                 │
  │ Наименование конструктивных элементов и других    ├─────────────────────────┬────────────────────────────────────────────────────┤
  │       признаков,характеризующих объект            │     основной объект     │ наименование важнейших пристроек, приспособлений и │
  │                                                   │                         │ принадлежностей, относящихся к основному объекту   │
  ├───────────────────────────────────────────────────┼─────────────────────────┼────────────┬─────────────┬─────────────┬───────────┤
  │                        1                          │            2            │     3      │     4       │     5       │     6     │
  ├───────────────────────────────────────────────────┼─────────────────────────┼────────────┼─────────────┼─────────────┼───────────┤
.fields
  InfoMemo
.endFields
.{ FormOS6Memo   CheckEnter
  │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│                         │            │             │             │           │
.begin
  bWasMemo := true;
end.
.}
.{?INTERNAL;(not bWasMemo)
  ├───────────────────────────────────────────────────┼─────────────────────────┼────────────┼─────────────┼─────────────┼───────────┤
  ├───────────────────────────────────────────────────┼─────────────────────────┼────────────┼─────────────┼─────────────┼───────────┤
  ├───────────────────────────────────────────────────┼─────────────────────────┼────────────┼─────────────┼─────────────┼───────────┤
  ├───────────────────────────────────────────────────┼─────────────────────────┼────────────┼─────────────┼─────────────┼───────────┤
  ├───────────────────────────────────────────────────┼─────────────────────────┼────────────┼─────────────┼─────────────┼───────────┤
.}
  └───────────────────────────────────────────────────┴─────────────────────────┴────────────┴─────────────┴─────────────┴───────────┘

     Карточку заполнил __________________     __________________     ______________________
                          должность                подпись            расшифровка подписи

     "___" _________________ 20__ г.
 И

.}
.endform

!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------

! Инвентарная карточка (для бюджетных организаций) <<Россия>>
#include InvCardOSBudget.frn

!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
