!╔════════════════════════════════════════════════════════════════════════════╗
!║                     (c) Корпорация ГАЛАКТИКА, 1996, 2004                   ║
!║ Проект        : ГАЛАКТИКА                                                  ║
!║ Система       : Оперативный контур - Складской учет                        ║
!║ Версия        : 5.85                                                       ║
!║ Назначение    : Просмотр текущих остатков матценностей                     ║
!║ Разработал    : Швайковский Дмитрий Владимирович                           ║
!╚════════════════════════════════════════════════════════════════════════════╝

#doc
Просмотр текущих остатков матценностей
#end
.set name = 'rtTekOst'
.hide
.fields
 NDESim :string
 ValSim :string

 MCNrec :comp  BarKod :string  MCName :string  EdIzm :string
  PodrNrec  :comp  PodrName  :string
   MOLNrec   :comp  MOLName   :string
    PartyNrec :comp  PartyName :string
     averPrice :double
     averVPrice :double
     kolOstatok :double
     sumOstatok :double
     sumVOstatok :double
     kolRezerv :double
     sumRezerv :double
     sumVRezerv :double
     kolSvobodno :double
     sumSvobodno :double
     sumVSvobodno :double
.endfields
 ^ ^
.{
 ^ ^ ^ ^
.{
  ^ ^
.{
   ^ ^
.{
    ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.}
.}
.}
.endform

//=============================================================================
#doc
Текущие остатки МЦ (в НДЕ)
#end
.linkform 'rtTekOst_01' prototype is 'rtTekOst'
.NameInList ' Текущие остатки МЦ (в НДЕ)'
.group 'Отчеты в НДЕ'
.PAPER PA4
.ORIENT LANDSCAPE
.fields
  NDESim NDESim NDESim NDESim
.endfields
 Б                                      ТЕКУЩИЕ ОСТАТКИ МЦ

┌──────────────────────────┬──────────────────────────┬─────────────────────────┬───────────────┬───────────────────────────────┬───────────────────────────────┬───────────────────────────────┐
│                          │                          │                         │ Средняя цена  │        Остаток                │         Резерв                │         Свободно              │
│        Склад             │          МОЛ             │         Партия          │               ├───────────────┬───────────────┼───────────────┬───────────────┼───────────────┬───────────────┤
│                          │                          │                         │  в @@@@@@     │   Кол-во      │ Сумма в @@@@@@│   Кол-во      │ Сумма в @@@@@@│   Кол-во      │ Сумма в @@@@@@│
└──────────────────────────┴──────────────────────────┴─────────────────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┘ Б

.{
.fields
  MCName BarKod EdIzm
.endfields
 Б @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Код:@@@@@@@@@@@@@ Ед. изм.:@@@@@@@@@@@@@@ Б
.{
.{
.fields
   PodrName
   MOLName  PartyName averPrice
   kolOstatok sumOstatok  kolRezerv sumRezerv kolSvobodno sumSvobodno
.endfields
.{
 @@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&.&& &'&&&&&&&&&&&&& &'&&&&&&&&&&.&& &'&&&&&&&&&&&&& &'&&&&&&&&&&.&& &'&&&&&&&&&&&&& &'&&&&&&&&&&.&&
.}
.}
.}

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
.}
.endform
 Е
 Е//=============================================================================
#doc
Текущие остатки МЦ (в НДЕ)
#end
.linkform 'rtTekOst_02' prototype is 'rtTekOst'
.NameInList ' Текущие остатки МЦ (в НДЕ)'
.group 'Отчеты в валюте'
.PAPER PA4
.ORIENT LANDSCAPE
.fields
  ValSim ValSim ValSim ValSim
.endfields
 Б                                      ТЕКУЩИЕ ОСТАТКИ МЦ

┌──────────────────────────┬──────────────────────────┬─────────────────────────┬───────────────┬───────────────────────────────┬───────────────────────────────┬───────────────────────────────┐
│                          │                          │                         │ Средняя цена  │        Остаток                │         Резерв                │         Свободно              │
│        Склад             │          МОЛ             │         Партия          │               ├───────────────┬───────────────┼───────────────┬───────────────┼───────────────┬───────────────┤
│                          │                          │                         │  в @@@@@@     │   Кол-во      │ Сумма в @@@@@@│   Кол-во      │ Сумма в @@@@@@│   Кол-во      │ Сумма в @@@@@@│
└──────────────────────────┴──────────────────────────┴─────────────────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┘ Б

.{
.fields
  MCName BarKod EdIzm
.endfields
 Б @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Код:@@@@@@@@@@@@@ Ед. изм.:@@@@@@@@@@@@@@ Б
.{
.{
.fields
   PodrName
   MOLName  PartyName averVPrice
   kolOstatok sumVOstatok kolRezerv sumVRezerv kolSvobodno sumVSvobodno
.endfields
.{
 @@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&.&& &'&&&&&&&&&&&&& &'&&&&&&&&&&.&& &'&&&&&&&&&&&&& &'&&&&&&&&&&.&& &'&&&&&&&&&&&&& &'&&&&&&&&&&.&&
.}
.}
.}

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
.}
.endform
